Repository: dGs-/WAPT-Documentation
Catalog: source/locale/*/LC_MESSAGES/wapt-usage/wapt-console-detail.po
Languages: fr

source: Using the WAPT console
fr: Utiliser la console WAPT

source: Using the WAPT console (detailed)
fr: Utiliser la console WAPT (version détaillée)

source: Some functionalities detailed here are only available with the **Enterprise** version of WAPT.
fr: Certaines fonctionnalités détaillés ici sont disponible uniquement en version **Entreprise**.

source: Software inventory as registered in the Windows registry of the host
fr: Inventaire des clients enregistrés dans WAPT

source: How to perform actions of the hosts?
fr: Agir sur les machines

source: Host configuration menu
fr: Menu de configuration des postes

source: List of actions available to be performed on the hosts from the WAPT console
fr: Liste des fonctions de configuration des Postes client dans la console WAPT

source: Multi-selection
fr: Multi-sélection

source: Edit the configuration of the host
fr: Modifier la liste des paquets de la machine

source: Refresh the list of available packages
fr: Actualiser la liste des paquets disponibles

source: Offer the user to launch an upgrade
fr: Proposer aux utilisateurs de lancer un upgrade

source: Send a message to the selected hosts
fr: Envoyer un message aux machines sélectionnées

source: Audit the packages installed on selected hosts
fr: Auditer les paquets installés sur les postes sélectionnés

source: Add one or more packages on selected hosts
fr: Ajouter un ou plusieurs paquets aux machines sélectionnées

source: Remove one or more packages from selected hosts
fr: Retirer un ou plusieurs paquets aux machines sélectionnées

source: Prevent packages from being installed on hosts
fr: Interdire l'installation des paquets sur les machines

source: Remove the host and/or the host package
fr: Supprimer la machine et/ou le paquet machine

source: Launch TIShelp with a remote host
fr: Lancer TISHelp sur la machine distante

source: Initiate a VNC connection with the remote host
fr: Lancer une connexion VNC avec la machine distante

source: Connect via Veyon
fr: Se connecter avec Veyon

source: Launch a RDP connection on the selected host
fr: Lancer une connexion RDP avec le poste sélectionné

source: Launch remote user support (msra.exe)
fr: Lancer une assistance à distance (msra.exe)

source: Manage hosts with :program:`compmgmt.msc`
fr: Gérer les machines avec :program:`compmgmt.msc`

source: Manage Users and Groups with :program:`lusrmgr.msc`
fr: Gérer les Utilisateurs et les Groupes avec :program:`lusrmgr.msc`

source: Manage Services with :program:`services.msc`
fr: Gérer les services avec :program:`services.msc`

source: Send a WakeOnLAN special packet to selected hosts
fr: Envoyer une requête WakeOnLAN aux machines sélectionnées

source: Search for applicable Windows updates
fr: Rechercher des mises à jour Windows à appliquer

source: Download pending Windows updates
fr: Télécharger les mise à jour Windows en attente

source: Trigger the installation of pending Windows updates
fr: Installer les mises à jour Windows en attente

source: Add Active Directory groups to the selected machines
fr: Ajouter les groupes AD des machines sélectionnées en dépendance

source: Trigger an inventory update on selected hosts
fr: Lancer une remontée d'inventaire des machines sélectionnées

source: Restart the WAPT service
fr: Redémarrer le service WAPT

source: Searching a host
fr: Rechercher une machine

source: *Search* function in WAPT
fr: Fonction *Rechercher* de WAPT

source: Allow to search for a value in the selected column.
fr: Permet de rechercher une valeur dans la colonne sélectionnée.

source: Filters and actions available with Organizational Units
fr: Filtres et actions avec les Unités Organisationnelles

source: WAPT console showing options applicable to OU
fr: Console WAPT affichant les options applicables aux UO

source: In the **Enterprise** version, you may filter how hosts are displayed based on the Active Directory :abbr:`OU (Organizational Units)` they belong to.
fr: **En version entreprise**, vous pouvez filtrer l'affichage des postes en fonction des :abbr:`UO (Unités Organisationelles)` dans laquelle ils sont placés dans l'Active Directory

source: The checkbox :guilabel:`Include hosts in subfolders` allows to display hosts in subfolders.
fr: La case :guilabel:`Inclure les postes des sous dossiers` permet d'afficher les machines présentes dans les sous-dossiers.

source: You may also choose to create *unit* packages by :menuselection:`Right clicking on an OU --> Create or edit the unit package`.
fr: Vous pouvez également créer des paquet *unit* avec un :menuselection:`clic droit sur une UO --> Créer ou éditer le paquet de l'Unité Organisationnelle`.

source: Show the inventory
fr: Afficher l'inventaire

source: When the WAPT agents :command:`register`, they send some informations to the WAPT Server.
fr: Quand les clients lancent leur :command:`register`, ils remontent certaines informations au serveur WAPT.

source: Informations displayed in the console are not updated in real-time, you have to refresh the display to view new status and informations.
fr: Les informations affichées dans la console ne sont donc pas actualisées en temps réel, il faudra régulièrement actualiser l'affichage dans la console pour faire apparaître les nouvelles informations.

source: Click on the :guilabel:`Refresh` button or press :kbd:`F5` on the keyboard.
fr: Cliquer sur le bouton :guilabel:`Actualiser` ou appuyer sur la touche :kbd:`F5` du clavier.

source: WAPT console displaying inventory
fr: Console WAPT affichant l'inventaire

source: The WAPT console lists hosts that are registered with the WAPT Server and some informations that are useful for managing the hosts.
fr: La console liste les machines inscrites sur le serveur WAPT et certaines informations utiles à leur gestion.

source: Selecting a host displays its informations in the right panel of the WAPT console (:guilabel:`Hardware inventory` and :guilabel:`Software inventory`).
fr: Sélectionner une machine dans la liste affiche ses détails d'inventaire dans la partie :guilabel:`Inventaire matériel et inventaire logiciel` dans la partie droite dans la console.

source: Hardware inventory displays the hardware inventory of the host
fr: Consulter l'inventaire matériel et inventaire logiciel des machines

source: Common informations displayed in the :guilabel:`Hardware inventory` tab are:
fr: Les informations affichées par défaut dans l'onglet général sont :

source: the name of the host;
fr: le nom de la machine ;

source: the description of the host;
fr: la description de la machine ;

source: the operating system running on the host;
fr: le système d'exploitation ;

source: the IP address of the host;
fr: l'adresse IP de la machine ;

source: the last WAPT task that was run on the host;
fr: la dernière tâche WAPT exécutée ;

source: the manufacturer of the host;
fr: le constructeur de la machine ;

source: the model of the host;
fr: le modèle de machine ;

source: the date of the latest update on the host;
fr: la date de la dernière mise à jour de la machine ;

source: the name of the user last or currently connected on host;
fr: l'utilisateur connecté actuellement ou dernièrement sur le poste ;

source: Host summary
fr: Résumé de l'état de la machine

source: Status of packages in the WAPT console
fr: Statut des paquets dans la console WAPT

source: Status
fr: Statut

source: List of installed WAPT packages
fr: La liste des paquets WAPT installés.

source: Status: **OK**
fr: Statut : **OK**

source: List of packages waiting to be installed
fr: Liste des paquets en attente d'installation

source: Status: **MISSING**
fr: Statut : **MISSING**

source: List of packages pending updates
fr: Liste des paquets en attente d'une mise à jour

source: Status: **NEED-UPGRADE**
fr: Statut : **NEED-UPGRADE**

source: List of packages that have failed to install
fr: Liste des paquets dont l'installation a échoué

source: Status: **ERROR**
fr: Statut : **ERROR**

source: When a package returns a status **ERROR**, click on it to show the details of the error. Errors are print messages in the :file:`setup.py` of your packages.
fr: Lorsqu'un paquet est en statut ``ERROR``, cliquer sur le paquet pour afficher l'erreur remontée.

source: Error detail
fr: Détail de l'erreur

source: Acting on packages installed on a host
fr: Agir sur les paquets installés sur la machine

source: Possible actions for WAPT packages
fr: Action possibles pour les paquets WAPT

source: multiple selection of packages is possible;
fr: la sélection multiple est possible ;

source: the host must be seen by the WAPT Server when the action is launched;
fr: la machine doit être joignable au moment de l'action ;

source: if several hosts are selected, the action will be launched on all selected hosts;
fr: si plusieurs machines sont sélectionnées, l'action sera lancée sur toutes les machines sélectionnées ;

source: Acting on packages installed on a specific host
fr: Agir sur les paquets installés sur la machine

source: Install a package
fr: Installer un paquet

source: installs the selected package on selected hosts
fr: installe le paquet sélectionné sur les machines sélectionnées

source: Force a package
fr: Forcer un paquet

source: forces the re-installation of a selected package on selected hosts
fr: force la réinstallation d'un paquet sélectionné sur les machines sélectionnées

source: Remove a package
fr: Supprimer un paquet

source: removes the selected package from the selected hosts
fr: désinstalle le paquet sélectionné sur les machines sélectionnées

source: Forget a package
fr: Oublier un paquet

source: tells the selected hosts not to use WAPT for managing the selected package
fr: demande aux machines sélectionnées de ne plus utiliser WAPT pour gérer le paquet sélectionné

source: Audit the package
fr: Auditer le paquet

source: triggers an audit on the selected package
fr: lance un audit forcé du paquet sélectionné

source: Hardware inventory tab
fr: Onglet Matériel

source: Informations displayed by default in the :guilabel:`Hardware inventory` tab are:
fr: Les informations affichées par défaut dans l'onglet :guilabel:`Inventaire matériel` sont :

source: informations on the host's hardware components;
fr: les informations sur les composants matériels de la machine ;

source: some informations about the host;
fr: diverses informations sur la machine ;

source: some information on the status of WAPT;
fr: diverses informations sur l'état de WAPT ;

source: Host hardware inventory
fr: Inventaire matériel d'une machine

source: A :guilabel:`Filter` box allows to search for hosts.
fr: Un :guilabel:`Filtre` permet de rechercher des machines.

source: Filters work with `regular expression <https://en.wikipedia.org/wiki/Regular_expression>`_.
fr: Les filtres fonctionnent en `expression régulière <https://en.wikipedia.org/wiki/Regular_expression>`_.

source: To add a column in the grid, drag and drop a hardware property from the :guilabel:`Hardware inventory` grid to the main grid.
fr: Pour ajouter une colonne dans la vue grille, glisser-déposer une propriété d'inventaire matériel depuis la grille :guilabel:`Inventaire Matériel` vers la grille principale.

source: Example: in :guilabel:`hosts`, drag and drop *physical_memory* in the left panel, and the column :guilabel:`physical_memory` appears in the main grid.
fr: Exemple : glisser la propriété ``physical_memory`` sur la partie gauche, et la colonne :guilabel:`physical_memory` apparaît dans la grille principale.

source: Adding a criteria to the main grid of the WAPT console
fr: Ajouter un critère à la grille principale de la console WAPT

source: Software inventory tab
fr: Onglet Logiciel

source: Common informations displayed in the :guilabel:`Sofware inventory` tab are:
fr: Les informations affichées par défaut dans l'onglet :guilabel:`Inventaire logiciel` sont :

source: :guilabel:`maker`
fr: :guilabel:`éditeur` ;

source: :guilabel:`software name`
fr: :guilabel:`nom du logiciel` ;

source: :guilabel:`software version`;
fr: :guilabel:`version du logiciel` ;

source: :guilabel:`installation date`;
fr: :guilabel:`date d'installation` ;

source: :guilabel:`uninstall key`;
fr: :guilabel:`clé de désinstallation` ;

source: :guilabel:`uninstall string`;
fr: :guilabel:`chaîne de désinstallation` ;

source: Windows update tab
fr: Onglet Windows Updates

source: Informations displayed in the :guilabel:`Hardware inventory` tab are:
fr: Les informations affichées par défaut dans l'onglet :guilabel:`Windows Updates` sont :

source: Windows update agent version;
fr: la version de l'agent Windows Updates ;

source: date of the last Windows update scan;
fr: la date du dernier scan Windows Updates ;

source: duration of the last scan;
fr: la durée du dernier scan ;

source: WAPTWUA status;
fr: le status de WAPTWUA ;

source: date of the last version of :file:`wsusscn2.cab` processed by WAPT;
fr: la date de modification du dernier :file:`wsusscn2.cab` traité par WAPT ;

source: status of WAPTWUA Enabled (True/ False);
fr: status de WAPTWUA Enabled (True / False) ;

source: The grid then lists Windows cab files that have been installed or that are pending installation.
fr: La grille affiche ensuite la liste des cab Windows installés ou en attente d'installation.

source: Informations displayed in the :guilabel:`Windows Updates` tab are:
fr: Les informations affichées par défaut la grille de l'onglet :guilabel:`Windows Updates` sont :

source: :guilabel:`installation on`;
fr: :guilabel:`Installed on` ;

source: Inventory of Windows Updates
fr: Inventaire des mises à jour Windows

source: Task tab
fr: Onglet Tâches

source: Informations displayed by default in the :guilabel:`Tasks` tab are:
fr: Les informations affichées par défaut dans l'onglet :guilabel:`Taches` sont :

source: pending tasks;
fr: les tâches en attente ;

source: Details of pending tasks on the host
fr: Détail des tâches en attente sur la machine

source: completed tasks;
fr: les tâches terminées ;

source: Details of completed tasks
fr: Détail des tâches terminées sur la machine

source: tasks in error;
fr: les tâches en erreur ;

source: Details of tasks in error
fr: Détail des tâches en erreur sur la machine

source: Perform a global search on all hosts
fr: Rechercher sur l'ensemble des postes

source: Performing global searches on all the criteria presented above is possible.
fr: Il est possible de faire une recherche globale sur la totalité des informations décrites précédemment.

source: Choose the filters to check or uncheck.
fr: Cocher ou décocher les filtres de votre choix.

source: Advanced search functionalities in the WAPT console
fr: Fonctions de recherches avancées de la console WAPT

source: Choice of filters
fr: Choix des filtres

source: Possible options
fr: Choix possibles

source: :guilabel:`Host`
fr: :guilabel:`Machine`

source: :guilabel:`Host` section in the :guilabel:`Hardware inventory` tab when a host is selected
fr: Partie host dans l'onglet :guilabel:`Inventaire matériel` lorsque l'on sélectionne une machine

source: :guilabel:`Hardware`
fr: :guilabel:`Matériel`

source: :guilabel:`DMI` section in the :guilabel:`Hardware inventory` tab when a host is selected
fr: :guilabel:`DMI` dans l'onglet :guilabel:`Inventaire matériel` lorsque l'on sélectionne une machine

source: :guilabel:`Software`
fr: :guilabel:`Logiciel`

source: :guilabel:`Software inventory` section when a host is selected
fr: Partie :guilabel:`Inventaire logiciel` lorsque l'on clique sur une machine

source: :guilabel:`Package`
fr: :guilabel:`Paquet`

source: List of packages installed on the selected hosts
fr: Liste des paquets installés sur les postes sélectionnés

source: :guilabel:`Have errors`
fr: :guilabel:`Ont des erreurs`

source: Search only for hosts for which a tasks has not finished correctly
fr: Rechercher uniquement sur les machines qui sont en erreur

source: :guilabel:`Needing upgrades`
fr: :guilabel:`Nécessite des mise à jour`

source: Search only for hosts needing upgrades
fr: Rechercher uniquement des machines qui nécessitent une mise à jour

source: :guilabel:`Group selection`
fr: :guilabel:`Sélection du groupe`

source: Filter hosts based on their membership/ dependency to a group package
fr: Filtre de recherche sur les membres appartenant à ce paquet *group*

source: Do a search based on a WAPT package
fr: Effectuer une recherche à partir d'un paquet

source: In the :guilabel:`Private repository`, select the package and then click on :guilabel:`Show Hosts`.
fr: Dans :guilabel:`Dépôt privé` sélectionné le paquet qui vous intéresse puis cliquez sur :guilabel:`Show Host`.

source: The grid will display the hosts on which the package is installed. Note that the filter is only active on the :guilabel:`Package` attribute of the selected package.
fr: La grille affichera les postes où le paquet est installé. (Le filtrage est uniquement actif sur l'attribut :guilabel:`Package` du paquet sélectionné).

source: The different columns display information about the packages installed on the machine (e.g. *package version*, *package status*, *audit status*, *installation date*, *architecture*).
fr: Les différentes colonnes affichent les informations concernant le paquet installé sur la machine (ex : *version du paquet*, *status du paquet*, *status de l'audit*, *date d'installation*, *architecture*).

source: Filter by package
fr: Filtrage par paquet

source: You can also add the columns :guilabel:`Log install` and :guilabel:`Last Audit Output` to display at a glance the installation and audit logs.
fr: Vous pouvez également par exemple ajouter les colonnes :guilabel:`Log install` et :guilabel:`Last Audit Output` pour afficher d'un seul coup d'oeil les log d'installation et d'audit.

source: Creating a group package
fr: Créer un groupe de paquets

source: Group packages allows to create a package containing other packages to be affected as a dependency to a host.
fr: Les groupes de paquets permettent de créer des listes de paquets à affecter en dépendance à un ensemble de machines.

source: To create a group of packages, go to the :guilabel:`Bundles` tab:
fr: Pour créer un groupe de paquets, se rendre dans l'onglet :guilabel:`Groupes de paquets` :

source: Package group grid
fr: Grille des groupes de paquets

source: click on :guilabel:`New bundle`;
fr: cliquer sur :guilabel:`Nouveau groupe de paquets` ;

source: give a name to the *group* package;
fr: donner un nom au groupe ;

source: If you name a group package with the same name as an Active Directory security group (Microsoft or Samba-AD), member of the Active Directory group can be automatically affected to the WAPT group package.
fr: Si vous nommez un groupe avec le même nom qu'un groupe de machines dans votre annuaire Active Directory (Microsoft ou Samba-AD), alors les machines du groupe AD seront affectées au groupe WAPT.

source: fill in the description, add packages to the group package by dragging and dropping them or by Right-clicking on the package name, and adding to the bundle;
fr: renseigner la description, ajouter des paquets au groupe avec glisser-déposer ou avec un clique-droit sur le nom du paquet, ajouter au groupe ;

source: click on :guilabel:`Save` to save the bundle;
fr: cliquer sur :guilabel:`Enregistrer` pour enregistrer le groupe ;

source: To uninstall a package, it is possible to add banned packages to a bundle.
fr: Pour désinstaller un paquet, il est possible d'ajouter des paquets interdits au groupe.

source: Forbid a package
fr: Interdire un paquet

source: In the :guilabel:`Software Repository` tab, the list of packages currently available in the WAPT repository appears. By default, the console will only show the latest version of packages.
fr: Dans :guilabel:`Dépôt privé` apparaît la liste des paquets présents dans le dépôt WAPT local. Par défaut, la console n'affichera que les dernières versions pour chaque paquet.

source: To display all package versions, untick :guilabel:`Last version only`. To delete a package from the repository, :menuselection:`Right-click --> Remove from repository`.
fr: Pour afficher toutes les versions des paquets, décocher :guilabel:`Dernière version seulement`. Pour supprimer un paquet du dépôt, :menuselection:`Clic-droit --> Supprimer`.

source: To edit a package, :menuselection:`Right-click --> Edit package`, the package will be downloaded locally in **the base package development directory** set in console settings.
fr: Pour éditer un paquet, :menuselection:`Clic-droit --> Editer le paquet`, le paquet sera téléchargé dans le dossier défini avec le paramètre ``default_sources_root`` de la console.

source: Make changes to the package as wanted, rebuild the package and upload it back to the repository. Once your package has uploaded, refresh the package list using the :guilabel:`Refresh package list` button or by pressing :kbd:`F5` on your keyboard.
fr: Modifier le paquet comme désiré, reconstruire le paquet et le renvoyer sur le dépôt. Une fois le paquet uploadé, actualiser la liste des paquets à l'aide du bouton :guilabel:`Actualiser les paquets disponibles` ou de la touche :kbd:`F5` du clavier.

source: A search bar is also available to filter packages.
fr: Une barre de recherche est également disponible pour filtrer les paquets lorsqu'ils sont nombreux.

source: With the :guilabel:`section` drop-down menu, you can choose to create a profile package rather than a group package
fr: Avec le menu déroulant :guilabel:`section`, vous pouvez choisir de créer un paquet *profile* plutôt qu'un paquet *group*.

source: Cleaning the local cache from the WAPT console
fr: Nettoyer le cache de la console

source: When importing a package from Internet, the WAPT console downloads the package in :file:`%appdata%\local\waptconsole\cache` .
fr: Lors de l'import depuis Internet, la console télécharge le paquet dans :file:`%appdata%\..\local\waptconsole\cache`.

source: To clean the cache and free up disk space, click on :menuselection:`Tools --> Clean local cache`.
fr: Pour vider ce cache, depuis la console, cliquer sur :menuselection:`Outils --> Nettoyer le cache local`.

source: Cleaning up the local cache
fr: Nettoyer le cache local

source: Changing the password of the WAPT Server
fr: Changer le mot de passe du serveur WAPT

source: To change the WAPT Server password, click on :menuselection:`Tools --> Update password`, fill in the old password and a new one.
fr: Pour changer le mot de passe du serveur WAPT, aller sur :menuselection:`Outils --> Changer le mot de passe`, renseigner l'ancien mot de passe et saisir le nouveau.

source: Making changes to the WAPT console preferences
fr: Modifier la configuration WAPT locale de la console

source: To make changes to console settings, go to :menuselection:`Tools --> Preferences`.
fr: Pour modifier les paramètres d'affichage de la console : :menuselection:`Affichage --> Préférences d'affichage`.

source: Configuration options for the WAPT console
fr: Options de configuration de la console WAPT

source: :guilabel:`Basic` tab for basic options;
fr: onglet :guilabel:`Basique` des options de base ;

source: Arguments
fr: Paramètres

source: Example
fr: Exemple

source: WAPT Server IP address
fr: Adresse du serveur WAPT

source: URL of the WAPT Server
fr: URL de votre serveur WAPT

source: URL of the main WAPT repository
fr: URL du dépôt principal

source: URL of the main WAPT repository (only if :guilabel:`Specify manually` is checked)
fr: URL du dépôt principal (uniquement si spécifier manuellement est coché)

source: http://srvwapt.mydomain.lan/wapt/
fr: https://srvwapt.mydomain.lan/wapt/

source: URL of the WAPT Server (only if :guilabel:`Specify manually` is checked)
fr: URL du serveur WAPT (uniquement si spécifier manuellement est coché)

source: Verifying the HTTPS certificate
fr: Vérification du certificat https
