Repository: dGs-/WAPT-Documentation
Catalog: source/locale/*/LC_MESSAGES/wapt-usage/wapt-console-detail.po
Languages: fr

source: Indicates whether the HTTPS certificate must be verified
fr: Indique si le certificat https doit être verifié

source: Path to the bundle of certificates
fr: Chemin vers le bundle de certificats

source: Path to the bundle of certificates that will allow certificates to be verified
fr: Chemin vers le bundle de certificats qui permettera la vérification https

source: Visit :ref:`the documentation on activating HTTPS verification <activating_HTTPS_certificate_verification>`
fr: Voir :ref:`la documentation pour activer la vérification du certificat HTTPS <activating_HTTPS_certificate_verification>`.

source: Prefix to use when creating packages. Ex: *tis* or *demo*
fr: Préfixe pour la création de paquets WAPT

source: Prefix that is given to packages during replication.
fr: Préfixe donné aux paquets lors de la duplication.

source: Path to the Administrator's personal certificate
fr: Chemin du certificat personnel

source: Path to the certificate associated with the private key used to sign packages
fr: Chemin vers le certificat associée a la clé privé pour signer les paquets

source: The button :guilabel:`Get the server certificate` downloads the WAPT Server HTTPS certificate to :file:`WAPT\ssl\serveur` and tells the WAPT console to verify HTTPS connections using that bundle of certificates. The method is called **Certificate pinning**. Before downloding the HTTPS certificate, you must be sure that you are connecting with the right server.
fr: Le bouton :guilabel:`Récupération du certificat serveur` permet de télécharger le certificat HTTPS du serveur dans :file:`WAPT\ssl\serveur` et d'indiquer à la console de vérifier la connexion HTTPS avec ce bundle. Vous faites ainsi du certificat pinning. Vous devez en revanche être certain de communiquer avec le bon serveur quand vous cliquez sur le bouton.

source: :guilabel:`Advanced` tab for advanced options;
fr: onglet :guilabel:`Avancé` des options avancées ;

source: Path to waptdev folder
fr: Répertoire de base pour waptdev

source: Indicates the path to the directory for storing packages being developed
fr: Indique le répertoire pour le stockage des paquets en cours de développement

source: HTTP proxy to use
fr: Proxy http à utiliser

source: Indicates a proxy server to be used by the WAPT console when accessing the WAPT repository or the WAPT Server
fr: Indique un proxy a utiliser par l'agent wapt pour contacter le serveur

source: *http://srvproxy.mydomain.local:8080*
fr: http://srvproxy.mydomain.lan:8080

source: Activating the proxy
fr: Activation du proxy

source: Activate proxy settings for connecting to the WAPT repository or the WAPT Server
fr: Active le proxy pour le dépôt et / ou le serveur

source: Maximum number of hosts to be displayed in the console
fr: Nombre maximum de poste affiché

source: Indicates the maximum number of hosts to be displayed in the WAPT console, so to optimize the behavior of the console.
fr: Indique le nombre de poste maximum à afficher. (ce paramétrage permet d'optimiser la console)

source: Langage
fr: Language

source: Selects the langage for the WAPT console
fr: Défnit la langue pour la console wapt

source: Showing debug informations in the WAPT console
fr: Voir les informations de debug

source: Shows debug informations in the WAPT console
fr: Permet d'afficher les informations de debug dans la console (il n'est pas conseillé d'activer ce paramétrage)

source: Allow third-party tools in the contextual menus of the hosts
fr: Autoriser les outils externe dans les menus contextuels des hôtes

source: Activate administration functionalities
fr: Activer les fonctionalités d'administration

source: Hide unavailable options
fr: Cacher les actions non disponibles

source: Generating a new public certificate
fr: Générer un nouveau certificat public

source: Generating a new public certificate allows to actualize an existing public certificate without having to regenerate a public key/ certificate pair.
fr: La génération d'un nouveau certificat public permet d'actualiser le certificat public sans recréer de couple clé privée / certificat public.

source: For that purpose, go to :menuselection:`Tools --> Generate a new certificate`
fr: Pour cela cliquer sur :menuselection:`Outils --> Création de certificat`

source: Generate a self-signed certificate
fr: Générer un certificat auto-signé

source: The private key is recovered from current settings, change the **Common Name** and regenerate a new certificate.
fr: La clé privée est récupérée depuis la configuration existante, changer le ``Common Name`` puis générer le nouveau certificat.

source: The old certificate will be invalidated.
fr: L'ancien certificat sera écrasé.

source: New public certificate has been created
fr: Génération du certificat public confirmé

source: Adding plugins in the Console
fr: Ajouter des plugins dans la console

source: To add plugins, go to :menuselection:`Tools --> preference --> plugins Tab`.
fr: Pour cela cliquer sur :menuselection:`Outils --> Préférences --> Plugins`.

source: Click :guilabel:`Add` to add plugins, then edit the corresponding columns
fr: Cliquer sur :guilabel:`Ajouter` pour ajouter des plugins, puis éditer les colonnes correspondantes

source: Column
fr: Colonne

source: Name
fr: Nom

source: Name that will appear in the menu
fr: Nom qui apparaîtra dans le menu

source: Executable
fr: Exécutable

source: Path of the executable that will be executed after the click
fr: Chemin vers l'exécutable qui sera exécuté après le clic

source: Arguments passed to the executable. Some variables can be used like {ip}, {uuid} or {computer_fqdn}
fr: Arguments passés à l'exécutable. Des variables peuvent être employées telles {ip}, {uuid} or {computer_fqdn}

source: Plugins will then appear in the menu :
fr: Les plugins apparaîtront alors dans le menu :
