Repository: dGs-/WAPT-Documentation
Catalog: source/locale/*/LC_MESSAGES/wapt-usage/wapttray.po
Languages: fr

source: Using WAPTtray.
fr: Utiliser le WAPTtray

source: :program:`wapttray` is a utility working in user context, it is located in the WAPT folder :file:`C:\Program Files (x86)\wapt`.
fr: Le WAPTtray est utilisable en compte utilisateur, il est situé dans le dossier :file:`C:\Program Files (x86)\wapt\wapttray.exe`.

source: :program:`wapttray` launches at logon if the option has been ticked during installation. The icon will show up in the Windows tray toolbar.
fr: Le WAPTtray s'ouvre au démarrage de la session si l'option a été cochée lors de l'installation. Il se place dans la barre des tâches lors de l'ouverture de session.

source: We can also launch :program:`wapttray` manually with a startup GPO pointing on :file:`C:\Program Files (x86)\wapt\wapttray.exe`.
fr: On peut aussi lancer le WAPTtray avec une GPO de démarrage exécutant :file:`C:\\Program Files (x86)\wapt\wapttray.exe`.

source: The tray icon is handy for autonomous users that want to choose the right moment to upgrade their packages.
fr: L'icône est pratique pour les utilisateurs qui souhaitent choisir le bon moment pour la mises à jour de leur poste.

source: WAPTtray in Windows notification tray
fr: WAPTtray dans la barre des tâches

source: Functionalities of the WAPTtray
fr: Fonctionnalités de WAPTtray

source: List of functionalities of the WAPTtray
fr: Liste des fonctionnalités de WAPTtray

source: Action
fr: Fonction

source: Showing the status of packages
fr: Afficher le statut des logiciels

source: launches the local web interface in a browser
fr: lance l'interface web locale dans un navigateur

source: Launching the installation of a update
fr: Lancer l'installation d'une mise à jour

source: launches the installation of pending upgrades
fr: lance l'installation des paquets lorsque des mises à jours sont disponibles.

source: Refreshing the list of available
fr: Actualiser la liste des paquets disponibles

source: refreshes the list of available packages. Double-clicking on the tray icon brings about the same effect.
fr: rafraîchit la liste des paquets disponibles. Un double-clic sur l'icône produit le même effet.

source: Launching the WAPT console
fr: Lancer la console

source: launches the WAPT console
fr: lance la console d'administration WAPT.

source: Viewing the configuration file
fr: Afficher le fichier de configuration

source: opens the :file:`C:\Program Files (x86)\wapt\wapt-get.ini` file with :term:`Local Administrator` privileges (credentials may be asked)
fr: lance l'édition du fichier :file:`C:\Program Files (x86)\wapt\wapt-get.ini` en mode :term:`Administrateur`.

source: Reloading network related service configuration
fr: Recharger la configuration réseau du service

source: reloads the connection to the WAPT Server in the event of a network reconfiguration
fr: recharge la connexion au serveur WAPT en cas de reconfiguration du réseau

source: Uploading the host's inventory to the WAPT Server
fr: Forcer la remontée d'inventaire vers le serveur

source: updates the host's inventory with the WAPT Server
fr: force la remontée d'information d'inventaire au serveur

source: Configuring all installed packages for the User
fr: Configurer tous les paquets installés pour l'Utilisateur

source: launches a :command:`session-setup` to configure user environment for all packages installed on the host
fr: lance un :command:`session-setup` pour configurer l'environnement Utilisateur pour tous les paquets installés sur la machine.

source: Canceling WAPT tasks running on the host
fr: Annuler les tâches WAPT en cours d'exécution sur la machine

source: shows running tasks, allows to cancel a running task, allows to cancel all running tasks
fr: affiche les tâches en cours d'exécution, permet d'annuler une tâche en cours d'exécution, permet d'annuler toutes les tâches en cours d'exécution

source: Stopping and starting the WAPT service
fr: Arrêter et relancer le service service WAPT

source: stops and reloads the *WAPTservice*
fr: arrête et lance le service ``WAPTService``

source: Exiting the WAPTtray
fr: Quitter WAPTtray

source: closes the tray :guilabel:`icon` without stopping the local *WAPTservice*
fr: ferme l':guilabel:`icône WAPTtray` sans couper le service WAPT local
