Repository: dGs-/WAPT-Documentation
Catalog: source/locale/*/LC_MESSAGES/wapt-contribute/rebuild-wapt.po
Languages: fr

source: Recompiling WAPT from source
fr: Recompiler WAPT à partir des sources

source: Python, WAPT, virtualenv, CodeTyphon, Lazarus, InnoSetup, documentation
fr: Python, WAPT, virtualenv, CodeTyphon, Lazarus, InnoSetup

source: WAPT components
fr: Composants de WAPT

source: Python environment
fr: Environment Python

source: Creating a development environment with virtualenv:
fr: Création d'un environment de développement avec virtualenv :

source: With a clean Windows installed:
fr: Pour une installation propre de zéro sur Windows :

source: install python2.7.12 from https://www.python.org/ftp/python/2.7.12/python-2.7.12.msi;
fr: installer python2.7.12 depuis https://www.python.org/ftp/python/2.7.12/python-2.7.12.msi ;

source: upgrade :program:`python-setuptools`:
fr: mettre à jour :program:`python-setuptools` :

source: create a development environment with ``virtualenv``;
fr: créer l'environment de développement ``virtualenv`` ;

source: Build environment on Debian Linux
fr: Environment de build sur Linux Debian

source: Lazarus environment
fr: Environment Lazarus

source: WAPT relies on the following third-party freepascal/ lazarus librairies:
fr: WAPT utilise les bibliothèques tierces freepascal / lazarus suivantes :

source: virtualtrees: http://www.pilotlogic.com/sitejoom/index.php/85-wiki/codetyphon-studio/ct-packages/301-pl-virtualtrees and https://svn.code.sf.net/p/lazarus-ccr/svn/components/virtualtreeview-new/trunk/;
fr: virtualtrees : https://www.pilotlogic.com/sitejoom/index.php/85-wiki/codetyphon-studio/ct-packages/301-pl-virtualtrees https://svn.code.sf.net/p/lazarus-ccr/svn/components/virtualtreeview-new/trunk/ ;

source: JCL: http://wiki.delphi-jedi.org/wiki/JCL_Installation;
fr: JCL : https://wiki.delphi-jedi.org/wiki/JCL_Installation ;

source: Tranquil IT packages
fr: Packages TIS

source: pltis_utils: https://github.com/tranquilit/pltis_utils: subset of libraries from JEDI JCL project adapted to lazarus;
fr: pltis_utils : https://github.com/tranquilit/pltis_utils : sous-ensemble de librairies du projet JEDI JCL adapté à lazarus ;

source: Building WAPT
fr: Construire WAPT

source: Installing the WAPT development environment
fr: Créer un environment de développement avec virtualenv

source: on a clean Windows 7 install
fr: Pour une installation propre de zéro sur Windows

source: install the WAPT agent from https://srvwapt.ad.tranquil.it/wapt/waptagent.exe
fr: installer l'agent WAPT à partir de https://srvwapt.ad.tranquil.it/wapt/waptagent.exe

source: deactivate UAC
fr: Désactiver les UAC

source: as a :term:`Local Administrator`
fr: en tant qu'un :term:`Administrateur Local`

source: show hidden files and file extensions
fr: afficher les fichiers cachés et les extensions de fichiers

source: increase the width of the CMD windows and flip to quick edit mode
fr: augmenter la largeur des fenêtres du CMD et passer en mode édition rapide

source: copy the code signing certificate into :file:`C:\\users\\buildbot\\Documents`
fr: copier le certificat de signature de code dans le fichier :file:`C:\\Users\\buildbot\\Documents`

source: Installing Lazarus
fr: Installer Lazarus

source: Installing the server environment on Windows
fr: Installer l'environnement serveur sur Windows

source: Create the InnoSetup installers
fr: Créer les installeurs InnoSetup

source: install Innosetup from http://www.jrsoftware.org/download.php/ispack-unicode.exe
fr: installer Innosetup : https://www.jrsoftware.org/download.php/ispack-unicode.exe

source: The :file:`.iss` files are located in :file:`C:\\tranquilit\\wapt\\waptsetup` ;
fr: Les fichiers :file:`.iss` se situent dans :file:`C:\ ranquilit\\wapt\\waptsetup` ;

source: The :program:`waptsetup` installer includes the python libraries, the command line tool :program:`wapt-get`, the local webservice :program:`waptservice`, the packaging tool and the WAPT console :program:`waptconsole`.
fr: L'installeur :program:`waptsetup` (:file:`C:\tranquilit\WAPT\waptsetup\ waptsetup.iss`) inclut les bibliothèques python, l'outil en ligne de commande :program:`wapt-get`, le webservice local :program:`waptservice`, les outils de packaging et la console WAPT :program:`waptconsole`.

source: The file :file:`waptserver.iss` allows to build an installer that includes a Nginx web server in front and the Flask webservice :program:`waptserver.py`.
fr: Le programme :program:`waptserver` (:file:`C:\tranquilit\WAPT\waptsetup\ waptserver.iss`) permet de construire un installeur qui inclut un serveur Nginx en frontal pour le webservice Flask :program:`waptserver.py`.

source: The :file:`waptstarter` installer only includes the local webservice and the command line tool :program:`wapt-get`. It does not include the WAPT console :program:`waptconsole`, nor the packaging tools.
fr: L'installeur waptstarter (:file:`C:\tranquilit\WAPT\waptsetup\waptstarter.iss`) n'inclut que le code pour le webservice local et l'outil en ligne de commande :program:`wapt-get`, mais pas la console WAPT :program:`waptconsole`, ni les outils de packaging.

source: :menuselection:`Right-click on the .iss file --> Compile ` will compile an installer with :program:`InnoSetup`.
fr: :menuselection:`Clic-droit sur le fichier iss --> Compiler` crée un installeur avec :program:`InnoSetup`.

source: or using the command line:
fr: ou en ligne de commande :

source: The installer's global parameters are defined with #define in the file header.
fr: Les paramètres généraux des installeurs sont définis par des #define en tête de fichier.

source: If you do not sign the installers, you may comment the lines :code:`#define signtool ..`.
fr: Si vous ne signez pas les installeurs, vous pouvez commenter les lignes :code:`#define signtool ..`.
