Repository: dGs-/WAPT-Documentation
Catalog: source/locale/*/LC_MESSAGES/wapt-usage/command-line-interface/command-line-interface-create-packages.po
Languages: fr

source: Using the Command Line to create WAPT packages
fr: Utiliser la ligne de commande pour créer des paquets WAPT

source: command line, WAPT, CLI, create packages, make-template, make-host-template, make-group-template, list-registry, sources, build-package, sign-package, build-upload, duplicate, edit, upload-package, update-packages, documentation
fr: ligne de commande, WAPT, CLI, command line, invite de commande Windows, créer des paquets, make-template, make-host-template, make-group-template, list-registry, sources, build-package, sign-package, build-upload, duplicate, edit, upload-package, update-packages, documentation

source: The :command:`wapt-get make-template <msi or exe file> <package name>` command allows to create a package template from a MSI or an EXE installer.
fr: La commande :code:`wapt-get make-template <msi or exe file> <package name>` permet de générer un modèle de paquet logiciel à partir d'un installeur exécutable au format MSI ou EXE.

source: You will find the complete procedure for :ref:`creating WAPT packages <creating_WAPT_packages>`.
fr: Vous trouverez ici la procédure complète pour :ref:`créer des paquets WAPT <creating_WAPT_packages>`.

source: If you have previously installed *tis-waptdev* package on your development computer, :program:`PyScripter` editor will launch automatically and open the package in development mode.
fr: Si vous avez au préalable installé le paquet ``tis-waptdev`` sur votre machine de développement, l'éditeur :program:`PyScripter` se lancera automatiquement en ouvrant le projet de création de paquet.

source: The :command:`wapt-get make-host-template <host FQDN>` command creates an empty WAPT host package from a template.
fr: La commande :code:`wapt-get make-host-template <host FQDN>` permet de générer un modèle de paquet machine vide.

source: The command :code:`wapt-get make-host-template host01.mydomain.lan` returns:
fr: La commande :code:`wapt-get make-host-template host01.mydomain.lan` renvoie :

source: The :command:`wapt-get make-group-template <name of group>` command creates an empty WAPT group package from a template.
fr: La commande :code:`wapt-get make-group-template <name of group>` permet de générer un modèle de paquet groupe vide.

source: The command :code:`wapt-get make-group-template accounting` returns:
fr: La commande :code:`wapt-get make-group-template accounting` renvoie :

source: The :command:`wapt-get list-registry <keyword>` command lookups a keyword in software installed by WAPT on the computer.
fr: La commande :code:`wapt-get list-registry <keyword>` permet de rechercher un mot clé parmi les logiciels installés sur la machine.

source: The output of :command:`list-registry` is a table listing *uninstall keys* for each software corresponding to the search term.
fr: Cette commande affiche un tableau contenant la clé de désinstallation de chaque logiciel correspondant au critère de recherche.

source: The command :code:`wapt-get list-registry firefox` returns:
fr: La commande :code:`wapt-get list-registry firefox` renvoie :

source: The :command:`wapt-get sources <package name>` command downloads sources from a source code management platform like Git or SVN.
fr: La commande :code:`wapt-get sources <package name>` permet de télécharger les sources depuis un dépôt versionné type Git / SVN.

source: The command :code:`wapt-get sources tis-firefox` returns nothing;
fr: La commande :code:`wapt-get sources tis-firefox` ne renvoie rien ;

source: The :command:`wapt-get build-package <path to the package>` command builds a WAPT package and signs it with the private key of the :term:`Administrator`.
fr: La commande :code:`wapt-get build-package <path to the package>` permet de construire le paquet WAPT et le signer avec la clé privée de l':term:`Administrateur`.

source: The path to the private key, the default prefix and the default development path must be properly set in the :file:`wapt-get.ini` file.
fr: Il convient de s'assurer que le chemin de la clé privée, le préfixe et le chemin de développement par défaut sont renseignés.

source: The command :code:`wapt-get sources tis-firefox` returns: :
fr: La commande :code:`wapt-get build-package C:\waptdev\tis-tightvnc-wapt` renvoie :

source: The :command:`wapt-get sign-package <path to the package>` command signs a package with the private key of the :term:`Administrator`.
fr: La commande :code:`wapt-get sign-package <path to the package>` permet de signer un paquet téléchargé manuellement avec la clé privée de l':term:`Administrateur` en ligne de commande.

source: :command:`sign-package` does not rename the WAPT package with the chosen prefix of the :term:`Organization`.
fr: La commande :command:`sign-package` ne renomme pas le paquet avec le préfixe de l':term:`Organisation`.

source: The :command:`wapt-get build-upload <path to the package>` command builds and uploads a WAPT package onto the main WAPT repository.
fr: La commande :code:`wapt-get build-upload <chemin du paquet>` permet de construire et d'uploader le paquet résultant sur le dépôt WAPT local.

source: By passing the *-i* argument to :command:`build-upload`, the WAPT packaging version number is incremented before upload, so to avoid having to modify manually the :file:`control` file.
fr: Avec le paramètres *-i* on incrémente directement la version du paquet WAPT sans avoir à modifier le fichier :file:`control`.

source: The :command:`wapt-get duplicate <package source> <package new_duplicate>` command duplicates a package downloaded from the repository and opens it as a :program:`PyScripter` project.
fr: La commande :code:`wapt-get duplicate <package source> <package new_duplicate>` permet de dupliquer localement un paquet WAPT du dépôt.

source: The command :code:`wapt-get duplicate tis-firefox tis-firefox-custom` returns:
fr: La commande :code:`wapt-get duplicate tis-firefox tis-firefox-custom` renvoie :

source: The :command:`wapt-get edit <package name>` command downloads and edits a WAPT package.
fr: La commande :code:`wapt-get edit <package name>` permet d'éditer un paquet.

source: The command :code:`wapt-get edit tis-firefox` returns:
fr: La commande :code:`wapt-get edit tis-firefox` renvoie :

source: The :command:`wapt-get edit-host <host FQDN>` command edits a WAPT *host* package.
fr: La commande :code:`wapt-get edit-host <host FQDN>` permet d'éditer un paquet *host* depuis le dépôt WAPT.

source: The :command:`wapt-get upload-package <path to the package>` command uploads a package onto the main WAPT repository.
fr: La commande :code:`wapt-get upload-package <path to the package>` permet de charger un paquet sur le dépôt WAPT.

source: The :command:`wapt-get update-packages <path to folder>` command scans a local repository and creates the :file:`Packages` index file.
fr: La commande :code:`wapt-get update-packages <path to folder>` permet de scanner un dossier local et de créer un fichier d'index :file:`Packages`.
