Repository: dGs-/WAPT-Documentation
Catalog: source/locale/*/LC_MESSAGES/waptserver-install/debian/install-debian-wapt.po
Languages: fr

source: Installing the WAPT Server on Debian Linux
fr: Installation du Serveur WAPT sur Linux Debian

source: Server, WAPT, Debian, install, installation, documentation
fr: Server, WAPT, Debian, Install, documentation

source: The upgrade procedure is different from installation. For upgrade, please refer to :ref:`Upgrading the WAPT Server <upgrade-wapt>`.
fr: La procédure est différente pour la mise à jour du serveur WAPT. Pour une mise à jour, rendez-vous sur : :ref:`upgrade-wapt`.

source: Installing the WAPT Server requires a few steps:
fr: L'installation de la partie serveur de WAPT se décompose en plusieurs étapes :

source: configuring the repositories;
fr: configurer les dépôts ;

source: installing additional Linux packages;
fr: installer les paquets complémentaires ;

source: installing and provisioning the PostgreSQL database;
fr: installer et initialiser la base de données PostgreSQL ;

source: post-configuring the WAPT Server;
fr: post-configurer le serveur ;

source: The WAPT Server packages and repository are signed by Tranquil IT and it is necessary to get the gpg public key below in order to avoid warning messages during installation.
fr: Les paquets tis-waptserver, tis-waptsetup sont signés et il est nécessaire de récupérer la clef gpg ci-dessous pour éviter les messages de warning lors de l'installation.

source: Configuring DEB repositories and installing WAPT and PostgreSQL packages
fr: Configurer les dépôts et installer les paquets WAPT et PostgreSQL

source: The configuration of repositories for **WAPT Enterprise** and **WAPT Community** Edition differs. **Make sure to choose the right one!**
fr: La configuration des dépôts en **WAPT Enterprise** et en **WAPT Community** diffère. **Assurez-vous de choisir la bonne procédure !**

source: During installation, you may be asked for the Kerberos realm. Just press :kbd:`Enter` to skip this step.
fr: L'installation peut vous demander le royaume kerberos. Appuyez sur :kbd:`Entrée` pour passer l'étape.

source: **Below is the configuration for WAPT Community** Edition. For WAPT Enterprise Edition please see above.
fr: **Ci-dessous se trouve la configuration pour l'édition WAPT Community**. Pour l'édition WAPT Enterprise, voir ci-dessus.

source: To access WAPT Enterprise ressources, you must use the username and password provided by our sales department.
fr: Pour accéder au site de téléchargement WAPT Enterprise, vous devez utiliser le nom d'utilisateur et le mot de passe fournis par notre service commercial.

source: Replace **user** and **password** in the **deb** parameter to access WAPT Enterprise repository.
fr: Remplacez **user** et **password** dans le paramètre **deb** pour accéder au dépôt WAPT Enterprise.

source: Below is the configuration for **WAPT Community** Edition. For WAPT Enterprise Edition please see above.
fr: **Ci-dessous se trouve la configuration pour l'édition WAPT Community**. Pour l'édition WAPT Enterprise, voir ci-dessus.

source: Installing the WAPT Server packages
fr: Installer des paquets complémentaires

source: Post-configuring
fr: Post-Configuration

source: For post-configuration to work properly, you must first have properly configured the *hostname* of the WAPT server. To check *hostname* configuration use the command :code:`echo $(hostname)` which must return the *hostname* that will be used by WAPT agents on client computers.
fr: La Post-Configuration suppose que vous avez correctement configuré le *hostname* de l'ordinateur. Pour vérifier, :code:`echo $(hostname)` doit renvoyer l'adresse DNS qu'utiliseront les agents WAPT.

source: This post-configuration script must be run as **root**.
fr: Ce script de post-configuration doit être exécuté en tant qu'utilisateur **root**.

source: run the script:
fr: lancer le script :

source: click on :guilabel:`Yes` to run the postconf script:
fr: cliquer sur :guilabel:`Yes` pour accepter le lancement du postconf :

source: enter the password for the :term:`SuperAdmin` account of the WAPT Server (minimum 10 caracters);
fr: entrer un mot de passe pour le compte :term:`SuperAdmin` du serveur WAPT (10 caractères minimum) :

source: confirm the password;
fr: confirmer le mot de passe :

source: choose the authentication mode for the initial registering of the WAPT agents;
fr: choisir le mode d'authentification pour l'enregistrement des machines :

source: choice #1 allows to register computers without authentication (same method as WAPT 1.3). The WAPT server registers all computers that ask;
fr: Le choix 1 permet un enregistrement sans authentification (Comme en version 1.3). Le serveur ne vérifie pas le poste qui s'enregistre ;

source: Choice #2 activates the initial registration based on Kerberos. (you can activate it later)
fr: Le choix n°2 active l'enregistrement initial basé sur Kerberos. (vous pourrez l'activer aussi plus tard) ;

source: choice #3 does not activate the Kerberos authentication mechanism for the initial registering of machines equipped with WAPT. The WAPT server will require a login and password for each machine registering with it;
fr: le choix #3 n'active pas l'authentification kerberos pour l'enregistrement des machines mais demande une authentification wapt pour l'enregistrement des machines. The serveur WAPT réclamera le mot de passe du *SuperAdmin* à chaque nouvel enregistrement ;

source: select :guilabel:`OK` to start WAPT Server;
fr: sélectionner :guilabel:`OK` pour démarrer le serveur WAPT ;

source: select :guilabel:`Yes` to configure Nginx;
fr: sélectionner :guilabel:`Yes` pour configurer Nginx ;

source: enter the :term:`FQDN` of the WAPT Server;
fr: entrer le nom :term:`FQDN` du serveur WAPT ;

source: select :guilabel:`OK` and a self-signed certificate will be generated, this step may take a long time ...
fr: faites :guilabel:`OK` et un certificat autosigné est généré, cette étape peu être longue ...

source: Nginx is now configured, select :guilabel:`OK` to restart :program:`Nginx`:
fr: Nginx est maintenant configuré, sélectionner :guilabel:`OK` pour redémarrer :program:`Nginx` :

source: The post-configuration is now finished.
fr: La post-configuration est maintenant terminée.

source: Listing of post-configuration script options:
fr: Détail des arguments possibles du script de post-configuration :

source: Definition
fr: Définition

source: Configures :program:`Nginx` so that *port 80 is permanently redirected to 443*
fr: Configure :program:`Nginx` de sorte que *port 80 soit redirigé en permanence vers 443*.

source: The WAPT Server is now ready.
fr: Le serveur WAPT est prêt.

source: You may go to the documentation on :ref:`installing the WAPT console <installing_the_WAPT_console>`!!
fr: Passez maintenant à l'étape suivante pour :ref:`installer la console WAPT <installing_the_WAPT_console>`.
