Repository: dGs-/WAPT-Documentation
Catalog: source/locale/*/LC_MESSAGES/waptserver-install/debian/install-debian-*.po
Languages: fr

source: Setting up the GNU/Linux Debian server
fr: Préparer le serveur Debian

source: In order to install a fresh Debian Linux 9 *Stretch* (physical or virtual) without graphical interface, please refer to the `Debian GNU/Linux Installation Guide <https://www.debian.org/releases/stretch/amd64/>`_.
fr: Pour installer une Linux Debian 9 *Stretch* neuve (machine physique ou virtuelle) sans interface graphique, référez vous à la documentation officielle : `Debian GNU/Linux Installation Guide <https://www.debian.org/releases/stretch/amd64/>`_.

source: Configuring network parameters
fr: Configurer les paramètres réseau

source: The different parameters presented below are not specific to WAPT; you may adapt them as required for your environment.
fr: Les différents paramétrages préconisés ci-dessous ne sont pas spécifiques à WAPT ; vous devrez les adapter à votre environnement.

source: Modify the following files in order to get a proper naming (:term:`FQDN`) and network addressing strategy.
fr: Modifier les fichiers suivant afin d'obtenir une configuration de nommage (:term:`FQDN`) et réseau correcte (adressage IP fixe).

source: In the following example:
fr: Dans l'exemple suivant :

source: the :term:`FQDN` name is *srvwapt.mydomain.lan*;
fr: le nom :term:`FQDN` est : *srvwapt.mydomain.lan* ;

source: the short-name of the WAPT Server is *srvwapt*;
fr: le nom du serveur WAPT est *srvwapt* ;

source: the :term:`DNS` suffix is *mydomain.lan*;
fr: le suffixe :term:`DNS` est *mydomain.lan* ;

source: the IP address is *10.0.0.10/24*;
fr: l'adresse IP est *10.0.0.10/24* ;

source: Configuring the name of WAPT Server
fr: Configurer le nom du serveur

source: The short name of the WAPT Server must not be longer than 15 characters (the limit is due to sAMAccountName restriction in Active Directory).
fr: Le nom du serveur WAPT ne doit pas dépasser 15 caractères (limite liée au sAMAccountName dans Active Directory).

source: The name of the WAPT Server must be a :abbr:`FQDN (Fully Qualified Domain Name)`, that is to say it has both the server name and the DNS suffix.
fr: Le nom du serveur doit être un nom :abbr:`FQDN (Fully Qualified Domain Name)`, c'est à dire à la fois le nom de machine et le suffixe DNS.

source: modify the :file:`/etc/hostname` file and write the :term:`FQDN` of the server;
fr: modifier le fichier :file:`/etc/hostname` et y renseigner le nom :term:`FQDN` du serveur :

source: configure the :file:`/etc/hosts` file, be sure to put both the :term:`FQDN` and the short name of the server;
fr: dans :file:`/etc/hosts`, renseigner le nom :term:`FQDN` et le nom court du serveur :

source: on the line defining the DNS server IP address, be sure to have the IP of the server (not 127.0.0.1), then the :term:`FQDN`, then the short name;
fr: sur la ligne correspondant à l'adresse IP du serveur WAPT mettre d'abord le nom :term:`FQDN`, puis le nom court ;

source: do not change the line with :file:`localhost`;
fr: ne pas modifier les lignes contenant le terme ``localhost`` ;

source: Configuring the IP address of the WAPT Server
fr: Configurer l'adresse IP du serveur WAPT

source: configure the IP address of the WAPT Server in the :file:`/etc/network/interfaces`;
fr: configurer les paramètres réseau du serveur WAPT dans le fichier :file:`/etc/network/interfaces` ;

source: apply the network configuration by rebooting the machine with a :code:`reboot`;
fr: appliquer la configuration réseau en redémarrant la machine avec un :code:`reboot` ;

source: if it has not already be done, create the DNS entry for the WAPT Server in the :term:`Organization`'s Active Directory;
fr: si ce n'est pas déjà fait, créer l'entrée DNS du serveur dans l'Active Directory de l':term:`Organisation` ;

source: after reboot, configure the system language in English in order to have non-localized logs for easier searching of common errors;
fr: après le redémarrage, configurer la langue du système en anglais afin de faciliter la recherche de problèmes dans les logs ;

source: check that the machine clock is on time (with NTP installed);
fr: vérifier que la machine est à l'heure (avec NTP installé) ;

source: If the NTP package is not installed.
fr: Si le paquet NTP n'est pas installé.

source: update and upgrade your Debian;
fr: mettre à jour Debian ;

source: install systemd;
fr: installer systemd ;

source: install certificates;
fr: installer les certificats :

source: restart server;
fr: redémarrer la machine :

source: You may no go on to the next step and :ref:`install WAPT on your Debian <install_wapt_debian>`.
fr: Vous pouvez maintenant passer à l'étape suivante et :ref:`installer WAPT sur votre Debian <install_wapt_debian>`.
