Repository: dGs-/WAPT-Documentation
Catalog: source/locale/*/LC_MESSAGES/waptserver-install/debian/install-debian-kerberos.po
Languages: fr

source: Configuring Kerberos authentication on CentOS/ RedHat
fr: Configurer l'authentification Kerberos avec Debian ou CentOS / RedHat

source: Kerberos, authentication, Debian, WAPT, documentation, RedHat, CentOS
fr: Kerberos, authentification, Debian, documentation, CentOS

source: Configuring Kerberos authentication
fr: Configurer l'authentification Kerberos

source: this configuration is required when using WAPT **Enterprise** version;
fr: cette configuration est obligatoire en version WAPT **Enterprise** ;

source: indeed without Kerberos authentication, you have to either trust initial registration or enter a password for each workstation on initial registration;
fr: en effet sans authentification Kerberos, n'importe qui pourra s'enregistrer sur le serveur WAPT et remonter de fausses informations dans l'inventaire ;

source: for more information, visit the documentation on :ref:`registering a machine with the WAPT Server <initial_machine_registration>` and :ref:`signing inventory updates <signing_inventory_updates>`;
fr: pour plus d'information rendez-vous sur :ref:`Enregistrer une machine avec le serveur WAPT <initial_machine_registration>` et sur :ref:`Signer les remontées d'inventaire <signing_inventory_updates>` ;

source: the kerberos authentication will be used only when registering the device;
fr: l'authentification Kerberos sera utilisée lors de l'enregistrement du poste uniquement ;

source: Installing the Kerberos components
fr: Installation des composants Kerberos

source: Configuring krb5
fr: Configuration de krb5

source: Modify the :file:`/etc/krb5.conf` file and **replace all the content with the following 4 lines** replacing **MYDOMAIN.LAN** with your Active Directory domain name (i.e. *<MYDOMAIN.LAN>*).
fr: Modifier le fichier :file:`/etc/krb5.conf` et **remplacer tout son contenu par les 4 lignes suivantes** en précisant le domaine Active Directory de votre organisation (ici *<MYDOMAIN.LAN>*).

source: ``default_realm`` must be written with **ALL CAPS**!!
fr: Le ``default_realm`` doit absolument être écrit en **lettres MAJUSCULES** !!

source: Retrieving a service keytab
fr: Récupérer un ticket Kerberos

source: Use the :`command:`kinit` and :command:`klist`. You can use an :term:`Administrator` account or any other account with the delegated right to join a computer to the domain in the proper destination container (by default *CN=Computers*).
fr: Utiliser la commande :command:`kinit` et :command:`klist` ci-dessous, vous pouvez utiliser le compte :term:`Administrateur Local` ou tout autre compte avec délégation de privilèges sur le conteneur de destination dans Active Directory (par défaut *CN=Computers*).

source: In the shell transcript below, commands are in black and returned text is commented in light gray:
fr: En commentaire les résultats attendus des commandes :

source: If the authentication request is successful, you can then create your HTTP Keytab with the :program:`msktutil` command.
fr: Si la demande d'authentification aboutit, créer le compte machine ainsi que le Keytab http avec :program:`msktutil`.

source: Be sure to modify the *<DOMAIN_CONTROLER>* string with the name of your domain controller (eg: **srvads.mydomain.lan**).
fr: Modifier le paramètre *<DOMAIN_CONTROLER>* en fonction de votre contrôleur de domaine (ex: **srvads.mydomain.lan**).

source: Be sure to have properly configured your WAPT Server *hostname* before running these commands;
fr: Les commandes ci-dessus supposent que vous avez correctement configuré le *hostname* de l'ordinateur ;

source: In order to double check your *hostname*, you can run :code:`echo $(hostname)` and it must return the name that will be used by WAPT agent running on client workstations.
fr: Pour vérfier, la ligne de commande :file:`echo $(hostname)` doit renvoyer l'adresse DNS qu'utiliseront les agents WAPT.

source: Finally, change the ownership rights on the keytab file.
fr: Enfin modifier le propriétaire du keytab et ses permissions.

source: Post-configuring
fr: Post-Configuration

source: You can now use post-configuration script to configure the WAPT Server to use Kerberos.
fr: Il est maintenant nécessaire de relancer la post-configuration afin d'activer l'authentification Kerberos pour l'enregistrement des machines.

source: The post-configuration script will configure :program:`Nginx` and the WAPT Server to use Kerberos authentication.
fr: Le script de post-configuration va mettre à jour la configuration :program:`Nginx` et WAPTServer pour utiliser l'authentification Kerberos.

source: This post-configuration script must be run as **root**.
fr: Ce script de post-configuration doit être exécuté en tant qu'utilisateur **root**.

source: Kerberos authentication is now configured.
fr: L'authentification Kerberos est maintenant correctement configurée.

source: The post-configuration script generates a self-signed certificate. If you prefer, you may replace it with a :ref:`commercial certificate or a certificate issued by a Trusted internal Authority of Certification <install_ssl_certificate>`.
fr: Le script de post-configuration génère un certificat autosigné. Si vous le souhaitez, vous pouvez le remplacer par un certificat commercial ou issue d'une CA interne en suivant la documentation pour :ref:`installer un certificat <install_ssl_certificate>`.

source: Otherwise, go on directly to the next step to :ref:`installing the WAPT console <installing_the_WAPT_console>`.
fr: Sinon, passer directement à l'étape suivante pour :ref:`installer la console WAPT sur votre PC d'Administrateur <installing_the_WAPT_console>`.
