Repository: dGs-/WAPT-Documentation
Catalog: source/locale/*/LC_MESSAGES/wapt-create-packages/package-additional/setuphelpers-useful.po
Languages: fr

source: Simple examples of commonly used functions
fr: Exemples simples de fonctions couramment utilisées

source: Tests, WAPT, user context, file and directory manipulation, examples, registry key, SetupHelpers, documentation
fr: Tests, WAPT, contexte utilisateur, manipulation de dossiers et fichiers, exemple, clé de registre, Setuphelpers, documentation

source: Presentation of several functions implemented in :term:`Setuphelpers` and frequently used to develop WAPT packages.
fr: Nous présentons ici quelques fonctions implémentées dans :term:`Setuphelpers` et fréquemment utilisées pour développer des paquets WAPT.

source: Testing and manipulating folders and files
fr: Tests et manipulation de dossiers et fichiers

source: Creating a path recursively
fr: Créer un chemin avec récursion

source: Command :command:`makepath` ...
fr: La commande :command:`makepath` ...

source: ... makes the path variable for :file:`C:\\Program Files (x86)\\Mozilla\\Firefox`.
fr: ... fabrique la variable pour le chemin :file:`C:\\Program Files (x86)\\Mozilla\\Firefox`.

source: For more informations or to learn more on arguments on that function, please visit official Setuphelpers reference documentation:
fr: Pour plus d'informations ou pour connaître les paramètres complémentaires de la commande, consultez la documentation de référence (en anglais) en visitant :

source: Creating and destroying directories
fr: Créer et détruire des répertoires

source: Command :command:`mkdirs` ...
fr: La commande :command:`mkdirs` ...

source: Commande :command:`remove_tree` ...
fr: La commande :command:`remove_tree` ...

source: https://www.wapt.fr/en/api-doc-1.5/source/setuphelpers.html?highlight=remove_tree#setuphelpers.remove_treee
fr: Pour plus d'informations ou pour connaître les paramètres complémentaires de la commande, consultez la documentation de référence (en anglais) en visitant :

source: Checking if a path is a file or a folder
fr: Tester si des éléments de l'arborescence sont des fichiers ou des répertoires

source: Command :command:`isdir` ...
fr: La commande :command:`isdir` ...

source: ... checks if :file:`C:\\Program Files (x86)\\software` is a directory.
fr: ... vérifie que :file:`C:\\Program Files (x86)\\software` est un répertoire.

source: https://www.wapt.fr/en/api-doc-1.5/source/setuphelpers.html?highlight=get_file_properties#setuphelpers.propertiesr
fr: Pour plus d'informations ou pour connaître les paramètres complémentaires de la commande, consultez la documentation de référence (en anglais) en visitant :

source: Command :command:`isfile` ...
fr: La commande :command:`isfile` ...

source: ... checks if :file:`C:\\Program Files (x86)\\software\\file` is a file.
fr: ... vérifie que :file:`C:\\Program Files (x86)\\software\\file` est un fichier.

source: For more informations or to learn more on arguments on that function,* please visit official Setuphelpers reference documentation:
fr: Pour plus d'informations ou pour connaître les paramètres complémentaires de la commande, consultez la documentation de référence (en anglais) en visitant :

source: Check if a directory is empty
fr: Tester si un répertoire est vide

source: Command :command:`dir_is_empty` ...
fr: La commande :command:`dir_is_empty` ...

source: ... checks that directory :file:`C:\\Program Files (x86)\\software` is empty.
fr: ... vérifie que le répertoire :file:`C:\\Program Files (x86)\\software` est vide.

source: Copying a file
fr: Copier un fichier

source: Command :command:`filecopyto` ...
fr: La commande :command:`filecopyto` ...

source: ... copies :file:`file.txt` into the :file:`C:\\Program Files (x86)\\software` directory.
fr: ... copie le fichier :file:`file.txt` dans le répertoire :file:`C:\\Program Files (x86)\\software`.

source: Copying a directory
fr: Copier un répertoire

source: Command :command:`copytree2` ...
fr: La commande :command:`copytree2` ...

source: ... copies the :file:`sources` folder into the :file:`C:\\projet` directory.
fr: ... copie le dossier :file:`sources` dans le répertoire :file:`C:\\projet`.

source: Retrieving the version of a file
fr: Récupérer la version d'un fichier

source: Command :command:`get_file_properties` ...
fr: La commande :command:`get_file_properties` ...

source: ... shows package properties.
fr: ... affiche les propriétés du paquet.

source: Manipulating registry keys
fr: Manipulation de clés de registre

source: Checking the existence of a registry key
fr: Tester la présence d'une clé de registre

source: Command :command:`registry_readstring` ...
fr: La commande :command:`registry_readstring` ...

source: ... checks if registry key *{8A69D345-D564-463c-AFF1-A69D9E530F96}* exists in registry path :file:`SOFTWARE\\Google\\Update\\Clients` of *HKEY_LOCAL_MACHINE*.
fr: ... vérifie que la clé *{8A69D345-D564-463c-AFF1-A69D9E530F96}* existe dans le répertoire :file:`SOFTWARE\\Google\\Update\\Clients` de la ruche *HKEY_LOCAL_MACHINE*.

source: Showing the value of a registry key
fr: Afficher la valeur d'une clé de registre

source: ... reads the value *{8A69D345-D564-463c-AFF1-A69D9E530F96}* stored in the registry path :file:`SOFTWARE\\Google\\Update\\Clients` of *HKEY_LOCAL_MACHINE*.
fr: ... lit la valeur de la clé *{8A69D345-D564-463c-AFF1-A69D9E530F96}* inscrite dans le répertoire :file:`SOFTWARE\\Google\\Update\\Clients` de la ruche *HKEY_LOCAL_MACHINE*.

source: Modifying the value of a registry key
fr: Modifier la valeur d'une clé de registre

source: Command :command:`registry_setstring` ...
fr: La commande :command:`registry_setstring` ...

source: ... modifies the value of the registry key *TOUVersion* stored in the registry path :file:`SOFTWARE\\Microsoft\\Windows Live` of *HKEY_CURRENT_USER*.
fr: ... modifie la valeur de la clé *TOUVersion* dans le répertoire :file:`SOFTWARE\\Microsoft\\Windows Live` de la ruche *HKEY_CURRENT_USER*.

source: Creating and destroying shortcuts
fr: Créer et supprimer des raccourcis

source: Command :command:`create_desktop_shortcut` ...
fr: La commande :command:`create_desktop_shortcut` ...

source: ... creates the shortcut *WAPT Console Management* into :file:`C:\\Users\\Public` directory pointing to :file:`C:\\Program Files (x86)\\wapt\\waptconsole.exe`; the shortcut is available for all users.
fr: ... crée le raccourci :guilabel:`WAPT Console Management` dans le répertoire :file:`C:\\Users\\Public` pointant vers l'exécutable :program:`C:\\Program Files (x86)\\wapt\\waptconsole.exe` ; le raccourci est ajouté pour tous les utilisateurs.

source: Command :command:`remove_desktop_shortcut` ...
fr: La commande :command:`remove_desktop_shortcut` ...

source: ... deletes the *WAPT Console Management* shortcut from the folder :file:`C:\\Users\\Public`; the shortcut is deleted for all users.
fr: ... supprime le raccourci :guilabel:`WAPT Console Management` du répertoire :file:`C:\\Users\\Public` ; le raccourci est supprimé pour tous les utilisateurs.

source: create_user_desktop_shortcut/ remove_user_desktop_shortcut
fr: create_desktop_shortcut / remove_desktop_shortcut

source: These functions are used in session_setup context
fr: Ces fonctions sont utilisées avec le session_setup.

source: Command :command:`create_user_desktop_shortcut` ...
fr: La commande :command:`create_user_desktop_shortcut` ...

source: ... creates the shortcut *WAPT Console Management* on user desktop pointing to :file:`C:\\Program Files (x86)\\wapt\\waptconsole.exe`.
fr: ... crée le raccourci :guilabel:`WAPT Console Management` sur le bureau de l'utilisateur pointant vers l'exécutable :program:`C:\\Program Files (x86)\\wapt\\waptconsole.exe`.

source: Removing a shortcut for the current user
fr: Remove a shortcut from the current users

source: Command :command:`remove_user_desktop_shortcut` ...
fr: La commande :command:`remove_user_desktop_shortcut` ...

source: ... deletes the *WAPT Console Management* shortcut from the logged in user's desktop.
fr: ... supprime le raccourci :guilabel:`WAPT Console Management` du bureau de l'utilisateur.

source: Windows environment/ Software/ Services
fr: Environment Windows / Logiciels / Services

source: Command :command:`windows_version` ...
fr: La commande :command:`windows_version` ...

source: ... checks that the Windows version is stricly inferior to *6.2.0*.
fr: ... vérifie que la version de Windows est strictement inférieure à *6.2.0*.

source: Visit also `Microsoft Windows version number <https://msdn.microsoft.com/fr-fr/library/windows/desktop/ms7248322>`_.
fr: Liste des `numéros de version de Windows <https://msdn.microsoft.com/fr-fr/library/windows/desktop/ms724832>`_.

source: Command :command:`iswin64` ...
fr: La commande :command:`iswin64` ...

source: ... checks that the system architecture is 64bits.
fr: ... vérifie que le processeur de la machine est 64bits.

source: Return different *ProgramFiles* locations
fr: Renvoie les différentes localisations de *Program Files*

source: Command :command:`programfiles64` ...
fr: La commande :command:`programfiles64` ...

source: ... returns native Program Files directory, eg. :file:`C:\\Program Files (x86)` on either win64 or win32 architecture.
fr: Renvoie le répertoire natif du programme, c.à.d. :file:`C:\\Program Files (x86)` pour les architecture win64 et win32.

source: ... returns path of the 32bit Program Files directory, eg. :file:`Programs Files (x86)` on win64 architecture, and :file:`Programs Files` on win32 architecture.
fr: Renvoie le chemin vers le répertoire :file:`Programs Files (x86)` (sur architecture win64) ou :file:`Programs Files` (sur architecture win32).

source: These functions are used with :command:`session_setup`
fr: Ces fonctions sont utilisées avec le :command:`session_setup`.

source: Command :command:`user_appdata` ...
fr: La commande :command:`user_appdata` ...

source: ... returns roaming *AppData* profile path of logged on user (:file:`C:\\Users\\%username%\\AppData\\Roaming`).
fr: ... renvoie le profil *appdata* itinérant de l'utilisateur courant (:file:`C:\\Users\\%username%\\AppData\\Roaming`).

source: Command :command:`user_local_appdata` ...
fr: La commande :command:`user_local_appdata` ...

source: ... returns the local *AppData* profile path of the logged on user (:file:`C:\\Users\\%username%\\AppData\\Local`).
fr: ... renvoie le profil *appdata* local de l'utilisateur courant (:file:`C:\\Users\\%username%\\AppData\\Local`).

source: Command :command:`disable_file_system_redirection` ...
fr: La commande :command:`disable_file_system_redirection` ...

source: Disable wow3264 redirection in the current context
fr: Gère le contexte pour désactiver temporairement le redirecteur wow3264.

source: Command :command:`get_current_user` ...
fr: La commande :command:`get_current_user` ...

source: ... shows the currently logged on username
fr: ... affiche l'identifiant de l'utilisateur connecté.

source: Command :command:`get_computername` ...
fr: La commande :command:`get_computername` ...

source: ... shows the name of the computer
fr: ... affiche le nom de la machine sans le domaine.

source: Command :command:`get_domain_fromregistry` ...
fr: La commande :command:`get_domain_fromregistry` ...

source: ... returns the :abbr:`FQDN (Fully Qualified Domain Name)` of the computer.
fr: ... renvoie le nom de la machine avec le domaine.

source: Command :command:`installed_softwares` ...
fr: La commande :command:`installed_softwares` ...

source: ... returns the list of installed software on the computer from registry in an array.
fr: ... renvoie la liste des logiciels inscrits dans la base de registre machine sous forme de tableau.

source: uninstalll_cmd
fr: uninstall_cmd

source: Command :command:`uninstall_cmd` ...
fr: La commande :command:`uninstall_cmd` ...

source: ... returns the silent uninstall command.
fr: ... renvoie la commande de désinstallation silencieuse :

source: uninstalling software
fr: désinstaller des logiciels

source: for each item of the list return by *installed_softwares* containing keyword *winscp*;
fr: pour chaque élément de la liste retournée par *installed_softwares* avec le mot clé *winscp* ;

source: if the version is lower than 5.0.2;
fr: si la version dans la liste est plus petite que 5.0.2 ;

source: then uninstall using the *uninstall_cmd* and specifying the corresponding *uninstallkey*;
fr: alors lancer la désinstallation avec *uninstall_cmd* et en indiquant la *uninstallkey* ;

source: Command :command:`killalltasks` ...
fr: La commande :command:`killalltasks` ...

source: ... kills the process named *Firefox*.
fr: ... termine l'exécution du logiciel *Firefox*.

source: Using control file fields
fr: Utiliser les champs du fichier control

source: ... shows the *version* value from the :file:`control` file.
fr: ... affiche le champ ``version`` du fichier :file:`control` du paquet WAPT.

source: ... shows the software version number without the WAPT version number from the :file:`control` file.
fr: ... affiche le numéro de version du fichier :file:`control` sans le numéro de version de packaging WAPT.

source: Calling WAPT actions in a WAPT package
fr: Appeler des actions WAPT dans des paquets WAPT

source: Installing a package
fr: Installer un paquet

source: Command :command:`install` ...
fr: La commande :command:`install` ...

source: ... installs *tis-scratch* on the computer.
fr: ... installe *tis-scratch* sur la machine.

source: Removing a package
fr: Supprimer un paquet

source: Command :command:`remove` ...
fr: La commande :command:`remove` ...

source: ... uninstalls *tis-scratch* from the computer.
fr: ... désinstalle *tis-scratch* de la machine.

source: Forgeting a package
fr: Oublier un paquet

source: Command :command:`forget_packages` ...
fr: La commande :command:`forget_packages` ...

source: ... informs WAPT to forget *tis-scratch* on the selected computer.
fr: ... informe WAPT de ne plus suivre le paquet *tis-scratch* ; WAPT ne connaîtra plus l'existence de ce paquet.

source: If the desired result is to remove *tis-scratch*, you should either reinstall the package (:code:`wapt-get install "tis-scratch"`) then remove it (:code:`wapt-get remove "tis-scratch"`), either removing it manually from the Control Panel menu :menuselection:`Add/ Remove Programs`.
fr: Si vous voulez supprimer *tis-scratch*, il faudra soit réinstaller le paquet (:command:`wapt-get install "tis-scratch"`), puis le supprimer (:command:`wapt-get remove "tis-scratch"`), ou bien le supprimer manuellement à partir du panneau de configuration Windows :menuselection:`Ajout / Suppression de Programmes`.
