Repository: dGs-/WAPT-Documentation
Catalog: source/locale/*/LC_MESSAGES/wapt-security/security-firewall.po
Languages: fr

source: Configuring the firewall on the WAPT Server
fr: Configurer le pare-feu sur le serveur WAPT

source: Firewall, WAPT, security, Kerberos, documentation
fr: Firewall, WAPT, securité, documentation, pare-feu

source: WAPT Server firewall configuration is essential and should be the first step towards achieving better security in WAPT.
fr: La configuration du pare-feu du serveur WAPT est essentielle et devrait être la première étape vers une meilleure sécurité dans le WAPT.

source: As WAPT aims to be secure by design, only a minimal set of open ports is needed on the WAPT Server compared to other solutions.
fr: Comme WAPT vise à être sécurisé *by design*, seul un ensemble minimal de ports ouverts est nécessaire sur le serveur WAPT par rapport aux autres solutions.

source: You will find in the following documentation firewall tips to improve WAPT security.
fr: Vous trouverez dans la documentation suivante des conseils autour des configurations de pare-feu pour renforcer la sécurité du serveur WAPT.

source: Data-flow diagram of WAPT
fr: Diagramme de flux de données de WAPT

source: As you can see, only ports 80 and 443 must be opened for incoming connections as the WAPT frameworks works with websockets initiated by the WAPT agents.
fr: Comme vous pouvez le voir, seuls les ports 80 et 443 doivent être ouverts pour les connexions entrantes car WAPT fonctionne avec des *webockets* initiées par les agents WAPT.

source: Configuring the firewall for WAPT Server on Debian Linux
fr: Configurer le pare-feu pour le serveur WAPT sous Debian Linux

source: **By default on Debian Linux, no firewall rule applies**.
fr: **Par défaut sur Debian Linux, aucune règle de pare-feu ne s'applique**.

source: disable :program:`ufw` and install :program:`firewalld` instead:
fr: désactiver :program:`ufw` et installer :program:`firewalld` à la place :

source: simply apply this :program:`firewalld` configuration:
fr: appliquez simplement cette configuration :program:`firewalld` :

source: Configuring the firewall for WAPT Server on CentOS
fr: Configurer le pare-feu pour le serveur WAPT sur CentOS
