Repository: dGs-/WAPT-Documentation
Catalog: source/locale/*/LC_MESSAGES/waptserver-update/migration13-16/migration-1.6-windows.po
Languages: fr

source: Upgrading the WAPT Server on Windows
fr: Migrer à WAPT 1.6 pour Windows

source: upgrading, upgrade, WAPT, 1.3, 1.6, Windows, documentation
fr: migration, WAPT, 1.3, 1.6, Windows, documentation

source: Upgrading WAPT from 1.3 to 1.6 on Windows
fr: Mettre à jour WAPT de 1.3 à 1.6 pour Windows

source: WAPT Server no longer installs on a x86 version of Windows
fr: WAPT Serveur n'est plus installable sur une version x86 de Windows

source: download the latest version of :program:`waptserversetup` 1.6 from https://wapt.tranquil.it/wapt/latest/;
fr: télécharger la dernière version de :program:`waptserversetup` 1.6 depuis https://wapt.tranquil.it/wapt/releases/latest/ ;

source: launch the installation on top of the existing 1.3 version by following :ref:`this documentation <wapt-server_win_install>` ;
fr: lancer l'installation par dessus l'installation 1.3 déjà existante en suivant :ref:`cette documentation <wapt-server_win_install>` ;

source: At the end of the post-configuration step, :program:`waptserver` will detect that you are upgrading from WAPT 1.3.13 and will ask you to launch the migration of the database from MongoDB to PostgreSQL.
fr: A la fin de la post configuration de waptserver la configuration va détécter que vous venez d'un version 1.3 de WAPT et va vous proposer de lancer la migration de MongoDB à PostgreSQL.

source: click on :guilabel:`Yes`;
fr: cliquer sur :guilabel:`Oui` ;

source: launch the WAPT console
fr: lancer la console :

source: If you come from a WAPT 1.3.13 version running with IIS, the WAPT listening ports must be changed. In that case, follow the documentation for :ref:`changing the listening port <windows_changing_port_80_443>`.
fr: Si vous venez d'une version WAPT 1.3.13 installée avec IIS, le port d'écoute de WAPT doit être changé. Vous devez dans ce cas suivre la documentation :ref:`pour changer le port d'écoute <windows_changing_port_80_443>`.

source: You may now go to the next step to :ref:`generate the necessary keys <key-regenerate>`!!
fr: Vous pouvez maintenant passer à l'étape suivante pour :ref:`générer les clés de signature <key-regenerate>` !!

source: Migrating WAPT 1.3 from a Windows OS to a Linux OS
fr: Passer WAPT 1.3 de Windows à Linux

source: The simplest method is to move over to a Linux based version of :program:`waptserver`.
fr: Nous pouvons sinon vous proposer de passer à la version linux de :program:`waptserver`.

source: http://downloads.mongodb.org/win32/mongodb-win32-i386-2.6.3.zip?_ga=2.75822417.551196271.1515087017-697019975.1515087017
fr: télécharger MongoDB pour récupérer l'exe :program:`mongodump` : `Télécharger MongoDB pour Windows <https://downloads.mongodb.org/win32/mongodb-win32-i386-2.6.3.zip?_ga=2.75822417.551196271.1515087017-697019975.1515087017>`_ ;

source: extract :file:`mongodump.exe` from the archive;
fr: extraire le zip puis exécuter :program:`mongodump` ;

source: A dump folder should have been created in the same directory as the :file:`mongodump.exe` file.
fr: Un dossier :file:`dump` a été créé dans le même repertoire que le fichier :file:`mongodump.exe`.

source: backup the entire directory :file:`C:\wapt` of the WAPT Server;
fr: sauvegardez tout le repertoire :file:`C:\wapt` de votre server WAPT ;

source: backup the folder :file:`C:\private`;
fr: sauvegardez le dossier :file:`C:\private` ;

source: install a fresh version **1.3.13** of WAPT on Linux (debian 8 x64) or CentOS7/ RedHat7 (x64):
fr: installez ensuite une version **1.3.13** de WAPT sous linux (Debian 9 x64) ;

source: To install a new Linux Debian9 (Stretch) on a physical or virtual machine without a graphical user interface, please visit the official documentation for `Debian9 <https://www.debian.org/releases/stretch/amd64/>`_.
fr: Pour installer une Debian 9 (Stretch) neuve (machine physique ou virtuelle) sans interface graphique, référez vous à la documentation officielle : Debian GNU/Linux Installation Guide pour `Strech <https://www.debian.org/releases/stretch/amd64/>`_.

source: if the WAPT agents point to an IP address, then the new Debian based WAPT Server must have the same IP address as the old Windows based WAPT Server.
fr: si les agents WAPT pointent sur une adresse IP, alors le nouveau serveur doit avoir la même adresse IP que l'ancien serveur WAPT sous windows ;

source: if the WAPT agents point to a DNS CNAME, then you may point the :term:`DNS` field *srvwapt* to the IP address of the new Linux server.
fr: si vos agents WAPT pointent vers un enregistrement :term:`DNS`, alors vous pouvez modifier le champ dns *srvwapt* en indiquant la nouvelle adresse IP du serveur WAPT linux ;

source: update the download sources;
fr: mettre à jour les sources de téléchargement ;

source: install the WAPT Server;
fr: installer le serveur WAPT ;

source: The utilities :program:`tis-waptserver`, :program:`tis-waptsetup` et :program:`tis-waptrepo` are signed; it is therefore necessary to recover the GPG key below to avoid warning messages when installing them.
fr: Les paquets :program:`tis-waptserver`, :program:`tis-waptsetup` et :program:`tis-waptrepo` sont signés et il est nécessaire de récupérer la clef gpg ci-dessous pour éviter les messages de warning lors de l'installation.

source: launch the configuration script;
fr: lancer le script de configuration ;

source: The password requested in step 4 is used to access the WAPT console.
fr: Le mot de passe demandé en étape #4 est utilisé pour accéder à la console WAPT.

source: configure the WAPT Server;
fr: configurer le serveur WAPT ;

source: start the WAPT Server;
fr: démarrer le serveur WAPT ;

source: restore the WAPT packages on the Linux server;
fr: restaurer les paquets WAPT de la machine windows sur le serveur Linux :

source: upload the content of :file:`C:\wapt\waptserver\repository\wapt` in :file:`/var/www/wapt/`;
fr: uploader le contenu de :file:`C:\wapt\waptserver\repository\wapt` dans :file:`/var/www/wapt/` ;

source: upload the content of :file:`C:\wapt\waptserver\repository\wapt-host` in :file:`/var/www/wapt-host/`;
fr: uploader le contenu de :file:`C:\wapt\waptserver\repository\wapt-host` dans :file:`/var/www/wapt-host/` ;

source: You may upload the files on the Linux Debian Server using the :program:`WinSCP` utility.
fr: Vous pouvez uploder sur le server linux avec le logiciel :program:`winscp`

source: then launch the command:
fr: exécuter ensuite la commande :

source: restore the MongoDB database on the Linux server:
fr: restaurer la base de données MongoDB sur le server linux :

source: using :program:`WinSCP`, upload the MongoDB dump folder in :file:`/root/`;
fr: uploader maintenant le dossier :file:`dump` dans :file:`/root/` avec WinSCP ou équivalent ;

source: restore the MongoDB dump on your Linux hosted MongoDB instance:
fr: restaurer la base MongoDB windows sur la base MongoDB linux :

source: You WAPT Server now works in 1.3.13 on Linux.
fr: Votre serveur WAPT fonctionne à nouveau en version 1.3.13 sous Linux.

source: You may now install your :program:`waptagent` on your :term:`Administrator` management PC and restore the :file:`C:\private` folder on your workstation.
fr: Vous pouvez maintenant installer votre :program:`waptagent` sur votre PC d':term:`Administrateur`, et restaurer le dossier :file:`C:\private`.

source: You must not regenerate a private key, you must only point to your private key in the console. You must also refill the package prefix.
fr: Vous ne devez pas regénérer de clé privée, vous devez redonner le chemin vers votre clé privée dans les paramètres de la console. Vous devez également réindiquer le préfix.

source: You may now follow the classic procedure to upgrade from 1.3.13 to 1.6 !!
fr: Vous pouvez maintenant suivre la procédure classique de mise à jour de WAPT 1.3.13 vers 1.6 !!
