Repository: dGs-/WAPT-Documentation
Catalog: source/locale/*/LC_MESSAGES/wapt-replication/wapt-replicate-to-multiple-repositories/index.po
Languages: fr

source: Replicating a repository to preserve the bandwidth on remote sites
fr: Répliquer un dépôt pour préserver la bande passante des sites secondaires

source: multiple repositories, WAPT, replication, replicate, bandwidth management
fr: multi-dépôts, WAPT, réplication, répliquer, gestion de la bande passante

source: When WAPT is used on bandwidth limited remote sites, it makes sense to have a local device that will replicate the main WAPT repository to reduce the network bandwidth consumed when deploying updates on your remote devices.
fr: Lorsque WAPT est utilisé sur plusieurs sites distants avec des liens Internet à faible débit, il devient pertinent de mettre en place un système de réplication pour alléger la charge réseau liée aux déploiement des mises à jour WAPT sur les machines de votre parc.

source: With remote repositories, WAPT remains a solution with a low operating cost because you don't have to implement high bandwidth fiber links to take advantage of WAPT.
fr: Ainsi, WAPT reste une solution à faible coût d'exploitation car vous n'aurez pas à passer à la fibre pour bénéficier des avantages de WAPT.

source: Replicating WAPT repositories
fr: Répliquer un dépôt

source: It works as follows:
fr: Le principe est le suivant :

source: a small form factor and no maintenance appliance with the role of secondary repository is deployed on the local network of each remote site; a workstation can also be used, although it may not be up and running if you want to connect to it;
fr: un appareil dédié de petite taille sans maintenance ayant le rôle de dépôt secondaire est déployé sur le réseau local de chaque site distant ; un poste de travail peut également être utilisé, bien qu'il puisse ne pas être allumé quand vous souhaiteriez vous y connecter ;

source: the remote repository replicates the packages from the main repository and other repositories;
fr: le dépôt distant réplique les paquets depuis le dépôt principal WAPT et les éventuels dépôts secondaires ;

source: the WAPT clients connect in priority with the repository that is the closest to them, the local repository;
fr: les clients WAPT consultent en priorité le dépôt le plus proche ;

source: The former method used to sync repositories was Syncthing and that method is available both for the Community and the Enterprise versions of WAPT.
fr: L'ancienne méthode utilisée pour synchroniser les dépôts était Syncthing et cette méthode est disponible à la fois pour la version communautaire et la version Entreprise du WAPT.

source: You can find the old documentation here : :ref:`syncthing_usage`.
fr: Vous pouvez trouver l'ancienne documentation ici : :ref:`syncthing_usage`.

source: **The method explained below is for the Enterprise version only**.
fr: **La méthode expliquée ci-dessous s'applique uniquement à la version Enterprise**.

source: WAPT Agent replication role
fr: Rôle de réplication de l'agent WAPT

source: Starting with WAPT 1.8, repository replication can be enabled using a WAPT agent installed on an existing machine, a dedicated appliance or Virtual Machine.
fr: À partir de WAPT 1.8, la réplication du dépôt peut être activée en utilisant un agent WAPT installé sur une machine existante, une *appliance* dédiée ou une machine virtuelle.

source: The replication role is deployed through a WAPT package that enables the :program:`Nginx web server` and configures scheduling, packages types, packages sync, and much more.
fr: Le rôle de réplication est déployé par le biais d'un paquet WAPT qui active le serveur web :program:`Nginx` et configure le déclenchement des mises à jour, les types de paquets, la synchronisation des paquets, et bien plus encore.

source: This feature allows WAPT agents to find dynamically their closest available WAPT repository from a list of rules stored on the WAPT server.
fr: Cette fonctionnalité permet aux agents WAPT de trouver dynamiquement leur dépôt WAPT disponible le plus proche à partir d'une liste de règles stockées sur le serveur WAPT.

source: Replication behavior
fr: Comportement de réplication

source: Repository replication in WAPT is now handled by WAPT agents natively (**Enterprise versions only**).
fr: La réplication du dépôt dans WAPT est maintenant nativement gérée par des agents WAPT spéciaux (**Versions entreprise uniquement**).

source: It is based on a :file:`sync.json` file which indexes every files present in these folders:
fr: Il est basé sur un fichier :file:`sync.json` qui indexe tous les fichiers présents dans ces dossiers :

source: Enabling replication has the following effects:
fr: Permettre la réplication a les effets suivants :

source: once ``enable_remote_repo`` is enabled on a WAPT agent, it will sync packages locally inside the :file:`local_repo_path` folder;
fr: une fois ``enable_remote_repo`` activé sur un agent WAPT, il synchronisera les paquets localement dans le dossier :file:`local_repo_path` ;

source: it adds the WAPT agent in the :guilabel:`Repositories` tab as a Remote repository, enabling new actions such as :guilabel:`Force Sync` or :guilabel:`Check files`;
fr: il ajoute l'agent WAPT dans l'onglet :guilabel:`Dépôts` comme un dépôt distant, permettant de nouvelles actions telles que :guilabel:`Forcer la Syncro` ou :guilabel:`Vérifier les fichiers` ;

source: by default, only the :file:`wapt` folder is synchronized, you can select which folder to sync by adding up elements in ``remote_repo_dirs`` parameters;
fr: par défaut, seul le dossier :file:`wapt` est synchronisé, vous pouvez sélectionner le dossier à synchroniser en ajoutant des éléments dans les paramètres ``remote_repo_dirs`` ;

source: synchronization period can be configured with ``local_repo_time_for_sync_start`` and ``local_repo_time_for_sync_stop`` parameters;
fr: La tranche horaire de synchronisation peut être configurée avec les paramètres ``local_repo_time_for_sync_start`` et ``local_repo_time_for_sync_stop`` ;

source: bandwidth allocated to sync can be configured with ``local_repo_limit_bandwidth``;
fr: La bande passante allouée à la synchronisation peut être configurée avec ``local_repo_limit_bandwidth`` ;

source: Every parameters of WAPT repository sync must be set in the ``[repo-sync]`` section of the WAPT agent's :file:`wapt-get.ini` configuration file.
fr: Tous les paramètres de la synchronisation du dépôt WAPT doivent être définis dans la section ``[repo-sync]`` du fichier de configuration :file:`wapt-get.ini` de l'agent WAPT.

source: Replication role behavior
fr: Comportement de réplication

source: Enabling replication on WAPT Agent
fr: Permettre la réplication sur l'agent WAPT

source: To enable replication on an existing agent (Linux/Windows) you need to deploy a WAPT package. It's role is to:
fr: Pour permettre la réplication sur un agent existant (Linux/Windows), vous devez déployer un paquet WAPT. Son rôle est de :

source: install and enable the :program:`Nginx web server`;
fr: installer et activer le programme :program:`Nginx web server` ;

source: configure nginx virtualhost;
fr: configurer l'hôte virtuel nginx ;

source: enable remote repository configuration in :file:`wapt-get.ini`;
fr: activer la configuration du dépôt distant dans :file:`wapt-get.ini` ;

source: A ready-to-use WAPT package is available in our public store to enable repository replication on Windows or Linux WAPT agents: https://store.wapt.fr/store/tis-remote-repo-conf.
fr: Un paquet WAPT prêt à l'emploi est disponible dans notre dépôt public pour permettre la réplication du dépôt sur des agents WAPT Windows ou Linux : https://store.wapt.fr/store/tis-remote-repo-conf.

source: WAPT Agent replication configuration
fr: Configurer la réplication de l'agent WAPT

source: WAPT Agent replication configuration is set in the ``[repo-sync]`` section in the :file:`wapt-get.ini` configuration file of the WAPT agent:
fr: La configuration de la réplication de l'agent WAPT est définie dans la section ``[repo-sync]`` dans le fichier de configuration :file:`wapt-get.ini` de l'agent WAPT :

source: Mandatory
fr: Obligatoire

source: Example value
fr: Valeur Exemple

source: Definition
fr: Définition

source: Enables remote repository sync connections.
fr: Déclenche les connexions de synchronisation des dépôts à distance.

source: Set local packages root repository path
fr: Définit le chemin racine des paquets locaux

source: Set sync stop time (HH:MM / 24h format)
fr: Définit l'heure d'arrêt de la synchronisation (HH:MM / format 24h)

source: Set sync period (minutes)
fr: Définit la fréquence de synchronisation (minutes)

source: Set sync allowed bandwidth (Mbits/s)
fr: Définit la bande passante maximale allouée aux synchronisations (Mbits/s)

source: Set synced folders (default: wapt,waptwua)
fr: Définit les dossiers synchronisés (par défaut : wapt,waptwua)

source: Below is an example of :file:`wapt-get.ini`:
fr: Vous trouverez ci-dessous un exemple d'un :file:`wapt-get.ini` :

source: WAPT Server replication configuration
fr: Configuration de la réplication du serveur WAPT

source: The WAPT Server needs to be aware of repositories to sync in the ``[global]`` section of its :file:`waptserver.ini` file:
fr: Le serveur WAPT doit connaître les dépôts à synchroniser dans la section ``[global]`` de son fichier :file:`waptserver.ini" :

source: Enables remote repository sync server side (sync.json)
fr: ajouter la machine distante :

source: Repository rules
fr: Règles relatives aux dépôts

source: Repository rules behavior
fr: Comportement des règles de dépôt

source: By enabling repository rules support, the WAPT agents will automatically retrieve their :file:`rules.json` file from the WAPT server.
fr: En activant la prise en charge des règles du dépôt, les agents WAPT récupéreront automatiquement leur fichier :file:`rules.json` sur le serveur WAPT.

source: The :file:`rules.json` file is a signed :mimetype:`.JSON` file that contains a list of sorted rules to apply to the WAPT agent, so to redirect its downloads from the most appropriate repository.
fr: Le fichier :file:`rules.json` est un fichier :mimetype:`.JSON` signé qui contient une liste de règles triées à appliquer à l'agent WAPT, afin de rediriger ses demandes de téléchargements vers le dépôt le plus approprié.

source: If no rules can be matched, WAPT agent fallbacks onto the ``repo_url`` settings of the WAPT server :file:`wapt-get.ini` configuration file.
fr: Si aucune règle ne s'applique, alors l'agent WAPT se rabat sur le paramètre ``repo_url`` du fichier de configuration :file:`wapt-get.ini` du serveur WAPT.

source: Enabling repository rules
fr: Répliquer un dépôtActiver les règles des dépôts

source: Repository rules are configured in WAPT Console.
fr: Les règles de dépôt sont configurées dans la console WAPT.

source: It can be based on several parameters:
fr: Les règles peuvent être basées sur plusieurs paramètres :

source: Domain name
fr: Le nom du domaine

source: Rule based on Active Directory domain name
fr: Règle basée sur le nom de domaine Active Directory

source: Domain sites and services
fr: Sites et services du domaine

source: ``Paris-HQ``
fr: Sites et services du domaine

source: Rule based on Active Directory Sites and Services
fr: Règle basée sur les sites et services Active Directory

source: Agent IP
fr: IP de l'agent

source: Rule based on Agent IP sub-network
fr: Règle basée sur le sous-réseau IP de l'agent WAPT

source: Public IP
fr: IP publique

source: Rule based on Public IP (NATed hosts)
fr: Règle basée sur l'IP publique de l'agent WAPT (hôtes NATés)

source: Hostname
fr: Nom d'hôte

source: Rule based on hostname
fr: Règle basée sur le nom d'hôte

source: Adding a rule in the WAPT Console
fr: Ajouter une règle dans la console WAPT

source: Using repository rules on WAPT agents
fr: Utiliser des règles de dépôt sur les agents WAPT

source: **If you have configured GeoIP redirects on Nginx, you should disable it as it might conflicts with repository rules**.
fr: **Si vous avez configuré des redirections GeoIP sur Nginx, vous devriez les désactiver car elles pourraient entrer en conflit avec les règles du dépôt**.

source: To enable WAPT Agent repository rules, you must enable this setting in the ``[global]`` section of :file:`wapt-get.ini` configuration of the WAPT agent:
fr: Pour activer les règles du dépôt de l'agent WAPT, vous devez activer ce paramètre dans la section ``[global]`` du fichier de configuration :file:`wapt-get.ini" de l'agent WAPT :

source: Enables repository rules usage
fr: Permettre l'utilisation des règles du dépôt
