Repository: dGs-/WAPT-Documentation
Catalog: source/locale/*/LC_MESSAGES/wapt-configuration/wapt-large/index.po
Languages: fr

source: Configuring WAPT Server for large deployments
fr: Configurer le serveur WAPT pour les grands déploiements

source: install, WAPT, documentation, optimization, large deployment
fr: installation, WAPT, documentation, optimisation, grands déploiements

source: The default operating system, Nginx and Postgresql settings are adapted for around 400 WAPT agents. If you have more than 400 clients it is necessary to modify a few system level parameters along with PostgreSQL database, Nginx web and WAPT Server python server.
fr: Les paramètre par défaut pour le système d'exploitation, le service web Nginx et la base de données Postgresql sont adaptés pour environ 400 agents WAPT. Si vous avez plus de 400 clients, il est nécessaire de modifier quelques paramètres au niveau du système, au niveau de la base de données PostgreSQL, du service web Nginx et du Serveur WAPT.

source: In the future the :code:`postconf.sh` script might take in charge this configuration depending on the expected number of client computer.
fr: À l'avenir, le script :code:`postconf.sh` pourrait prendre en charge cette configuration en fonction du nombre prévu d'ordinateurs clients.

source: With the following parameters, one WAPT Server should scale up to around 5000 concurrent active clients. You may have more clients in the database if they are not all running at the same time. If you have more than 5000 clients it is recommended to have more than one WAPT Server.
fr: Avec les paramètres suivants, un serveur WAPT devrait pouvoir accueillir jusqu'à environ 5 000 clients actifs simultanés. Vous pouvez avoir plus de clients dans la base de données s'ils ne fonctionnent pas tous en même temps. Si vous avez plus de 5000 clients, il est recommandé d'avoir plus d'un serveur WAPT en parallèle.

source: The limit in the number of end point clients is due to the bottleneck in the python code and the PostgreSQL backend. WAPT performance gets better with time and in the future WAPT Server might support a large base on a single server. However the Nginx part scales very well and it can takes full advantage of a 10Gbps connection for high load package deployments.
fr: La limite du nombre de clients finaux est due au goulot d'étranglement dans le code python et le moteur PostgreSQL. Les performances du WAPT s'améliorent avec le temps et, à l'avenir, le serveur WAPT pourrait prendre en charge une large base de clients WAPT sur un seul serveur. Cependant, la partie Nginx est très bien dimensionnée et elle peut tirer pleinement partie d'une connexion 10 Gbps pour les gros déploiements de paquets.

source: Configuration changes for better performance
fr: Changements de configuration pour une performance renforcée

source: **The parameters to be modified below are linked together and should be modified globally and not individually**.
fr: **Les paramètres à modifier ci-dessous sont liés entre eux et doivent être modifiés globalement et non individuellement**.

source: Configuring Nginx
fr: Configurer Nginx

source: In the :file:`/etc/nginx/nginx.conf` file, modify ``worker_connections`` parameter. The value should be around 2.5 time the number of WAPT clients (n connexions for websockets and n connections for packages downloads and inventory upload + some margin).
fr: Dans le fichier :file:`/etc/nginx/nginx.conf`, modifier le paramètre ``worker_connections``. La valeur devrait être environ 2,5 fois le nombre de clients WAPT (n connexions pour les webockets et n connexions pour le téléchargement de paquets et le chargement de l'inventaire + une certaine marge).

source: Then upgrade the number of *filedescriptors* in the :file:`/etc/nginx/nginx.conf` file:
fr: Ensuite, mettre à jour le nombre de *filedescriptor* dans le fichier :file:`/etc/nginx/nginx.conf` :

source: Configuring the Linux System
fr: Configurer Linux

source: Increase the number of *filedescriptors*. The systemd unit file asks for an increase in the allowed number of *filedescriptors* (LimitNOFILE=32768). We should have the same thing for Nginx. There are a few limits to modify.
fr: Augmenter le nombre de *filedescriptors*. Le fichier systemd demande une augmentation du nombre autorisé de *filedescriptors* (LimitNOFILE=32768). Nous devrions avoir la même chose pour Nginx. Il y a quelques limites à augmenter.

source: First we modify system wide the number of *filedescriptors* allowed for Nginx and WAPT.
fr: Tout d'abord, nous modifions au niveau du système le nombre de *filedescriptors* autorisés pour Nginx et WAPT.

source: create the :file:`/etc/security/limits.d/wapt.conf`:
fr: créer le fichier :file:`/etc/security/limits.d/wapt.conf` :

source: Nginx serves as a reverse proxy and makes quite a lot of connections. Each WAPT client keeps a *websocket* connection up all the time in order to respond to actions from the WAPT Server.
fr: Nginx sert de proxy inverse et établit un grand nombre de connexions. Chaque client WAPT maintient une connexion *websocket* en permanence afin d'échanger avec le serveur WAPT.

source: The Linux kernel has a protection against having too many TCP connections opened at the same time and one may get the *SYN flooding on port* message in the Nginx log. In order to avoid these messages, it is necessary to modify the two following parameters. It must around 1.5 time the number of WAPT clients.
fr: Le noyau Linux a une protection contre l'ouverture simultanée de trop de connexions TCP et on peut obtenir le message *SYN flooding on port* dans le journal d'historique Nginx. Afin d'éviter ces messages, il est nécessaire de modifier les deux paramètres suivants. Ils doivent être environ 1,5 fois supérieur au nombre de clients WAPT.

source: Configuring the PostgreSQL database
fr: Configurer PostgreSQL

source: A higher number of clients need a higher number of connections to the PostgreSQL database. In the :file:`postgresql.conf` file (file:`/etc/postgresql/11/main/postgresql.conf` on debian 10 for example), you need to increase the following parameter to approximately 1/4 the number of active WAPT agents.
fr: Un plus grand nombre de clients a besoin d'un plus grand nombre de connexions à la base de données PostgreSQL. Dans le fichier :file:`postgresql.conf` (file:`/etc/postgresql/11/main/postgresql.conf` sur debian 10 par exemple), vous devez augmenter le paramètre suivant pour atteindre environ 1/4 du nombre d'agents WAPT actifs.

source: Configuring the WAPT Server
fr: Configurer le serveur WAPT

source: In :file:`/opt/wapt/conf/waptserver.ini` file, ``db_max_connections`` should be equal to PostgreSQL ``max_connections`` minus 10 (PostgreSQL needs to keep some connections for its housekeeping stuff). The ``max_clients`` parameter should be set around 1.2 times the number of WAPT agents:
fr: Dans le fichier :file:`/opt/wapt/conf/waptserver.ini`, ``db_max_connections`` doit être égal à PostgreSQL ``max_connections`` moins 10 (PostgreSQL doit garder quelques connexions pour ses affaires à lui). Le paramètre ``max_clients`` devrait être fixé à environ 1,2 fois le nombre d'agents WAPT :

source: Configuration for large package upload
fr: Configuration pour le téléchargement de gros paquets

source: Depending on the partitioning of your WAPT server you might have to be careful with the Nginx temporary file upload directory. Nginx acts as a reverse proxy for the WAPTServer Python engine and its does a caching of packages upload when uploading a new package from the console.
fr: En fonction du partitionnement de votre serveur WAPT, vous devrez peut-être faire attention au répertoire de téléchargement de fichiers temporaires Nginx. Nginx agit comme un proxy inversé pour le moteur Python du serveur WAPT et il effectue une mise en cache des paquets téléchargés lors du téléchargement d'un nouveau paquet depuis la console.

source: The packages are stored in the :file:`/var/lib/nginx/proxy` directory. You have to make sure that the partition hosting this directory is large enough. You may change this directory location using the following Nginx configuration parameter.
fr: Les paquets sont stockés dans le répertoire :file:`/var/lib/nginx/proxy`. Vous devez vous assurer que la partition qui héberge ce répertoire est suffisamment grande. Vous pouvez changer l'emplacement de ce répertoire en utilisant le paramètre de configuration Nginx suivant.
