Repository: dGs-/WAPT-Documentation
Catalog: source/locale/*/LC_MESSAGES/wapt-create-packages/package-msi/index.po
Languages: fr

source: Packaging simple *.msi packages
fr: Packager des paquets \*.msi simples

source: msi, WAPT, simple, documentation
fr: msi, WAPT, simples, documentation

source: Packaging simple \*.msi packages
fr: Packager des paquets \*.msi simples

source: Prerequisites
fr: Pré-requis

source: Pre-requisites: to build WAPT packages, :ref:`the WAPT development environment must be installed <envdev_setup>`;
fr: Pour la création de paquet il faut d'abord avoir :ref:`installé l'environment de développement WAPT <envdev_setup>` ;

source: From WAPT version 1.3.12 and above, a new package template creation wizard is available to help you make basic packages. For more information on package creation using package wizard, please refer to the :ref:`documentation for creating packages from the WAPT console <creation_paquets_console>`.
fr: Depuis la version 1.3.12 de WAPT, une nouvelle méthode de création rapide de paquets depuis la console WAPT est devenue disponible. Cette documentation est toujours d'actualité, nous vous conseillons cependant d':ref:`utiliser l'interface graphique pour instancier vos modèles de paquets <creation_paquets_console>`.

source: Download the TightVNC MSI installer
fr: télécharger l'installeur MSI de TighVNC ;

source: `download TightVNC MSI x64 <http://www.tightvnc.com/download/2.8.5/tightvnc-2.8.5-gpl-setup-64bit.msi>`_;
fr: `télécharger TightVNC MSI x64 <https://www.tightvnc.com/download/2.8.5/tightvnc-2.8.5-gpl-setup-64bit.msi>`_ ;

source: `download TightVNC MSI x86 <http://www.tightvnc.com/download/2.8.5/tightvnc-2.8.5-gpl-setup-32bit.msi>`_;
fr: `télécharger TightVNC MSI x86 <https://www.tightvnc.com/download/2.8.5/tightvnc-2.8.5-gpl-setup-32bit.msi>`_ ;

source: look up documentation relating to silent flags;
fr: rechercher la documentation associée pour les flags silencieux ;

source: `documentation TightVNC <http://www.tightvnc.com/doc/win/TightVNC_2.7_for_Windows_Installing_from_MSI_Packages.pdf>`_;
fr: `documentation TightVNC <https://www.tightvnc.com/doc/win/TightVNC_2.7_for_Windows_Installing_from_MSI_Packages.pdf>`_ ;

source: This command should install :program:`TightVNC` with its default parameters. However, MSI allows you to customize the behavior of the installed software with MSI properties. The global syntax is:
fr: Cette commande devrait installer :program:`TightVNC` avec les paramètres par défaut. Cependant, MSI vous permet de personnaliser son installation grâce aux propriétés de MSI. La syntaxe générale est :

source: launch a Windows Command Line utility :program:`cmd.exe` as :term:`Local Administrator`;
fr: lancer une invite de commande Windows :program:`cmd.exe` en tant qu':term:`Administrateur Local` ;

source: Windows Command Line utility launched as Local Administrator
fr: Invite de commande Windows lancée en tant qu'Administrateur Local

source: instantiate a package from the pre-defined MSI template;
fr: instancier le paquet à partir du modèle prévu pour un installeur MSI ;

source: Exemple with :program:`TightVNC`:
fr: Exemple avec :program:`TightVNC` :

source: Customizing the package
fr: Personnaliser le paquet WAPT

source: :program:`PyScripter` opens with the new project, ready to be customized and built.
fr: :program:`PyScripter` s'ouvre alors avec le projet TightVNC prêt à être davantage personnalisé.

source: PyScripter with TightVNC project opened
fr: PyScripter avec le projet TightVNC ouvert

source: Using the automatic template has the following effects:
fr: La procédure de création automatique de ce modèle de paquet :

source: it creates a WAPT package folder in :file:`C:\\waptdev`;
fr: il crée le dossier du paquet dans :file:`C:\waptdev` ;

source: it copies the MSI setup file in that directory;
fr: il copie le fichier MSI dans ce dossier ;

source: it creates a generic :file:`setup.py` file;
fr: il crée le fichier :file:`setup.py` générique ;

source: it creates the :file:`control` file containing the WAPT package meta-informations;
fr: il crée le fichier :file:`control` qui identifie le paquet ;

source: it creates the PyScripter project file containing pre-configured WAPT related helpers;
fr: il crée le fichier :file:`wapt.psproj` générique contenant des fonctions d'exécution WAPT pré-paramétrées ;

source: Then it's possible to:
fr: On pourra ensuite :

source: check and complete :file:`control` file informations;
fr: contrôler et compléter les informations du fichier control ;

source: add additional files (x86 version of the installer, configuration files, etc);
fr: ajouter des fichiers supplémentaires (version x86 du MSI, fichiers de configuration, etc) ;

source: customize setup instructions in :file:`setup.py`;
fr: personnaliser la procédure d'installation dans :file:`setup.py` ;

source: make changes to the :file:`control` file as necessary (:ref:`envdev_setup`);
fr: modifier le fichier :file:`control` si nécessaire, voir : :ref:`structure_control` ;

source: You may observe that a subversion (*-1*; dash+number one) has been added. It is the WAPT packaging version.
fr: À noter qu'une sous version (*-1* ; tiret + chiffre un) a été ajoutée. C'est la version du paquet WAPT.

source: This allows to preserve the software version when iteratively improving the WAPT package.
fr: Cela permet de ne pas modifier la version réelle du logiciel quand on pousse une nouvelle installation sur le parc.

source: check the *setup.py* file;
fr: vérifier le fichier *setup.py* ;

source: In the :file:`setup.py` file, you will have to check whether the *uninstall key* automatically that has been filled matches the MSI and that the silent arguments work correctly.
fr: Dans le fichier :file:`setup.py` il faudra vérifier que la clé de désinstallation et les paramètres silencieux sont corrects pour le MSI.

source: Since WAPT version 1.3.12, :command:`install_msi_if_needed` is the function used by default when creating a package Template from a MSI.
fr: Depuis la version 1.3.12 :command:`install_msi_if_needed` est la fonction utilisée par défaut lors de la création d'un modèle de paquet pour un MSI.

source: In this example, we will use the :command:`run` function to show the evolution of the package. The function :command:`install_msi_if_needed` is explained in :ref:`the documentation related to advanced packaging of MSI based WAPT packages <complex_msi_packaging>`.
fr: Dans cet exemple nous utilisons la fonction :command:`run` pour montrer l'évolution du paquet. La fonction :command:`install_msi_if_needed` est expliquée dans la :ref:`partie paquet msi evolué de la documentation <complex_msi_packaging>`.

source: test installing the package on you development computer;
fr: tester l'installation du paquet sur votre machine de développement ;

source: A major advantage of :program:`PyScripter` and WAPT is to be able to test WAPT packages locally, to improve them quickly and iteratively.
fr: L'intérêt de l'environment de développement intégré :program:`PyScripter` est de pouvoir tester en local les paquets WAPT rapidement et de manière itérative.

source: Test installing the package from you development computer
fr: tester l'installation du paquet sur la machine de développement ;

source: Settings
fr: Paramètre

source: Value
fr: Valeur

source: Execute
fr: Exécuter

source: Launch the software installation with its arguments from :file:`setup.py`.
fr: Lancer l'installation du logiciel avec les paramètres renseignés dans :file:`setup.py`.

source: Debug
fr: Débogguer

source: Launch the line by line debugger.
fr: Lancer le debugger ligne par ligne.

source: Launch the uninstallation.
fr: Lancer la désinstallation.

source: Increment the WAPT packaging version, build the package and upload it on the WAPT repository.
fr: Modifier la version du paquet et lance la construction et l'envoi du paquet sur le dépôt.

source: Build and upload the package
fr: Construire et charger le paquet WAPT

source: Once the project has been created, build the package without modifications from the Windows command prompt.
fr: Une fois le projet de paquet créé, on peut lancer la construction du paquet sans modification depuis l'invite de commande Windows.

source: When executing that command, here is what is really happening:
fr: Lorsqu'on exécute cette commande, WAPT :

source: the :file:`manifest.sha256` file containing the list of files included in the package is created;
fr: génère le fichier :file:`manifest.sha256` avec la liste des fichiers contenus dans le paquet ;

source: it compresses the folder :file:`C:\\waptdev\tis-tightvnc-wapt` with a canonical name;
fr: il zippe le répertoire :file:`C:\waptdev\tis-tightvnc-wapt` avec un nom canonique pour les paquets WAPT ;

source: it adds the signature (requires the private key);
fr: ajoute la signature (nécessite la présence de la clé privée) ;

source: it loads the WAPT package onto the WAPT repository using HTTPS;
fr: charge le fichier WAPT en https vers le dépôt WAPT ;

source: it recreates the :file:`https://srvwapt.mydomain.lan/wapt/Packages` index to take into account the new or updated package;
fr: regénère le fichier d'index :file:`https://srvwapt.mydomain.lan/wapt/Packages` pour prendre en compte le nouveau paquet ou la nouvelle version du paquet ;

source: The package is now ready to be deployed.
fr: Le paquet est prêt à être déployé.

source: Example:
fr: Exemple :

source: It is also possible to execute :command:`build-upload` directly from the :guilabel:`Run Configurations` panel in :program:`PyScripter`:
fr: On peut aussi faire un :command:`build-upload` directement depuis le panneau :guilabel:`Run Configurations` du projet dans :program:`PyScripter` :

source: Option "-i build-upload" of PyScripter project
fr: L'option "-i build-upload" du projet PyScripter
