Repository: dGs-/WAPT-Documentation
Catalog: source/locale/*/LC_MESSAGES/wapt-configuration/waptconsole/config-console.po
Languages: fr

source: Configuring the WAPT console
fr: Configurer la console WAPT

source: waptconsole.exe, console, WAPT, installation, preferences, management, documentation,
fr: waptconsole.exe, console, WAPT, configuration, préférences, documentation

source: We will now properly configure the WAPT console.
fr: Nous allons maintenant configurer la console WAPT.

source: Go to console configuration settings: :menuselection:`Tools --> Preferences`.
fr: Accédez aux paramètres de configuration de la console en faisant :menuselection:`Outils --> Préférences`.

source: WAPT console preferences menu
fr: Le menu Préférences de la console WAPT

source: WAPT console preferences
fr: Préférences de la console WAPT

source: We will set here the prefix.
fr: Nous allons paramétrer ici le préfixe.

source: **It is not trivial to change the prefix later as it would require re-signing all packages in all repositories, so choose your prefix well the first time!**
fr: **Il est difficile de changer de préfixe par la suite, donc choisissez-le bien !**

source: The path to the private key has been automatically entered when we generated the private key in the previous step.
fr: Le chemin vers la clé privée a été automatiquement renseigné lors de la création de la clé privée.

source: If you already have a key (ex: from a previous installation), you'll have to fill your old key here.
fr: Si une clé existe déjà (liée à une installation précédente), il faudra la renseigner ici.

source: If you want to learn more on setting up the WAPT console, you may visit the documentation on :ref:`configuring the WAPT console <configuring_the_WAPT_console>`.
fr: Si vous souhaitez en savoir plus sur la configuration de la console WAPT, rendez-vous sur : :ref:`Configurer la console WAPT <configuring_the_WAPT_console>`.

source: You may now go on to :ref:`create the WAPT agent <create_WAPT_agent>`!!
fr: Vous pouvez maintenant :ref:`créer l'agent WAPT <create_WAPT_agent>`.
