Repository: dGs-/WAPT-Documentation
Catalog: source/locale/*/LC_MESSAGES/wapt-configuration/waptconsole/index.po
Languages: fr

source: Installing the WAPT management console
fr: Installer la console de management WAPT

source: waptconsole.exe, console, WAPT, installation, preferences, management, documentation
fr: waptconsole.exe, console, WAPT, installation, préférences, management, documentation

source: managing WAPT is done mainly via the WAPT console installed on the :term:`Administrator`'s workstation;
fr: l'administration du serveur WAPT se fait grâce à une console installée sur la station de travail de l':term:`Administrateur` ;

source: the Administrator's computer must be joined to the :term:`Organization`'s Active Directory;
fr: la machine d'administration doit être membre du domaine Active Directory de l':term:`Organisation` ;

source: the host name of the Administrator's workstation must not be longer than 15 characters. This is a limit of sAMAccountName attribute in Active Directory;
fr: le nom de la machine d'administration ne doit pas dépasser 15 caractères (limite liée au sAMAccountName dans Active Directory) ;

source: the Administrator's computer will become critical for WAPT administration and WAPT packages testing;
fr: ce poste sera critique pour l'administration de WAPT et les tests de paquets WAPT ;

source: if DNS records are properly configured, you should be able to access the WAPT web interface by visiting: https://srvwapt.mydomain.lan;
fr: Si vos DNS sont correctement configurés, vous pourrez télécharger la console depuis le serveur WAPT en visitant : https://srvwapt.mydomain.lan ;

source: Downloading and launching the installation of the WAPT console on the Administrator's computer
fr: Télécharger et lancer l'installation de la console sur le poste Administrateur

source: Warning, the WAPT console **MUST NOT** be installed on your Windows based WAPT Server.
fr: Attention, la console ne doit pas être installé sur le serveur WAPT Windows.

source: The WAPT console must be installed on the workstation from which you manage your network.
fr: La console doit être installée sur le poste à partir duquel vous faites l'administration de votre réseau.

source: WAPT Server web interface
fr: Console d'administration Web du serveur WAPT

source: click on :guilabel:`WAPTSetup` link on the right-hand side of the WAPT Server web page;
fr: cliquer sur :guilabel:`WAPTSetup` disponible sur la partie droite de la page web de votre serveur WAPT ;

source: start the executable installer as :term:`Local Administrator` on the :term:`Administrator`'s workstation;
fr: lancer l'exécutable en tant qu':term:`Administrateur Local` de la machine de l':term:`Administrateur` ;

source: choose the language and click on :guilabel:`OK` to install the WAPT console;
fr: choisir la langue et cliquer sur :guilabel:`OK` pour lancer l'installation ;

source: Choose the language for WAPT
fr: Choisir la langue pour WAPT

source: click on :guilabel:`OK` to go on to the next step;
fr: cliquer sur :guilabel:`OK` pour passer à l'étape suivante ;

source: Accept the WAPT license terms
fr: Accepter la licence pour le logiciel WAPT

source: accept the licence terms and click on :guilabel:`Next` to go to next step;
fr: cliquer sur :guilabel:`Suivant` pour passer à l'étape suivante et accepter la licence ;

source: Choose the WAPT destination folder
fr: Choisir le dossier d'installation de WAPT

source: click on :guilabel:`Next` and choose your installation options (default value should be right for most installations);
fr: cliquer sur :guilabel:`Suivant` et choisir les options d'installation (les valeurs par défaut sont bonnes) ;

source: Choose the installer's options
fr: Choisir les options d'installation

source: check :guilabel:`Install WAPT service` if you want to have the WAPT service running on your :term:`Administrator` workstation;
fr: cocher :guilabel:`Installer le service WAPT` pour lancer l'agent WAPT sur votre poste d':term:`Administrateur` ;

source: check :guilabel:`Launch notification tray upon session opening` if you want to have the WAPT icon running in the tray by default;
fr: cocher :guilabel:`Lancer l'icône de notification lors de l'ouverture de session` pour que l'icône WAPT soit accessible dans la barre des tâches ;

source: Setting up the WAPT Server URL
fr: Indiquer l'adresse du serveur WAPT

source: Here, two choices become available to you, you may choose to be guided by the configuration wizard and go directly to :ref:`using_the_WAPT_console`, or you may choose to continue manually with the configuration.
fr: Ici deux choix s'offrent à vous, vous pouvez vous laisser guider par l'assistant de configuration et passer directement à :ref:`using_the_WAPT_console`, ou vous pouvez continuer la configuration manuellement.

source: Choose the WAPT repository and server
fr: Choisir le dépôt et le serveur WAPT

source: Example:
fr: Exemple :

source: WAPT repository URL: http://srvwapt.mydomain.lan/wapt
fr: Repos url : https://srvwapt.mydomain.lan/wapt

source: WAPT Server URL: https://srvwapt.mydomain.lan
fr: Server url : https://srvwapt.mydomain.lan

source: click :guilabel:`Next` and then :guilabel:`Install` to launch the installation, wait for the installation to complete, then click on :guilabel:`Finish` (leave default options);
fr: cliquer sur :guilabel:`Installer` pour passer à l'étape suivante, attendre la fin de l'installation puis cliquer sur :guilabel:`Fin` (laisser les options par défaut) ;

source: Installation Wizard has finished
fr: Assistant d'installation terminé

source: check :guilabel:`Register this computer onto WAPT server` to register the computer with the WAPT Server;
fr: cocher :guilabel:`Enregistrer cet ordinateur dans le serveur WAPT` pour enregistrer l'ordinateur dans l'inventaire central WAPT ;

source: check :guilabel:`Update the list of available package on the main repository` to download the list of available packages from the WAPT repository;
fr: cocher :guilabel:`Mettre à jour la liste des paquets disponibles sur le dépôt principal` pour télécharger la liste des paquets disponibles ;

source: Starting the WAPT console
fr: Lancer la console WAPT

source: on first start, you must start the WAPT console with elevated privileges. :menuselection:`Right-click on the WAPT console binary --> Start as Local Administrator`;
fr: au premier lancement, lancer la console avec élévation de privilège : :menuselection:`Clic-droit sur waptconsole.exe --> Exécuter en tant qu'Administrateur Local` ;

source: log into the WAPT console with the :term:`SuperAdmin` login and password;
fr: s'identifier sur la console de management avec l'identifiant et le mot de passe de :term:`SuperAdmin` ;

source: WAPT Server connexion form
fr: Mire de connexion au serveur WAPT

source: if you have any issue logging into the WAPT console, please refer to the FAQ: :ref:`msg_error_open`;
fr: Si vous rencontrez des problèmes pour vous connecter à la console WAPT, visitez la :ref:`section des problèmes fréquents <msg_error_open>`.

source: A message may appear indicating that your WAPT agent version is obsolete or not yet present.
fr: Un message peut apparaître indiquant que l'agent WAPT est introuvable.

source: Mismatch error between the versions of the console and that of the agent
fr: Erreur de disparité entre la version de la console et de l'agent

source: Go to the next step to :ref:`create your certificate <create_certificate>`!!
fr: Passez à l'étape suivante pour :ref:`créer votre certificat <create_certificate>`.
