Repository: dGs-/WAPT-Documentation
Catalog: source/locale/*/LC_MESSAGES/wapt-configuration/wapt-uninstall/index.po
Languages: fr

source: Uninstalling WAPT agent from clients
fr: Désinstaller l'agent WAPT sur les clients

source: waptagent, linux, uninstalling, uninstall, documentation, WAPT
fr: waptagent, linux, désinstallation, désinstaller, documentation, WAPT

source: Uninstalling WAPT agent on Windows
fr: Désinstaller l'agent WAPT sur Windows

source: If you need to uninstall WAPT agents from clients, the uninstaller is automatically created in the WAPT install location, by default it is :file:`C:\\Program Files (x86)\\wapt\\unins000.exe`.
fr: Si vous devez désinstaller les agents WAPT des clients, le désinstalleur est automatiquement créé dans l'emplacement d'installation WAPT, par défaut il s'agit de :file:`C:\\\Program Files (x86)\\\wapt\\\unins000.exe`.

source: default silent uninstall of a WAPT agent can be achieved with the following command:
fr: la désinstallation silencieuse par défaut de l'agent WAPT peut être réalisée avec la commande suivante :

source: an additional argument can be passed to :command:`unins000.exe` to cleanup everything:
fr: un argument supplémentaire peut être passé à :command:`unins000.exe` pour tout nettoyer :

source: Complete list of command-line arguments for :command:`unins000.exe`:
fr: Liste complète des arguments de la ligne de commande pour :command:`unins000.exe` :

source: Settings
fr: Paramètres

source: Launches unins000.exe silently
fr: Lance unins000.exe en mode silencieux

source: Purges WAPT directory (removes all folders and files)
fr: Purge le répertoire WAPT (supprime tous les dossiers et fichiers)

source: Uninstalling a WAPT agent on Linux
fr: Désinstaller l'agent WAPT sous Linux

source: default uninstall of a WAPT agent can be achieved with the following command, depending on your Linux OS:
fr: la désinstallation par défaut de l'agent WAPT peut être réalisée avec la commande suivante, en fonction de votre système d'exploitation Linux :

source: an additional step can be done using these commands (WIP):
fr: une étape supplémentaire peut être effectuée à l'aide de ces commandes (WIP) :

source: Uninstalling a WAPT agent on MacOS
fr: Désinstaller l'agent WAPT sur MacOS

source: default uninstall of a WAPT agent can be achieved with the following command:
fr: la désinstallation par défaut de l'agent WAPT peut être réalisée avec la commande suivante :

source: Re-enabling Windows Updates before uninstalling
fr: Réactiver Windows Update avant de désinstaller l'agent WAPT

source: In the case you have used WAPT to manage Windows Updates, you might want to re-enable Windows Updates default behavior before uninstalling the WAPT agent.
fr: Dans le cas où vous avez utilisé WAPT pour gérer les mises à jour de Windows, vous voudrez peut-être réactiver le comportement par défaut de Windows Update avant de désinstaller l'agent WAPT.

source: To do so, here is an example package to push before uninstalling the WAPT agent:
fr: Pour ce faire, voici un exemple de paquet à pousser avant de désinstaller l'agent WAPT :
