Repository: dGs-/WAPT-Documentation
Catalog: source/locale/*/LC_MESSAGES/index.po
Languages: fr

source: Presentation
fr: Présentation

source: Documentation
fr: Presentation

source: WAPT Documentation
fr: Documentation de WAPT

source: Documentation, WAPT, introduction, welcome page, Welcome
fr: Documentation, Accueil

source: Welcome to WAPT's official documentation by Tranquil IT, last compiled on |date|.
fr: Bienvenue sur la documentation officielle de WAPT par Tranquil IT en date du |date|.

source: Click `here <WAPT.pdf>`_ for a PDF version of the complete documentation.
fr: Cliquer `ici <WAPT.pdf>`_ pour une version PDF de la documentation complète.

source: WAPT is a software deployment tool whose core set of features is licensed under the GPLv3.
fr: WAPT est une solution de déploiement logiciel dont le coeur est Open-Source (GPLv3).

source: WAPT exists in two flavors, :ref:`WAPT Community and WAPT Enterprise <WAPT_Enterprise>`.
fr: WAPT existe en deux versions, :ref:`WAPT Community et WAPT Enterprise <WAPT_Enterprise>`.

source: Security Certification
fr: Certification de sécurité ANSSI

source: Security Visa from ANSSI dated 14th of February 2018 for WAPT Enterprise Edition 1.5.0.13
fr: Visa de sécurité de l'ANSSI pour WAPT Enterprise 1.5.0.13

source: Cybersecurity solutions are many and diverse, but not all of them offer the same level of effectiveness, robustness and trust.
fr: Les solutions de cyberscurité sont nombreuses et variées, mais toutes n'offrent pas le même niveau d'efficacité, de robustesse et de confiance.

source: Security Visas that the French cyberdefense agency, ANSSI, delivers allow to identify more easily the most reliable security solutions. They are recognized as such after having been evaluated by approved laboratories following a rigorous and recognized methodology.
fr: Les Visas de sécurité que délivre l'ANSSI permettent d'identifier facilement les plus fiables d'entre elles et reconnues comme telles à l'issue d'une évaluation réalisée par des laboratoires agréés selon une méthodologie rigoureuse et éprouvée.

source: Security Certification from French Cyberdefense Agency ANSSI
fr: Qualification Elémentaire ANSSI

source: Following its first level security certification obtained on 14 February 2018, WAPT has been prized with a `higher level certification <https://www.tranquil.it/wp-content/uploads/qualification-anssi-tranquil-it.pdf>`_ from ANSSI.
fr: Suite à sa certification CSPN du 14 février 2018, WAPT a obtenu le 15 mars 2018 la `Qualification Elémentaire <https://www.tranquil.it /wp-content/uploads/qualification-anssi-tranquil-it.pdf>`_ de l'ANSSI.

source: Main features
fr: Principales fonctionnalités

source: **For System Administrators**:
fr: **Pour les administrateurs système** :

source: install software and configurations silently;
fr: installer des logiciels de manière silencieuse ;

source: maintain up to date an installed base of software and configurations;
fr: tenir à jour le parc logiciel ;

source: configure software at the system and user level to reduce the load on support teams;
fr: configurer les logiciels et le système pour diminuer la charge sur les équipes de support ;

source: remove unwanted or out of cycle software and configurations silently;
fr: désinstaller des logiciels de manière silencieuse ;

source: give :term:`Users` more autonomy to install software safely and reliably;
fr: rendre les :term:`Utilisateurs` plus autonomes pour installer des logiciels de manière sûre et sécurisée ;

source: reduce as much as possible the consumption of bandwidth on remote sites to preserve it for productive uses;
fr: réduire autant que possible la consommation de bande passante pour la réserver aux usages productifs ;

source: **For IT Security Officers**
fr: **Pour les RSSI**

source: pilot the software installed base to converge to a security standard acceptable to the Organization;
fr: faire converger le parc logiciel vers une norme de sécurité ;

source: prepare your enterprise for the coming `GDPR <https://en.wikipedia.org/wiki/General_Data_Protection_Regulation>`_ and help your DPO keep his register of data processing, because you two will become close colleagues;
fr: préparer votre entreprise à l'arrivée du `RGPD <https://fr.wikipedia.org/wiki/ R%C3%A8glement_g%C3%A9n%C3%A9ral_sur_la_protection_des_donn%C3%A9es>`_ et aider votre DPD, qui deviendra un proche collègue à tenir à jour son registre des traitements ;

source: to no more tolerate machines operating in *Administrator* mode;
fr: ne plus tolérer le fonctionnement des machines en mode *Administrateur* ;

source: reduce the level of exposure to software vulnerabilities and `lateral movement attacks <https://en.wikipedia.org/wiki/Network_Lateral_Movement>`_;
fr: réduire l'exposition du parc aux vulnérabilités logicielles et aux `attaques par propagation latérales <https://www.sciencesetavenir.fr/ high-tech/informatique/cyberattaque-petya-petrwap-un-mode- operatoire-plus-subtil-que-wannacry_114254>`_ ;

source: bring up audit indicators for a better knowledge of the state of installed IT devices and their global security level;
fr: remonter des indicateurs d'audit pour une meilleure connaissance de l'état et de la sécurité du parc ;

source: be prompt to deploy updates to react to cyber attacks like `Wannacry <https://www.us-cert.gov/ncas/current-activity/2017/05/17/ICS-CERT-Releases-WannaCry-Fact-Sheet>`_ or `notPetya <https://www.us-cert.gov/sites/default /files/publications/MIFR-10130295.pdf>`_;
fr: déployer immédiatement pour réagir à une menace type `Wannacry <https://ics-cert .us-cert.gov/sites/default/files/FactSheets/ICS-CERT_FactSheet_WannaCry_ Ransomware_S508C.pdf>`_ ou `notPetya <https://www.us-cert.gov/sites/default /files/publications/MIFR-10130295.pdf>`_ ou bien laisser faire automatiquement les choses du quotidien ;

source: **For End-Users**
fr: **Pour les utilisateurs finaux**

source: have your software configured to work well in the context of your Organization and trust that they will work correctly;
fr: avoir ses logiciels configurés de base pour bien fonctionner dans le contexte de son Organisation et avoir confiance qu'ils fonctionneront correctement ;

source: reduce your need for support by your IT teams, whose reaction times are often long because of their workloads;
fr: réduire le besoin de support par les équipes informatiques, dont les temps de réaction sont parfois long du fait de leurs charges de travail ;

source: have better working and more predictable IT systems because of standard software configurations;
fr: avoir une meilleure qualité de travail et rendre prédictible le parc informatique grâce à une configuration standarde pour les logiciels;

source: Source code repository
fr: Code Source

source: You may access the source code by visiting Tranquil IT's GitHub repository located at https://github.com/tranquilit/WAPT.
fr: Vous pouvez accéder au code source sur notre dépôt GitHub : https://github.com/tranquilit/WAPT.

source: How to contribute?
fr: Contribuer

source: You may want to have a look at our :ref:`contribution guide <how_to_contribute>`.
fr: Vous pouvez consulter notre :ref:`guide de contribution <how_to_contribute>`.

source: WAPT support and training
fr: Support WAPT

source: commercial support: https://www.tranquil.it/
fr: Support commercial : https://www.tranquil.it/page/offreswapt

source: mailing list: http://lists.tranquil.it/listinfo/wapt
fr: Liste de diffusion : https://lists.tranquil.it/listinfo/wapt

source: Indices and tables
fr: Index et tables
