Repository: dGs-/WAPT-Documentation
Catalog: source/locale/*/LC_MESSAGES/wapt-enterprise.po
Languages: fr

source: WAPT Community and WAPT Enterprise
fr: WAPT Community et WAPT Enterprise

source: Main functional benefits of the Enterprise version of WAPT
fr: Principaux ajouts fonctionnels de la version Enterprise

source: WAPT is designed to help IT system administrators manage the lifecycle of their installed base of Windows applications, drivers, OSes and configurations in system and user context.
fr: WAPT est conçu pour aider les administrateurs de systèmes informatiques à gérer le cycle de vie de leur base d'applications Windows, de pilotes, de systèmes d'exploitation et de configurations en contexte système et en contexte utilisateur.

source: With WAPT Enterprise, you benefit automatically from the base functions included in WAPT Community to help you deploy, upgrade and remove software and configurations on your Windows devices, from a central console.
fr: Avec WAPT Enterprise, vous bénéficiez des fonctions de base disponibles dans WAPT pour déployer, mettre à jour et supprimer des logiciels et des configurations sur vos périphériques Windows à partir d'une console centralisée et simple à utiliser.

source: WAPT is an *opencore* model and the **Enterprise** version is based on the **Community** version with the following features designed to answer the needs of larger Organisations:
fr: WAPT est un modèle *opencore* et la version **Enterprise** est basée sur la version **Community** de WAPT avec les améliorations suivantes conçues pour répondre aux besoins des moyennes et grandes organisations :

source: **Active Directory authentication** of WAPT package developers, package deployers, self-service users and for the initial registering of the WAPT agents with the WAPT Server. In addition, the display of WAPT equipped devices in the WAPT console follow the same structure as the hierarchical structure of the Organization's Active Directory :abbr:`OU (Organizational Units)`;
fr: **Authentification Active Directory** des développeurs de paquets WAPT, des déployeurs de paquets, des utilisateurs en libre-service et pour l'enregistrement initial des périphériques sur le serveur WAPT. De plus, l'affichage des périphériques dans la console de gestion WAPT suit la structure hiérarchique de vos :abbr:`UO (Unités Organisationnelles)` Active Directory ;

source: **role separation between package developers and package deployers**. This way, central IT teams may build the software packages because they know the Organization's security guidelines, and local IT teams may deploy the WAPT packages because they know the needs of their user base. Such a separation is implemented using differentiated sets of keys (i.e. **Code Signing** SSL certificates for package developers and **Simple** SSL certificates for package deployers);
fr: **Séparation des rôles entre les développeurs de paquets et les déployeurs de paquets**. De cette façon, les paquets WAPT peuvent être conçus par les équipes informatiques de l'entreprise pour suivre les directives de sécurité de l'entreprise et ils sont ensuite déployés par les équipes informatiques locales qui connaissent mieux les besoins de leurs utilisateurs. Une telle ségrégation est mise en œuvre au moyen de jeux de clés différenciés (c'est-à-dire des certificats SSL individuels à signature de code pour les développeurs de paquets et des certificats SSL standards pour les déployeurs de paquets) ;

source: **differentiated self service** WAPT Enterprise allows you to apply lists of allowed packages to groups in Active Directory. Allowed users are free to install qualified packages from their list of approved packages without having to submit a ticket to their IT teams.
fr: **Self-service différencié** WAPT Enterprise vous permet d'associer des listes de paquets autorisés à des groupes de sécurité Active Directory. Les utilisateurs autorisés peuvent installer par eux-mêmes des paquets provenant de vos dépôts approuvés sans avoir à soumettre de demande de support aux équipes IT.

source: **WAPT WUA** WAPT allows to manage the Windows Updates on your endpoints.
fr: **WAPT WUA** WAPT permet de gérer les mises à jour Windows sur vos terminaux.

source: **advanced reporting for corporate teams**. This reporting completes the operational reporting already available in the WAPT console; reports help WAPT operators demonstrate their efficacy with WAPT for insuring a greater level of security and conformity for their networks, systems, software and applications.
fr: **Reporting avancé pour les équipes de direction**. Ces rapports complètent les rapports opérationnels déjà disponibles dans la console de gestion ; ils sont conçus pour aider les développeurs et les exploitants de WAPT à démontrer leur efficacité grâce à leur usage de WAPT en éliminant la complexité et en sécurisant correctement leur parc de périphériques et d'applications ;

source: **dynamic repository configuration**. Starting with WAPT 1.8, repository replication can be enabled using a WAPT agent installed on an existing machine, a dedicated appliance or Virtual Machine.
fr: **Configuration dynamique du dépôt**. À partir de WAPT 1.8, la réplication du dépôt peut être activée à l'aide d'un agent WAPT installé sur une machine existante, une *appliance* dédiée ou une machine virtuelle.

source: The replication role is deployed through a WAPT package that enables the :program:`Nginx web server` and configures scheduling, packages types, packages sync, and much more.
fr: Le rôle de réplication est déployé par le biais d'un paquet WAPT qui active le serveur web :program:`Nginx` et configure le déclenchement des mises à jour, les types de paquets, la synchronisation des paquets, et bien plus encore.

source: This feature allows WAPT agents to find dynamically their closest available WAPT repository from a list of rules stored on the WAPT server.
fr: Cette fonctionnalité permet aux agents WAPT de trouver dynamiquement leur dépôt WAPT disponible le plus proche à partir d'une liste de règles stockées sur le serveur WAPT.

source: The Enterprise version of WAPT is particularly advisable for Organizations:
fr: La version Enterprise de WAPT est particulièrement recommandable pour les Organisations :

source: that manage large installed bases of devices (generally above 300 units);
fr: exploitant de vastes parcs (généralement au dessus de 300 machines) ;

source: that are spread geographically with many subsidiaries or production sites;
fr: éclatées géographiquement avec de multiples agences ou sites de production ;

source: that require a strong traceability of actions performed on the installed base of devices for reasons of audit or security;
fr: nécessitant une traçabilité forte des actions réalisées sur le parc pour des raisons d'audit et de sécurité ;

source: Description of services available with the WAPT Enterprise contract
fr: Description des services disponibles dans le cadre du contrat WAPT Enterprise

source: Access to future improvements in WAPT Enterprise
fr: Accès aux améliorations futures dans WAPT Enterprise

source: By subscribing to a WAPT Enterprise contract and by maintaining your subscription valid, you benefit from the future improvements brought into the core of WAPT and you benefit automatically from all future improvements to the WAPT Enterprise version.
fr: En souscrivant à WAPT Enterprise et en maintenant votre abonnement valide, vous bénéficierez bien entendu des futures améliorations apportées au coeur de WAPT et vous accéderez automatiquement aux futures extensions de la version Enterprise.

source: A lapsing of your subscription will automatically switch your WAPT instance back to its corresponding Community version; advanced functions only available in the Enterprise version will no longer be accessible.
fr: L'interruption de votre abonnement vous basculera automatiquement dans la version Community et les fonctions avancées de la version Enterprise ne seront plus accessibles dans votre installation de WAPT.

source: Direct telephone support for your daily usage of WAPT
fr: Assistance téléphonique pour votre utilisation quotidienne de WAPT

source: When your subscription reaches above a certain volume, Tranquil IT, the creator of WAPT, allows you a privileged access to its core team of WAPT experts and developers.
fr: Quand votre abonnement atteint un certain volume, Tranquil IT, le créateur de WAPT, vous accorde un accès privilégié à son équipe centrale de développeurs et d'experts WAPT.

source: We give you access to a dedicated telephone hot-line with a direct answer to satisfy your needs for support.
fr: Nous mettons à votre disposition une hot-line téléphonique dédiée avec une réponse en direct pour satisfaire vos besoins de support.

source: We are committed to providing you with reliable and pertinent answers on the subscribed perimeter, quickly.
fr: Nous nous engageons à vous fournir des réponses fiables et pertinentes sur le périmètre souscrit, rapidement.

source: By subscribing or renewing your WAPT Enterprise contract, you will receive a notification indicating the practicalities to access our support.
fr: En souscrivant ou en renouvelant votre contrat WAPT Enterprise, vous recevrez une notification indiquant les modalités à suivre pour accéder à notre support.

source: The support concerns only the use in your Organization of the WAPT Enterprise software; additional support for adapting, personalizing, debugging or creating WAPT packages may be obtained with prepaid support tickets.
fr: L'assistance concerne uniquement le support sur le logiciel WAPT ; l'assistance pour l'adaptation, la personnalisation, la création de paquets WAPT peut être souscrite en plus sous forme de tickets d'assistance prépayés.

source: Up to two individuals in your Organisation may communicate with our direct support.
fr: Jusqu'à deux personnes désignées dans votre organisation peuvent être inscrites pour communiquer avec notre support direct.

source: Price and preferential access to WAPT training
fr: Prix et accès préférentiels à la formation WAPT

source: You may choose to train your IT team on any particularity of WAPT.
fr: Vous pouvez choisir de former votre équipe informatique sur n'importe quel aspect de WAPT.

source: WAPT Enterprise subscribers benefit from a privileged access to Tranquil IT's training advisers and a 50% discount on standard training prices.
fr: Les abonnés Entreprise bénéficient d'un accès privilégié aux conseillers en formation de Tranquil IT et d'une remise de 50 % par rapport aux tarifs standard de formation.

source: Why does Tranquil IT display a 300 device limit for WAPT Community on her commercial documentation ?
fr: Pourquoi Tranquil IT affiche une limite à 300 postes pour WAPT Community dans ses brochures commerciales ?

source: Tranquil IT displays a 300 device limit on her commercial documentation for the WAPT Community version.
fr: Tranquil IT affiche une limite à 300 postes sur ses brochures commerciales pour la version Community de WAPT.

source: There is **no technical restriction to using the Community version**, it is available as free software.
fr: Il n'y a **aucune restriction technique quant à l'usage de la version Community**, elle est librement disponible.

source: Tranquil IT's philosophy regarding free software is to give back a little of what we took, so it is important to us to keep our original promise to give systems administrators a mean to deploy, maintain up-to-date and remove software and configurations on their installed base of Windows devices.
fr: Chez Tranquil IT, nous voulons rendre au logiciel libre un peu de ce que nous lui avons pris et donc nous tenons à respecter notre promesse de laisser en libre un mécanisme pour aider les administrateurs système à déployer, mettre à jour et supprimer des logiciels et des configurations sur un parc Windows.

source: What you will find in the WAPT Enterprise version are features that are designed to help administer large installed bases and we meet people in that situation daily.
fr: Ce que vous trouverez dans la version Enterprise, ce sont des choses destinées à faciliter l'exploitation de grands parcs et nous rencontrons de nombreuses personnes qui sont dans ce cas d'usage.

source: As a general rule, we have observed that advanced management needs start to be felt when the number of devices goes over 300-400 units.
fr: En règle générale, nous observons que les besoins avancés de gestion arrivent quand le parc dépasse 300-400 machines.
