Repository: dGs-/WAPT-Documentation
Catalog: source/locale/*/LC_MESSAGES/waptserver-backup.po
Languages: fr

source: Backing up the WAPT Server
fr: Sauvegarder et restaurer le serveur WAPT

source: backup, restore, server, WAPT, PostgreSQL, pg_dumpall, FastCopy, WinSCP, documentation
fr: Sauvegarder, Restaurer, serveur, WAPT, PostgreSQL, pg_dumpall, FastCopy, WinSCP

source: Backing up the WAPT Server on Linux
fr: Sauvegarder le serveur WAPT sur Linux

source: This procedure is valid for WAPT 1.5 and above.
fr: Cette procédure n'est valable que pour WAPT 1.5 et supérieure.

source: stop WAPT related services on the server;
fr: stopper les services liés à WAPT sur la machine ;

source: backup these directories using a backup tool (ex: :program:`rsync`, :program:`WInSCP`, etc..);
fr: sauvegarder les répertoires suivants à l'aide d'un outil de sauvegarde (ex : :program:`rsync` ou :program:`WinSCP`) ;

source: backup the PostgreSQL database using the :program:`pg_dumpall` utility (adapt filename with your requirements);
fr: sauvegarder la base PostgreSQL à l'aide de l'outil :program:`pg_dumpall` (adapter le nom du fichier et la date) ;

source: restart WAPT related services on the server;
fr: relancer les services liés à WAPT sur la machine ;

source: Restoring the WAPT Server on Linux
fr: Restaurer le serveur WAPT sur Linux

source: In case of a complete crash, restart a standard WAPT Server installation on a Linux server.
fr: En cas de crash, relancer une installation standard du serveur WAPT pour Linux.

source: restore the following directories:
fr: restaurer les répertoires :

source: restore the database (adapt the name of your file). The first command **deletes** the WAPT database (if it exists). Make sure that your dump file is correct before deleting!
fr: restaurer la base de données (adapter votre nom de fichier). La première commande **supprime** ci-dessous la base WAPT (si elle existe), vérifier que votre dump est correct avant de la supprimer :

source: apply ownership rights to the restored folders:
fr: appliquer les droits sur les répertoires restaurés :

source: scan package repositories;
fr: scanner les répertoires de paquets :

source: Backing up the WAPT Server on Windows
fr: Sauvegarder le serveur WAPT sur Windows

source: Obsolete in WAPT 1.5
fr: Obsolète pour WAPT 1.5

source: backup the WAPT root folder :file:`C:\Program Files (x86)\wapt` on a remote backup destination;
fr: sauvegarder le dossier WAPT racine :file:`C:\Program Files (x86)\wapt` sur un support externe :

source: **Exemple**: backup on an external hard disk drive :file:`W:`
fr: **Exemple** : sauvegarde sur un disque externe :file:`W:`

source: We advise you to use :program:`FastCopy` software, available on `Tranquil IT repository <https://store.wapt.fr/>`_:
fr: Nous vous conseillons d'utiliser le paquet :program:`FastCopy` disponible sur le `store Tranquil IT <https://store.wapt.fr/>`_:

source: Using the GUI interface of :program:`FastCopy`, make sure to check the :guilabel:`ACL` checkbox.
fr: Avec le logiciel :program:`FastCopy` en interface graphique, veillez à bien cocher la case :guilabel:`ACL`.

source: Restoring the WAPT Server on Windows
fr: Restaurer le serveur WAPT sur Windows
