Repository: dGs-/WAPT-Documentation
Catalog: source/locale/*/LC_MESSAGES/wapt-roadmap.po
Languages: fr

source: History and roadmap
fr: Histoire et Roadmap

source: cleaning and stabilisation of console code;
fr: nettoyage et stabilisation du code de la console ;

source: transfer of :program:`waptservice` local service from :program:`Lazarus` to :program:`Python`;
fr: passage du waptservice local sur le poste de Lazarus à Python ;

source: addition of firewall rules to allow access to :program:`waptservice` from :program:`waptserver`;
fr: gestion de l'ouverture de port sur le firewall windows pour l'accès au :program:`waptservice` depuis le :program:`waptserveur` ;

source: display wapt package update status in wapt console;
fr: affichage de l'état de mise à jour des paquets wapt sur les postes dans la console ;

source: possibility to import packages from TIS repository and adding them to local repository;
fr: possibilité de récupérer un paquet depuis le dépôt TIS et de l'intégrer au dépôt local ;

source: build system embryo;
fr: embryon du système de build ;

source: after :program:`waptsetup` customization build in :program:`waptconsole`, possibility to upload it directly from :program:`waptconsole`;
fr: après la création du :program:`waptsetup` customisé dans la :program:`waptconsole`, possibilité de l'uploader directement depuis la :program:`waptconsole` ;

source: Windows :program:`waptserver` packaging;
fr: packaging du waptserver sous Windows ;

source: Windows postconfiguration tool to ease server installation;
fr: création d'un outil de postconfiguration sous Windows pour faciliter l'installation ;

source: transition to https for all connexions;
fr: passage en https pour toutes les connexions ;

source: possibility to ask remote package removal;
fr: possibilité de demander la suppression d'un paquet sur une machine ;

source: improving error feedbacks;
fr: améliorer les retours d'erreur ;

source: display package description when selecting in the WAPT console;
fr: affichage de la description du paquet lorsqu'on le sélectionne dans les listes dans waptconsole ;

source: host identification through computer account thanks to Kerberos (inactive by default);
fr: identification de la machine à travers le compte Machine grâce à kerberos (pas configuré par défaut) ;

source: waptselfservice group to delegates installation group;
fr: gestion du groupe de waptselfservice pour déléguer des droits d'installation ;

source: possibility to push :program:`waptagent` installation on a host through MS-RPC (if firewall allows it);
fr: possibilité de pousser une installation waptsetup sur un poste à travers les MS-RPC (si le firewall ne le bloque pas) ;

source: WAPT 1.0 Community (févier 2015)
fr: WAPT 1.0 Community (février 2015)

source: The release of that milestone has been announced at `Bruxelles FOSDEM the 1st of February 2015 <https://fosdem.org/2015/schedule/event/wapt_apt_get_for_windows/>`_.
fr: La release de cette milestone a été annoncée lors de la `conférence FOSDEM à Bruxelles le dimanche 1er février 2015 <https://fosdem.org/2015/schedule/event/wapt_apt_get_for_windows/>`_.

source: internationalization of the console, service, server and notification messages;
fr: internationalisation de la console, du service, du serveur et des messages de notification ;

source: scenari documentation;
fr: mise en place de documenation scénari ;

source: addition of icon for packages for a better rendering on wapt website store.wapt.fr;
fr: rajout de l'icône de l'application dans le paquet wapt pour un affichage plus joli sur le site web wapt.tranquil.it ;

source: windows installer improvements to avoid conflicts during installation (open ports check, etc.);
fr: installeur Windows plus précautionneux pour éviter des conflits lors de l'installation (vérification des ouvertures de ports, etc.) ;

source: bug correction with obscure network specificities;
fr: correction extensive de bug obscures lié à des spécificités d'installation et de réseau;

source: :program:`builbot` continuous building process;
fr: mise en place d'un système de build automatique buildbot ;

source: several bugs and anomalies have been corrected on 1.0.0 version thanks to feedback from users;
fr: correction de plusieurs anomalies gênantes portées à notre connaissance par des utilisateurs de la 1.0.0 ;

source: display of reachability of hosts in the WAPT console;
fr: affichage de l'état joignable d'une machine (machine éteinte / allumée) ;

source: integration of the authentication of local service in Windows Active Directory or Samba-AD;
fr: intégration de l'authentification du service local dans le domaine Microsoft Active Directory ou Samba4-AD ;

source: adding of a integrated agent building wizard in the WAPT console;
fr: ajout d'un wizard de création de paquets intégrés à la console WAPT ;

source: role segregation between :term:`Package Developers` and :term:`Package Deployers`;
fr: différenciation des rôles entre les :term:`Développeurs de Paquets` et les :term:`Déployeurs de Paquets` ;

source: replacement of :program:`MongoDB` by :program:`PostgreSQL` with JSON extension;
fr: passage du serveur à PostgreSQL avec les extensions JSON en remplacement de MongoDB ;

source: Websockets implementation;
fr: passage en Websocket ;

source: host identification through a shared secret for workgroup hosts that cannot access MSAD or Samba-AD domain;
fr: option d'identification de la machine à travers un secret partagé en mode fallback pour les postes non intégrés au domaine, ou bien ne pouvant accéder au serveur Active Directory ou Samba-AD ;

source: The features and functionalities described in the section are only relevant to the **Enterprise** version of WAPT.
fr: Les fonctionnalités décrites dans cette section concernent la version **Enterprise** de WAPT.

source: management by Organisational Units (Machine OU);
fr: gestion par Unité organisationelle (OU Machine) ;

source: taking into account of the Certificate Authority for signing packages, in addition to individual certificates;
fr: prise en compte de certificat d'autorité pour la signature de paquets, en plus des certificats individuels ;

source: kerberos based SSO authentication of :term:`Administrators` in the WAPT console;
fr: authentification Kerberos de l':term:`Administrateur` sur la console WAPT ;

source: WAPT 1.6 (August 2018)
fr: WAPT 1.6 (Août 2018)

source: recurring audit function to insure configurations are maintained over time (**Enterprise**);
fr: fonction d'audit périodique de la conformité du poste / référentiel des paquets (**Enterprise**) ;

source: (tech preview) Windows Update management in WAPT, reproducing WSUS functionnalities (**Enterprise**);
fr: (tech preview) gestion des mises à jour OS dans WAPT reproduisant le fonctionnement d'un WSUS (**Enterprise**) ;

source: authentication by certificate of the WAPT client when accessing a repository or connecting to the WAPT Server (inventory, websockets);
fr: authentification du client WAPT par certificat pour l'accès aux dépôts de paquets, et pour les connexions vers le serveur (inventaire, websockets) ;

source: customizable WAPT reporting integrated within the WAPT console (**Enterprise**);
fr: reporting personnalisable intégré à console WAPT (**Enterprise**) ;

source: discrimination between user self-service packages and restricted packages that may be installed only by :term:`Administrators` (**Enterprise**);
fr: différentiation entre les paquets accessibles en selfservice utilisateur et les paquets disponibles uniquement pour déploiement par les :term:`Administrateurs` (**Enterprise**) ;

source: global updates according to the package's criticity level (**Enterprise**);
fr: mises à jour globales différenciées suivant la criticité des paquets (**Enterprise**) :

source: immediate upgrade for critical updates;
fr: immédiate pour les mises à jour critiques ;

source: with the user accepting the upgrade if it impacts the user's current activities;
fr: avec acceptation de l'utilisateur pour les autres si les process impactés sont lancés ;

source: software and configuration management using AD Organizational Units (*unit* packages) (**Enterprise**);
fr: gestion par Unités Organisationnelles (paquets *unit*) (**Enterprise**) ;

source: Client agent for Linux Debian, Linux CentOS, Ubuntu and Apple macOS
fr: Agent WAPT pour Linux Debian, Linux CentOS, Ubuntu et Apple MacOS

source: Built-in WAPT packages repository replication
fr: Réplication de paquets WAPT entre dépôts intégrée

source: Built-in repository selection rules
fr: Règles de sélection des dépôts intégrées

source: Later
fr: Plus tard

source: creation of the :abbr:`GPO (Group Policy Object)` for deploying the WAPT agent directly from the WAPT console (**Enterprise**);
fr: création de la :abbr:`GPO (Group Policy Object)` de déploiement du waptsetup.exe directement à partir de la waptconsole (**Enterprise**) ;

source: signature of packages and actions, and token based authentication on the WAPT console (**Enterprise**);
fr: signature des paquets et actions, et authentification sur la console par token physique (**Enterprise**) ;

source: integration of inventory in GLPI and other asset management tools (**Community** and **Enterprise**);
fr: module d'intégration GLPI pour la gestion administrative / comptable de l'inventaire et la gestion d'incident (**Community** et **Enterprise**) ;

source: asset management from the WAPT console (**Enterprise**);
fr: gestion des licences directement dans la console WAPT (**Enterprise**) ;

source: kerberos based SSO authentication of the :term:`Users` on the :program:`webservice` (**Enterprise**);
fr: authentification SSO de l':term:`Utilisateur` sur le webservice (**Enterprise**) ;

source: creation of *stub* packages to avoid licensing problems for some proprietary software. The :term:`Package Developer` would download the package from a trusted public repository, then he would download the software binaries from the editor's website to obtain a complete package. This will facilitate the creation of packages embedding software with restricted distribution rights (**Enterprise**);
fr: gestion de paquet "stub" pour les logiciels propriétaires (l':term:`Administrateur` téléchargera le paquet à partir d'une source publique, puis chargera les exécutables d'installation dans le paquet pour obtenir un paquet complet). Cela permet la création facilitée de paquets sans enfreindre les règles de rediffusion d'applications imposées par certains éditeurs logiciels (**Enterprise**) ;
