Repository: dGs-/WAPT-Documentation
Catalog: source/locale/*/LC_MESSAGES/wapt-configuration/wapt-certificate/index.po
Languages: fr

source: Generating the Administrator's certificate for signing WAPT packages
fr: Générer le certificat de l'Administrateur pour signer les paquets

source: wapt-private.pem, wapt-private.crt, signer, certificate documentation
fr: wapt-private.pem, wapt-private.crt, signer, certificat, WAPT, documentation

source: Naming conventions
fr: Hypothèse de cette documentation

source: name of the private key: :file:`wapt-private.pem`;
fr: le nom de la clé privée est :file:`wapt-private.pem` ;

source: public certificate signed with private key: :file:`wapt-private.crt`;
fr: certificat public signé avec le fichier de la clé privée :file:`wapt-private.crt` ;

source: Private key *wapt-private.pem*
fr: La clé privée *wapt-private.pem*

source: The :file:`wapt-private.pem` file is fundamental for security. It must be stored in a safe place and correctly protected.
fr: Le fichier :file:`wapt-private.pem` que nous allons générer est d'une importance **fondamentale**. Il doit être conservé en lieu sûr et correctement protégé.

source: The :file:`wapt-private.pem` file is the private key, it is located by default in the :file:`C:\private` folder of the :term:`Administrator` workstation.
fr: Le fichier :file:`wapt-private.pem` est la clé privée, elle est générée puis copiée par défaut dans le dossier :file:`C:\private` du poste de l\':term:`Administrateur`.

source: For better security this private key may be transfered on an external storage. A smartcard support is in the roadmap.
fr: Pour plus de sûreté, la clé privée peut être transférée sur un support externe sécurisé.

source: This private key will be used along with the certificate to sign packages before uploading them onto the WAPT repository.
fr: Elle servira, en pointant sur le certificat, à signer les paquets WAPT avant de les envoyer sur le dépôt.

source: public certificate signed with private key: :file:`wapt-private.crt`
fr: Le certificat public *wapt-private.crt*

source: The :file:`wapt-private.crt` file is the public certificate that is used along with the private key. It is by default created in the :file:`C:\private` folder, copied in :file:`C:\Program Files (x86)\wapt\ssl` of the Administrator and deployed on the desktops managed by the Administrator via WAPT agent or a GPO.
fr: Le fichier :file:`wapt-private.crt` est le certificat public issu de la clé privée, il est copié dans les dossiers :file:`C:\private` et :file:`C:\\Program Files (x86)\wapt\ssl` de tous les postes équipés de WAPT.

source: This certificate is used to validate the signature of packages before installation.
fr: Ce certificat sert à valider la signature des paquets avant leur installation.

source: Creating a certificate
fr: Générer le certificat

source: In the WAPT console go to :menuselection:`Tools --> Create a certificate`;
fr: Dans la console WAPT aller dans :menuselection:`Outils --> Créer un certificat` ;

source: Creating a self-signed certificate
fr: Générer un certificat auto-signé

source: We have two different options:
fr: A partir d'ici, deux cas possibles :

source: :ref:`create a certificate for the Community version <create_certificate_community>`;
fr: :ref:`créer un certificat pour la version WAPT Community <create_certificate_community>` ;

source: :ref:`create a certificate for the Enterprise version <create_certificate_enterprise>`;
fr: :ref:`créer des certificats pour la version WAPT Enterprise <create_certificate_enterprise>` ;

source: Creating a certificate - WAPT Community
fr: Générer le certificat - WAPT Community

source: fill in the following fields:
fr: renseigner les champs suivants :

source: click on :guilabel:`OK` to go on to the next step;
fr: cliquer sur :guilabel:`OK` pour passer à l'étape suivante ;

source: Required informations are:
fr: Les informations à renseigner sont :

source: :guilabel:`Destination folder`: folder where the private key and the public certificate will be stored: **required**;
fr: :guilabel:`Répertoire de destination` où seront sauvegardés la clé privée et le certificat public : **obligatoire** ;

source: :guilabel:`Name of the private key`: name of the :file:`.pem` and :guilabel:`Name of the private key`;
fr: :guilabel:`Nom de la clé` donné aux fichiers :file:`.pem` et :file:`.crt` ;

source: :guilabel:`Private key password`: password for locking and unlocking the key: **required**;
fr: :guilabel:`Mot de passe de la clé` pour vérouiller la clé : **obligatoire** ;

source: :guilabel:`Common Name (CN)`: name of the Administrator: **required**;
fr: :guilabel:`Common Name (CN)` pour identifier formellement le signataire : **obligatoire** ;

source: :guilabel:`Certificate name`: name of the :file:`.crt` certificate: **required**;
fr: :guilabel:`Certificate Name` donné au certificat :file:`.crt` : **obligatoire** ;

source: :guilabel:`Additional informations`: additional details stored in the private key. These informations will help with identifying the origin of the WAPT package: **optional**;
fr: :guilabel:`Informations optionnelles` stockées dans la clé privée. Ces informations permettront aux destinataires d'un paquet WAPT de connaître son origine.

source: For a fresh install, you can follow the screenshot below.
fr: Pour une première installation, vous pouvez suivre l'exemple de la capture d'écran.

source: The password complexity must comply with your :term:`Organization`'s security requirements (eg. :term:`ANSSI` passwords recommendations).
fr: Le mot de passe de la clé privée doit être choisi en conformité avec les préconisations en vigueur dans votre :term:`Organisation` (par exemple les recommandations :term:`ANSSI`).

source: the path to your private key must not be in the installation path of WAPT (:file:`C:\Program Files (x86)\wapt`);
fr: le répertoire de destination de la clé privée ne doit pas être le dossier d'installation de WAPT (:file:`C:\Program Files (x86)\wapt`) ;

source: if your key is stored in :file:`C:\Program Files (x86)\wapt`, your :term:`Administrator` private key will be deployed on your clients, **absolutely a no go!**
fr: si votre clé est stockée dans :file:`C:\Program Files (x86)\wapt`, votre clé privée d\':term:`Administrateur` sera déployée sur vos clients, **absolument à ne pas faire !**

source: Confirmation of the copy of the certificate in the ssl folder
fr: Confirmation de copie dans le répertoire ssl

source: click on :guilabel:`Yes` to copy the newly generated certificate in the :file:`C:\Program Files (x86)\wapt\ssl` folder. This certificate will be picked up during the compilation of the WAPT agent and deployed on the client computers.
fr: cliquer sur :guilabel:`Oui` pour valider la copie du certificat dans le dossier :file:`C:\Program Files (x86)\wapt\ssl`. Cela autorisera cette clé pour votre agent WAPT.

source: If everything has gone well the following message will appear:
fr: Lorsque tout s'est bien déroulé le message suivant apparaît :

source: Certificate generated successfully
fr: Réussite de la génération du certificat

source: You may go on to the next step and :ref:`configure your WAPT console <wapt_console_config>`!!
fr: Vous pouvez maintenant passer à l'étape suivante et :ref:`configurer votre console WAPT <wapt_console_config>` !!

source: Creating a certificate - WAPT Enterprise
fr: Générer le certificat - WAPT Enterprise

source: With WAPT Enterprise, you can create a Master key with a Certificate Authority flag that can both sign packages and sign new certificates.
fr: En version WAPT Enterprise, créer une clé "Master" capable de signer des paquets logiciels et également de signer d'autres certificats (CA).

source: In order to create new signed certificates for delegated, please refer to :ref:`new_crt_with_ca`.
fr: Vous pourrez par la suite suivre la documentation pour :ref:`créer des certificats avec des droit limités <new_crt_with_ca>`.

source: :guilabel:`Name of the private key`: name of the :file:`.pem` and :guilabel:`Name of the private key`: name of the :file:`.pem` and :file:`.crt` files: **required**;
fr: :guilabel:`Nom de la clé` donné aux fichiers :file:`.pem` et :file:`.crt` : **obligatoire** ;

source: :guilabel:`Code signing`: check this box if the certificate/ key pair will be allowed to sign software packages: **required**;
fr: :guilabel:`Code Signing` si le certificat sera utilisé pour signer des paquets logiciels : **obligatoire** ;

source: :guilabel:`CA certificate`: check this box if this certificate can be used to sign other certificates (main or intermediate Certificate Authority): **required**;
fr: :guilabel:`Certificat CA` si la clé associée au certificat pourra signer d'autres certificats ;

source: If your Organization is already equipped with an :term:`Certificate Authority` (CA), you will have to fill the certificate and the key in the fields :guilabel:`CA Certificate` et :guilabel:`CA Key`.
fr: Si votre Organisation est déjà équipée d'une :term:`Autorité de Certification` (CA), il faudra renseigner le certificat ainsi que la clé dans les champs :guilabel:`Certificat de la CA` et :guilabel:`Clé de la CA`.

source: With this procedure you can generate new certificate/ key pairs with or without **Code Signing** capability.
fr: Cette étape sera utile lorsque vous souhaiterez générer une nouvelle paire de clé de type *Code Signing* ou de type *Non Code Signing*.

source: the path to your private key must not be in the installation path of WAPT (:file:`C:\Program Files (x86)\wapt` );
fr: le répertoire de destination de la clé privée ne doit pas être le dossier d'installation de WAPT (:file:`C:\Program Files (x86)\wapt`) ;

source: if your key is stored in :file:`C:\Program Files (x86)\wapt` , your Administrator private key will be deployed on your clients, **absolutely a no go!**
fr: si votre clé est stockée dans :file:`C:\Program Files (x86)\wapt`, vous risqueriez de déployer votre clé privée sur le réseau lors de la création de l'agent WAPT, **absolument à ne pas faire!**

source: click on :guilabel:`Yes` to copy the newly generated certificate in the :file:`C:\Program Files (x86)\wapt\ssl` folder. This certificate will be picked up during the compilation of the WAPT agent and deployed on the client computers;
fr: cliquer sur :guilabel:`Oui` pour valider la copie du certificat dans le dossier :file:`C:\Program Files (x86)\wapt\ssl`. Ce certificat sera récupéré lors de la compilation de l'agent WAPT et déployé sur les machines de votre parc ;

source: You may go on to the next step and :ref:`configure your WAPT console <wapt_console_config>`.
fr: Vous pouvez maintenant passer à l'étape suivante et :ref:`configurer votre console WAPT <wapt_console_config>`.
