Repository: dGs-/WAPT-Documentation
Catalog: source/locale/*/LC_MESSAGES/wapt-create-packages/envdev/index.po
Languages: fr

source: Setting up your WAPT development and test environment
fr: Créer son environment de développement de paquets WAPT

source: setup.py, WAPT, control, icon.png, certificate.crt, manifest.sha256, signature.sha256, wapt.psproj, package identity, identification, documentation
fr: setup.py, WAPT, control, icon.png, certificate.crt, manifest.sha256, signature.sha256, wapt.psproj, fiche d'identité, documentation

source: Prerequisites
fr: Pré-requis

source: it is **required** to be a :term:`Local Administrator` of the machine to use WAPT's integrated environment for developing WAPT packages;
fr: il est **impératif** d'être en possession d'un compte :term:`Administrateur Local` de la machine pour cette opération ;

source: we advise you to create/ edit packages in a fully controlled environment that is safe and *disposable*;
fr: nous vous conseillons de créer / éditer vos paquets dans un environment maîtrisé, sain et *jetable* ;

source: the usage of a disposable virtual machine (like Virtualbox) is recommended;
fr: l'utilisation d'une machine virtuelle autonome (type Virtualbox ou équivalent) est vivement recommandée ;

source: Make sure that you have your private key stored on the development computer
fr: Vérifier la présence de la clé privée sur le poste de développement

source: In the WAPT console, the fields *private key* and *prefix* must be filled.
fr: Dans la console, les champs *clé privé* et *prefix* doivent être renseignés.

source: Install the *tis-pyscripter* WAPT package
fr: Installer le paquet *tis-pyscripter*

source: import the *tis-pyscripter* package in your local repository and install it on your development computer;
fr: importer le paquet *tis-pyscripter* dans votre dépôt local et l'installer sur votre machine de développement ;

source: Recommendations regarding the test environment
fr: Préconisations concernant l'environment de test

source: The recommended method to correctly test your WAPT packages is to use a representative sample of machines in your inventory. So the more heterogeneous your installed base of machines, the larger your sample must be.
fr: La méthode préconnisée pour tester correctement vos paquets est d'utiliser un échantillon de machines représentatif de votre parc. Donc plus votre parc est hétérogène, plus votre échantillon devra être large.

source: This method consists of testing the installation of the package on as many plateforms and configurations as possible, so to improve its reliability, before the WAPT package is transfered to production repositories.
fr: Cette démarche vise à confronter le paquet à une multitude de plateformes et d'environments afin qu'il devienne le plus abouti possible en régime de test, avant d'être basculé en production.

source: Testing method
fr: Démarche de test

source: Operating systems and architectures
fr: Systèmes d'exploitation et architectures

source: Windows Server 2012 and R2;
fr: Windows Server 2012 ;

source: Physical and virtual machines;
fr: Machine physique et virtuelle ;

source: laptops;
fr: PC portable ;

source: When possible, RC and Beta version of Operating Systems should be tested (ex: Windows 10 Creators Update).
fr: On testera si possible les versions RC / Beta des OS si elles sont disponibles (exemple : Windows 10 Creators Update).

source: State of Windows Updates
fr: État des mises à jour Windows Update

source: **Microsoft Windows machine without any Windows update installed**: the objective is to detect Windows updates that are required for the software to work properly and to adapt the WAPT package accordingly;
fr: **Poste Microsoft Windows sans aucune mise à jour Windows Update** : l'objectif est de détecter les mises à jour indispensables au bon fonctionnement du logiciel et adapter le paquet en conséquence ;

source: **Microsoft Windows machine with all the latest Windows updates**: the objective is to detect Windows updates that break the package and to adapt the WAPT package accordingly;
fr: **Poste Microsoft Windows à jour avec les toutes dernières MàJ Windows Update** : l'objectif est de détecter les mise à jour en conflit avec le logiciel et d'adapter le paquet en conséquence ;

source: State of software installations
fr: État des installations logicielles

source: **Machines with many installed packages**: the objective is to detect a possible dependency with an existing application;
fr: **Poste avec peu de logiciels déjà installés** : l'objectif est de détecter une dépendance possible à Java ou autre framework applicatif ;

source: **Machines with many installed packages**: the objective is to detect a possible conflict with an existing application;
fr: **Poste avec beaucoup de logiciels déjà installés** : l'objectif est de détecter un conflit avec une application existante ;

source: **Install older versions of the software**: it is possible that the software installer does not support uninstalling a previous version of the software, in this case, the WAPT package will have to remove older versions of the software before installing the new version;
fr: **Installer les anciennes versions du logiciel** : il est possible que l'installeur ne supporte pas l'écrasement d'une installation précédente, dans ce cas il faudra prévoir la désinstallation des anciennes versions avant d'installer la nouvelle version ;
