Repository: dGs-/WAPT-Documentation
Catalog: source/locale/*/LC_MESSAGES/wapt-common-problems/common-mistakes.po
Languages: fr

source: Common mistakes
fr: Erreurs courantes

source: WAPT, documentation, mistakes
fr: WAPT, documentation, erreurs

source: Using a network drive to store and deliver WAPT packages
fr: Utiliser un lecteur réseau pour stocker et livrer des paquets WAPT

source: The standard way WAPT works is with a secure web server delivering WAPT packages to the WAPT Clients.
fr: Le mode de fonctionnement standard de WAPT est avec un serveur Web sécurisé qui fournit les paquets WAPT aux clients WAPT.

source: **Tranquil IT advises against using a network drive for delivering WAPT packages** for several reasons:
fr: **Tranquil IT déconseille l'utilisation d'un lecteur réseau pour la livraison de paquets WAPT** pour plusieurs raisons :

source: a web server is extremely easy to setup, secure, maintain, backup and monitor;
fr: un serveur web est extrêmement facile à installer, à sécuriser, à maintenir, à sauvegarder et à surveiller ;

source: to work correctly, a WAPT package needs to be self-contained. Indeed, we do not know if the network will be available at the time of the installation launch (for example if we have a waptexit that starts when the workstation is shutting down on a network with 802.1x user authentication, there will no longer be a network available at the time of installation). The self-contained nature of WAPT makes it more deterministic than other deployment solutions;
fr: pour fonctionner correctement, un paquet WAPT doit être autonome. En effet, nous ne savons pas si le réseau sera disponible au moment du lancement de l'installation (par exemple si nous avons un waptexit qui démarre lorsque la station de travail s'arrête sur un réseau avec une authentification utilisateur 802.1x, il n'y aura plus de réseau disponible au moment de l'installation). La nature autonome du WAPT le rend plus déterministe que les autres solutions de déploiement ;

source: network congestion may result from downloading large packages on large fleets of devices because you have less control over bandwidth rates or you may not be able to finish a partial download;
fr: une congestion du réseau peut résulter du téléchargement de gros paquets sur de grandes flottes d'appareils parce que vous avez moins de contrôle sur la consommation de bande passante ou bien vous ne pouvez pas terminer un téléchargement partiel ;

source: this method breaks or at least weakens the security framework of WAPT;
fr: cette méthode casse ou au moins affaiblit le cadre de sécurité du WAPT ;

source: this method does not allow you to expose your repositories to internet for your traveling personnel;
fr: cette méthode ne vous permet pas d'exposer vos dépôts sur Internet pour votre personnel itinérant ;

source: Even though WAPT *can work* independently of the transport mode, **Tranquil IT will not officially support using a network drive to store and deliver WAPT packages**.
fr: Même si WAPT *peut fonctionner* indépendamment du mode de transport, **Tranquil IT ne supportera pas officiellement l'utilisation d'un lecteur réseau pour stocker et livrer des paquets WAPT**.

source: Using the register() function in your audit scripts
fr: Utiliser la fonction register() dans vos scripts d'audit

source: The register() function forces the sending to the WAPT server of the WAPT agent's hardware and software inventory.
fr: La fonction register() force l'envoi au serveur WAPT de l'inventaire matériel et logiciel de l'agent WAPT.

source: This function is very taxing on the server's performance because it forces the server to parse a relatively large :abbr:`JSON (Java Script Object Notation)` :abbr:`BLOB (Binary Large OBject)` and to inject the result into the PostgreSQL database.
fr: Cette fonction est très éprouvante pour les performances du serveur car elle oblige le serveur à analyser un :abbr:`JSON (Java Script Object Notation)` :abbr:`BLOB (Binary Large OBject)` relativement grand et à injecter le résultat dans la base de données PostgreSQL.

source: The function is by default triggered manually or when a new package upgrade is applied.
fr: La fonction est par défaut déclenchée manuellement ou lorsqu'une nouvelle mise à niveau de paquet est appliquée.

source: When you use the register() function in an audit script, it will run every time the audit script is triggered and load the server with no apparent benefit.
fr: Lorsque vous utilisez la fonction register() dans un script d'audit, elle sera exécutée à chaque fois que le script d'audit est déclenché et chargera le serveur sans bénéfice apparent.

source: Therefore, **we do not recommend the use of the register() function in audit scripts**.
fr: Par conséquent, **nous ne recommandons pas l'utilisation de la fonction register() dans les scripts d'audit**.
