Repository: dGs-/WAPT-Documentation
Catalog: source/locale/*/LC_MESSAGES/wapt_server_install/centos/install_centos_*.po
Languages: fr

source: Configuring the CentOS / RedHat server
fr: Préparer le serveur CentOS / RedHat

source: Configuring the CentOS/ RedHat server
fr: Préparer le serveur CentOS / RedHat

source: In order to install a fresh CentOS7 machine (virtual or physical) without graphical interface (choose **minimal** installation), please refer to official `CentOS documentation <https://www.centos.org/docs/>`_. This documentation is also valid for Redhat7 initial installation.
fr: Pour installer une CentOS7 neuve (machine physique ou virtuelle) sans interface graphique (installation de type **minimale**), référez vous à la documentation officielle : https://www.centos.org/docs/. Cette documentation est aussi valable pour une machine RedHat7.

source: Configuring network parameters
fr: Configurer les paramètres réseau

source: The different parameters presented below are not specific to WAPT; you may adapt them as required for your environment.
fr: Les différents paramètres présentés ci-dessous ne sont pas spécifiques au WAPT ; vous pouvez les adapter en fonction de votre environnement.

source: Modify the following files in order to get a proper naming (:term:`FQDN`) and network addressing strategy.
fr: Modifier les fichiers suivant afin d'obtenir une configuration de nommage (:term:`FQDN`) et réseau correcte (adressage IP fixe).

source: In the following example:
fr: Dans l'exemple suivant :

source: the :term:`FQDN` name is *srvwapt.mydomain.lan*;
fr: le nom :term:`FQDN` est : *srvwapt.mydomain.lan* ;

source: the short-name of the WAPT Server is *srvwapt*;
fr: le nom du serveur WAPT est *srvwapt* ;

source: the :term:`DNS` suffix is *mydomain.lan*;
fr: le suffixe :term:`DNS` est *mydomain.lan* ;

source: the IP address is *10.0.0.10/24*;
fr: l'adresse IP est *10.0.0.10/24* ;

source: Configuring the name of WAPT Server
fr: Configurer le nom du serveur

source: The short name of the WAPT Server must not be longer than 15 characters (the limit is due to sAMAccountName restriction in Active Directory).
fr: Le nom de du serveur WAPT ne doit pas dépasser 15 caractères (limite liée au sAMAccountName dans Active Directory).

source: The name of the WAPT Server must be a :abbr:`FQDN (Fully Qualified Domain Name)`, that is to say it has both the server name and the DNS suffix.
fr: Le nom du serveur doit être un nom :abbr:`FQDN (Fully Qualified Domain Name)`, c'est à dire à la fois le nom de machine et le suffixe DNS.

source: modify the :file:`/etc/hostname` file and write the :term:`FQDN` of the server;
fr: modifier le fichier :file:`/etc/hostname` et y renseigner le nom :term:`FQDN` du serveur ;

source: configure the :file:`/etc/hosts` file, be sure to put both the :term:`FQDN` and the short name of the server;
fr: configurer le fichier :file:`/etc/hosts`, renseigner le nom :term:`FQDN` et court du serveur.

source: on the line defining the DNS server IP address, be sure to have the IP of the server (not 127.0.0.1), then the :term:`FQDN`, then the short name;
fr: sur la ligne correspondant à l'adresse IP du serveur WAPT mettre d'abord le nom :term:`FQDN`, puis ensuite le nom court ;

source: do not change the line with :file:`localhost`;
fr: ne pas modifier les lignes contenant le terme :file:`localhost` ;

source: Configuring the IP address of the WAPT Server
fr: Configurer l'adresse IP du serveur WAPT

source: modify the :file:`/etc/sysconfig/network-scripts/ifcfg-eth0` file and define a static IP address. The name of the file can be different, like :file:`ifcfg-ens0` for example;
fr: modifier le fichier :file:`/etc/sysconfig/network-scripts/ifcfg-eth0` et définir une adresse IP statique. Le nom du fichier peut être différent, par exemple :file:`ifcfg-ens0` ;

source: apply the network configuration by rebooting the machine with a :code:`reboot`;
fr: appliquer la configuration réseau en redémarrant la machine avec :code:`reboot` ;

source: if it has not already be done, create the DNS entry for the WAPT Server in the :term:`Organization` Active Directory;
fr: si ce n'est pas déjà fait, créer l'entrée DNS du serveur dans l'Active Directory de l':term:`Organisation` ;

source: after reboot, configure the system language in English in order to have non-localized logs for easier searching of common errors;
fr: après le redémarrage, configurer la langue du système en anglais afin de faciliter la recherche de problèmes dans les logs ;

source: check that the machine clock is on time (with NTP installed), and that SELinux and the firewall are enabled;
fr: vérifier que la machine est à l'heure (avec NTP installé), que SElinux et que le firewall sont activés ;

source: If the NTP package is not installed.
fr: Si le paquet NTP n'est pas installé

source: update CentOS7 and set up the :abbr:`EPEL (Extra Packages for Enterprise Linux)` repository;
fr: mettre à jour CentOS7 et installer le dépôt :abbr:`EPEL (Extra Packages for Enterprise Linux)` ;

source: You may no go on to the next step and :ref:`install WAPT on your CentOS/ RedHat <install_wapt_centos>`.
fr: Vous pouvez maintenant passer à l'étape suivante et :ref:`installer WAPT sur votre CentOS / RedHat <install_wapt_centos>`.
