Repository: dGs-/WAPT-Documentation
Catalog: source/locale/*/LC_MESSAGES/waptserver-install/windows/index.po
Languages: fr

source: Installing WAPT Server on Windows
fr: Installer WAPT sur Microsoft Windows

source: Server, WAPT, Windows, install, installation, documentation
fr: Server, WAPT, Windows, Install, documentation

source: The WAPT Server can not be installed on a computer with services already listening on ports 80 and 443 (example WSUS with IIS).
fr: le serveur WAPT ne peut pas être installé sur une machine qui écoute déjà sur le port 80 et 443 (exemple WSUS avec IIS) ;

source: ports 80, 443 and 8080 are used by the WAPT Server and must be available;
fr: les ports 80, 443 et 8080 sont utilisés par le serveur WAPT et doivent être disponibles ;

source: If ports 80 and 443 are already occupied by another web service, you should take a look at the documentation for :ref:`changing the default ports on Windows <windows_changing_port_80_443>`.
fr: si les port 80 et 443 sont déjà occupés par un autre service, vous pouvez suivre la documentation pour :ref:`changer les ports d'écoute <windows_changing_port_80_443>` ;

source: port 8088 is used on client machines by the WAPT agent and must be available;
fr: le port 8088 est utilisé sur les postes clients par l'agent WAPT et doit être disponible ;

source: The WAPT server **will not run** on a x86 version of Windows;
fr: WAPT Serveur n'est pas installable sur une version x86 de Windows ;

source: The installation of the WAPT server must be done using a **Local Administrator** account on the host;
fr: l'installation de WAPTServer doit être faite avec le compte **Administrateur Local** de la machine ;

source: **From WAPT Server 1.5 onward**, :program:`Nginx` is the **ONLY** supported web server. **Apache or IIS (with or without WSUS) are no longer supported in WAPT**.
fr: **À partir de la version WAPT 1.5**, le **SEUL** serveur web supporté est :program:`Nginx`. **Les serveurs web Apache ou IIS (notamment en cohabitation avec un WSUS sur les ports 80 et 443), ne sont plus supportés officiellement**.

source: In case of problems when installing WAPT, visit the :ref:`Frequently Asked Questions <wapt_faq>`.
fr: En cas de difficulté lors de l'installation de WAPT, visitez :ref:`les questions fréquentes <wapt_faq>`.

source: installing WAPT on a Linux server is the recommended method;
fr: l'installation de WAPT sur un serveur Linux est la méthode à privilégier ;

source: the WAPT Server may be installed on **64bit only** Windows 7, 8.1, 10 and Windows Server 2008/R2, 2012/R2, 2016 and 2019;
fr: le serveur WAPT peut s'installer sur Windows 7, 8.1, 10 et Windows Server 2008 et R2, 2012 et R2, 2016 et 2019 en **64bit uniquement** ;

source: download and execute `waptserversetup.exe <http://wapt.tranquil.it/wapt/releases/latest/waptserversetup.exe>`_;
fr: télécharger et exécuter `waptserversetup.exe <https://wapt.tranquil.it/wapt/releases/latest/waptserversetup.exe>`_ ;

source: choose the installation language;
fr: choisir la langue d'installation ;

source: Choose the language for WAPT
fr: Choisir la langue pour WAPT

source: accept the GNU Public License and click on :guilabel:`Next` to go on to the next step;
fr: accepter la licence GNU Public Licence et cliquer sur :guilabel:`Suivant` pour passer à l'étape suivante ;

source: Accept the WAPT license terms
fr: Accepter la licence pour le logiciel WAPT

source: choose the installation directory (leave the default) and click on :guilabel:`Next` to go on to the next step;
fr: choisir le répertoire d'installation (laisser par défaut) et cliquer sur :guilabel:`Suivant` pour passer à l'étape suivante ;

source: Choose the WAPT destination folder
fr: Choisir le dossier d'installation de WAPT

source: click on the :guilabel:`Install` to launch the installation, wait for the installation to complete, then click on :guilabel:`Finish` (leave default options);
fr: cliquer sur :guilabel:`Installer` pour passer à l'étape suivante ;

source: Progress of installation of the WAPT Server
fr: Progression de l'installation

source: Installation has finished
fr: Installation terminée

source: click on :guilabel:`Finished` to close the installer;
fr: cliquer sur :guilabel:`Terminé` pour terminer l'installation du serveur WAPT.

source: The WAPT Server on your Windows is ready.
fr: Le serveur WAPT sur Windows est prêt.
