Repository: dGs-/WAPT-Documentation
Catalog: source/locale/*/LC_MESSAGES/waptserver-update/index.po
Languages: fr

source: Upgrading the WAPT Server
fr: Mettre à jour le serveur WAPT

source: If your WAPT Server is a virtual machine, take a snapshot of the VM. This way, you'll be able to go back easily in the rare case that the update fails.
fr: Si votre serveur wapt est installé en machine virtuelle, faites un snapshot. Cela vous permettera de revenir facilement en arrière en cas d'échec de la mise à jour.

source: Before upgrading WAPT Server, please refer to the following upgrading compatibility chart :
fr: Avant de mettre à niveau le serveur WAPT, veuillez consulter le tableau de compatibilité de mise à niveau suivant :

source: To WAPT 1.5
fr: Vers WAPT 1.5

source: To WAPT 1.6
fr: Vers WAPT 1.6

source: To WAPT 1.7
fr: Vers WAPT 1.7

source: To WAPT 1.8
fr: Vers WAPT 1.8

source: From WAPT 1.3
fr: Depuis WAPT 1.3

source: :green:`Yes`
fr: :green:`Oui`

source: :red:`No`
fr: :red:`Non`

source: From WAPT 1.5
fr: Depuis WAPT 1.5

source: From WAPT 1.6
fr: Depuis WAPT 1.6

source: From WAPT 1.7
fr: Depuis WAPT 1.7

source: Upgrading from 1.6/1.7 to 1.8
fr: Mise à jour de 1.6/1.7 vers 1.8

source: The upgrade process follows the process for a minor update:
fr: La mise à jour s'effectue comme une mise à jour mineure.

source: :ref:`minor update for Debian <wapt_minor_upgrade_debian>`;
fr: :ref:`mise à jour mineure pour Debian <wapt_minor_upgrade_debian>`;

source: :ref:`minor update for CentOS <wapt_minor_upgrade_centos>`;
fr: :ref:`mise à jour mineure pour CentOS <wapt_minor_upgrade_centos>`;

source: :ref:`minor update for Windows <wapt_minor_upgrade_windows>`;
fr: :ref :`mise à jour mineure pour Windows <wapt_minor_upgrade_windows>` ;

source: Debian Jessie is now deprecated. **WAPT 1.8 will not work with old Debian version**;
fr: Debian Jessie est maintenant obsolète. **WAPT 1.8 ne fonctionnera pas avec cette ancienne version de Debian** ;

source: consider migrating your existing WAPT installation to Debian Buster or CentOS7;
fr: envisagez de migrer votre installation WAPT existante vers Debian Buster ou CentOS7 ;

source: Upgrading from 1.5 to 1.6
fr: Mise à jour de 1.5 vers 1.6

source: The upgrade process follows the process for a minor update.
fr: La mise à jour s'effectue comme une mise à jour mineure.

source: if you are in Debian Stretch, it is recommended to upgrade to Debian Buster 64 bits;
fr: si vous êtes sur Debian Jessie, il est recommandé de mettre à niveau vers Debian Buster 64 bits ;

source: this is **MANDATORY** for the **Enterprise** version with Windows Update support;
fr: ceci est **OBLIGATOIRE** pour la version **Enterprise** avec prise en charge des Windows Updates ;

source: when upgrading to Debian10, the PostgreSQL database must be upgraded;
fr: lors de la mise à jour vers Debian10, la base de données PostgreSQL doit être mise à jour ;

source: Upgrading from 1.3 to 1.6
fr: Mise à jour de 1.3 vers 1.6

source: The upgrade from 1.3 to 1.6 is a major upgrade.
fr: La mise à jour de la version 1.3 vers 1.6 est une mise à jour majeure.

source: Minor Upgrades
fr: Mise à jour mineure

source: This procedures concerns the classic method for upgrading the WAPT Server for minor versions, for exemple from 1.7.4 to 1.8.
fr: Cette procédure concerne la mise à jour classique du serveur WAPT pour les versions mineures, par exemple de 1.7.4 à 1.8.

source: The migration process includes:
fr: Le procédé de migration comprend :

source: the upgrading of the WAPT Server;
fr: la mise à jour du serveur WAPT ;

source: the upgrading of the WAPT console;
fr: la mise à jour de la console WAPT ;

source: the upgrading of the WAPT agent;
fr: la mise à jour de l'agent WAPT ;

source: the updating of the deployment GPO;
fr: la mise à jour de la GPO de déploiement ;

source: For upgrading from 1.3 to 1.6, please refer to :ref:`upgrading from 1.3 to 1.6 <upgrade_1.3_1.6>`.
fr: Pour la migration majeure WAPT 1.3 vers WAPT 1.6, suivez la documentation de :ref:`mise à jour majeure 1.3 vers 1.6 <upgrade_1.3_1.6>`.
