Repository: dGs-/WAPT-Documentation
Catalog: source/locale/*/LC_MESSAGES/wapt-create-packages/package-msi-gui/index.po
Languages: fr

source: Creating a package template from the WAPT console
fr: Créer un paquet WAPT depuis la console

source: msi, WAPT, advanced, complex, console, installing, installation, documentation
fr: msi, WAPT, evolués, complexes

source: To create WAPT packages directly from the WAPT console, it is necessary to have installed the WAPT development environment *tis-waptdev*.
fr: Pré-requis : Pour créer des paquets à partir de la console, il faut d'abord avoir installé l'environment de développement WAPT *tis-waptdev*.

source: In that example, we use the 7-zip MSI setup downloaded from the 7-zip official website.
fr: Dans cet exemple, l'installeur de 7zip est utilisé au format MSI.

source: download the 7-zip MSI installer:
fr: obtenir l'installeur MSI de 7zip ;

source: `download 7-zip MSI x64 <http://www.7-zip.org/a/7z1604-x64.msi>`_;
fr: `télécharger 7-zip MSI x64 <https://www.7-zip.org/a/7z1604-x64.msi>`_ ;

source: `download 7-zip MSI x86 <http://www.7-zip.org/a/7z1604.msi>`_;
fr: `télécharger 7-zip MSI x86 <https://www.7-zip.org/a/7z1604.msi>`_ ;

source: create a WAPT package Template from the installer;
fr: créer le modèle de paquet depuis l'installeur ;

source: In the WAPT console, click on :menuselection:`Tools --> Make package template from setup file`
fr: Dans la console WAPT, cliquer sur :menuselection:`Outils --> Créer un modèle de paquet depuis un installeur`.

source: Pyscripter - WAPT console window for creating a package template
fr: PyScripter - Menu pour la création de modèle de paquets depuis la console

source: Select the downloaded MSI setup file and fill in the required fields. Verify that the package name does not contains any version number.
fr: Sélectionner l'installeur MSI téléchargé et renseigner les différentes informations demandées. Veillez bien à ce que le nom du paquet ne contienne pas de numéro de version.

source: Informations required for creating the package
fr: PyScripter - Renseignements nécesssaires pour la création du paquet

source: Two solutions are available:
fr: deux solutions sont proposées :

source: click on :guilabel:`Make and edit ....` (recommended) to launch package customization;
fr: cliquer sur :guilabel:`OK` (recommandée) pour lancer la personnalisation du paquet ;

source: click on :guilabel:`Build and upload` to directly build and upload the package.
fr: cliquer sur :guilabel:`Build and upload` pour lancer la création et le chargement direct du paquet sur le serveur WAPT (non recommandé) ;

source: The button :guilabel:`Build and upload` directly uploads the package into the private repository without testing.
fr: Le bouton :guilabel:`Build and upload` envoi directement le paquet dans le dépôt privé sans tester l'installation.

source: This method works relatively well with MSI installers because their installation is more standardized.
fr: Cette méthode fonctionne assez bien avec les MSI car leur installation est standard.

source: However, the second method that consists of first testing locally the package before uploading is the recommended method.
fr: Cependant la deuxième méthode qui consiste à tester localement le paquet d'abord puis à l'uploader est la méthode recommandée.

source: Customize the package before build-upload
fr: Personnaliser le paquet avant build-upload

source: Before uploading a package to your WAPT repository, you may choose to customize its behavior to your Organization's needs by editing it with :program:`PyScripter`.
fr: La méthode conseillée avant l':command:`upload` d'un paquet est de personnaliser son comportement en l'éditant avec :program:`PyScripter`.

source: When creating the package template, click on :guilabel:`Make and edit ....`.
fr: Lors de la création du modèle de paquet, cliquer sur :guilabel:`OK`.

source: PyScripter - Informations required for creating the package
fr: PyScripter - Renseignements nécésssaires pour la création du paquet

source: PyScripter - The package has been created
fr: PyScripter - Validation de la création du modèle et ouverture de PyScripter

source: The :program:`PyScripter` IDE allows to edit files in the WAPT package.
fr: L'IDE :program:`PyScripter` se lance et permet d'éditer les fichiers du paquet.

source: PyScripter - Customizing a package with Pyscripter
fr: PyScripter - Personnalisation du paquet avec PyScripter

source: Presentation of Pyscripter
fr: Présentation de PyScripter

source: PyScripter project explorer
fr: L'explorateur de projets PyScripter

source: PyScripter - project explorer
fr: PyScripter - Explorateur de projets PyScripter

source: The PyScripter project explorer lists the different files that you might need, notably the :file:`control` file and the :file:`setup.py` file.
fr: L'explorateur de projets PyScripter liste les différents fichiers dont vous pouvez avoir besoin, notamment le fichier :file:`control` et le fichier :file:`setup.py`.

source: PyScripter - Run commands in the PyScripter project explorer
fr: PyScripter - Commandes Run dans l'explorateur de projets PyScripter

source: The :command:`Run` option in the project explorer of:program:`PyScripter` will allow you to launch actions on the packages that you are editing.
fr: Les options de :command:`Run` dans l'explorateur de projets de :program:`PyScripter` vont vous permettre de lancer des actions de votre paquet en cours d'édition.

source: Editor panel
fr: Zone d'édition

source: PyScripter - Editor panel
fr: PyScripter - zone d'édition de PyScripter

source: The edition panel in :program:`PyScripter` allows to edit the :file:`setup.py` file and the :file:`control` file.
fr: La Zone d'édition de :program:`PyScripter` permet d'éditer le fichier :file:`setup.py` ainsi que le fichier :file:`control`.

source: Python Console
fr: Console Python

source: PyScripter - Python console in PyScripter
fr: PyScripter - console python de PyScripter

source: This is the python console visible in :program:`PyScripter`, it will allow you to display the python output when you execute :command:`Run` commands.
fr: C'est la console python visible dans :program:`PyScripter`, elle va vous permettre d'afficher la sortie python lorsque vous exécuterez des commandes :command:`run`.

source: You can also use it to test/ debug portions of your script :file:`setup.py`.
fr: Vous pouvez également l'utiliser pour tester / déboguer des portions de votre script :file:`setup.py`.

source: To learn more about the composition of a wapt package, visit the documentation on the :ref:`structure of a WAPT package <structure_wapt-package>`.
fr: Pour en savoir plus sur la composition d'un paquet wapt, visitez la documentation sur la :ref:`structure d'un paquet WAPT <structure_wapt-package>`.

source: To customize a package, please visit the documentation on :ref:`customizing your WAPT packages <customizing_your_packages>`.
fr: Si vous voulez parfaire vos paquets WAPT, visitez la documentation pour :ref:`personnaliser vos paquets <customizing_your_packages>`.
