Repository: dGs-/WAPT-Documentation
Catalog: source/locale/*/LC_MESSAGES/wapt-security-principles/crypto.po
Languages: fr

source: The WAPT console signs these actions with the key and certificate of the :term:`Administrator` before sending them to the WAPT Server using an HTTPS POST request; the request is then forwarded to the targeted WAPT clients.
fr: La console WAPT signe ces actions avec la clé et le certificat du :term:`Administrateur` avant de les envoyer au serveur WAPT en utilisant une requête HTTPS POST ; la requête est ensuite transmise aux clients WAPT ciblés.

source: Possible immediate actions are:
fr: Les actions possibles sont :

source: Signing process for immediate actions
fr: Processus de signature

source: the action is defined by its name and the actions attributes. The attributes are *uuid*, *action*, *force*, *notify_server*, and *packages* (for actions implicating a list of packages)
fr: l'action est définie par son nom et des attributs dépendants de l'action. Les attributs sont *uuid*, *action*, *force*, *notify_server*, et *packages* (pour les actions impliquant une liste de paquets) ;

source: the attributes *signed_attributes*, *signer*, *signature_date*, *signer_certificate* are added to the structure of the action:
fr: les attributs *signed_attributes*, *signer*, *signature_date*, *signer_certificate* sont ajoutés à la structure de l'action :

source: *signed_attributes* list of the attributes that are signed;
fr: *signed_attributes* : liste des noms des attributs qui sont signés ;

source: *signer* Subject.COMMON_NAME of certificate holder;
fr: *signer* : commonName de l'objet du certificat du signataire ;

source: *signature_date* : current date and time (UTC) in '%Y-%m-%dT%H:%M:%S' format;
fr: *signature_date* : date et heure en cours (UTC) sous la forme '%Y-%m-%dT%H:%M:%S' ;

source: *signer_certificate* certificate holder's base64 encoded *X509* certificate;
fr: *signer_certificate* : certificat ``X509`` du signataire encodé en base64 ;

source: the structure is JSON encoded;
fr: la structure est encodée en JSON ;

source: the signature of the JSON file is calculated from the RSA private key of the *signer* using a *sha256* hash algorithm and a *PKCS1 v1.5* padding;
fr: la signature du JSON est calculée à partir de la clé privée RSA du signataire en utilisant un algorithme de hachage *sha256* et un remplissage *PKCS1 v1.5* ;

source: the signature is base64 encoded and stored on the *signature* attribute inside the JSON file;
fr: la signature est encodée en base64 et stockée dans le JSON dans l'attribut *signature* ;

source: Verifying the signature of an immediate action
fr: Vérifier la signature d'une action immédiate

source: The actions are JSON encoded, signed with the key and certificate of the :term:`Administrator`, and relayed to the targeted WAPT clients by the WAPT Server.
fr: Les actions sont encodées en JSON, signées avec la clé et le certificat de l':term:`Administrateur` et relayées vers le client WAPT visé par le serveur WAPT.

source: The action :command:`get_tasks_status` does not require SSL authentication.
fr: L'action :command:`get_tasks_status` ne demande pas d'authentification ssl.

source: Verification process
fr: Processus de vérification

source: Upon receiving an event on the Websocket connexion of the WAPT client:
fr: Sur réception d'un évènement par la connexion Websocket du client WAPT :

source: the X509 certificate of the certificate holder is extracted from the JSON file (format PEM);
fr: le certificat X509 du signataire de l'action est extrait du json (format PEM) ;

source: the WAPT client tests whether the certificate is to be trusted, i.e. that it is present in :file:`<WAPT>\ssl` or that it has been signed by a Trusted Authority (certificate of the Authority present in :file:`<WAPT>\ssl`);
fr: le client WAPT teste si le certificat est un certificat de confiance, c'est-à-dire présent dans :file:`<WAPT>\ssl` ou signé par une autorité de confiance (certificat de l'autorité présent dans :file:`<WAPT>\ssl` ;

source: the WAPT client checks whether the certificate can verify the signature that is present in the JSON structure of the action, which consists of:
fr: le client WAPT teste si le certificat peut vérifier la signature présente dans la structure JSON de l'action ce qui consiste en :

source: extracting the base64 encoded signature from the *signature* attribute in the JSON file;
fr: extraire la signature encodée en base64 dans le json depuis l'attribut *signature* ;

source: extracting the signature date formated in '%Y-%m-%dT%H:%M:%S' from the *signature_date* attribute;
fr: extraire la date de signature formatée sous la forme '%Y-%m-%dT%H:%M:%S' depuis l'attribut *signature_date* ;

source: checking that the signature date is neither too old in the past, nor too late into the future by over 10 minutes;
fr: vérifier que la date de signature n'est pas trop ancienne ou dans le futur de plus de 10 minutes ;

source: reconstructing a JSON representation of the attributes of the action;
fr: reconstruire une représentation json des attributs de l'action ;

source: checking that the certificate's public key can verify the JSON file with the signature by using a *sha256* hash algorithm and a *PKCS1 v1.5* padding;
fr: vérifier que la clé publique du certificat peut vérifier le JSON avec la signature en utilisant un algorithme de hachage *sha256* et un remplissage *PKCS1 v1.5* ;

source: Checking the complete download of a package
fr: Vérification du téléchargement complet d'un paquet

source: For each package, a *md5* sum of the package is calculated and stored in the :file:`Packages` index file of the repository.
fr: Pour chaque paquet, une somme *md5* du paquet est calculée et disponible dans l'index :file:`Packages` du dépôt.

source: When installing a package, the WAPT client checks whether a local version of the package is already available in the cache directory :file:`<WAPT>\cache`.
fr: Lors de l'installation d'un paquet, le client vérifie si le paquet est déjà disponible localement dans le répertoire :file:`<WAPT>\cache`.

source: If the package file is cached, its *md5* sum is calculated and compared with the *md5* sum in the index file. If they are different, the cached package is deleted.
fr: Si le fichier est présent, sa somme *md5* est comparée avec la somme *md5* présente dans l'index. Si elles diffèrent, le paquet en cache local est effacé.

source: This *md5* sum is only used to insure that a package has been fully downloaded.
fr: Cette somme *md5* ne sert qu'à s'assurer qu'un paquet a été téléchargé complètement.

source: The checking of the signature of the package will fully insure its integrity and its authenticity.
fr: La vérification de la signature du paquet permettra d'être effectivement assuré de l'intégrité et de l'authenticité du paquet.
