Repository: dGs-/WAPT-Documentation
Catalog: source/locale/*/LC_MESSAGES/wapt-security-principles/crypto.po
Languages: fr

source: Presentation of cryptographic processes
fr: Présentation des processus cryptographiques

source: Cybersecurity, WAPT, documentation, signature, authentication
fr: Cybersécurité, WAPT, documentation, signature, authentification

source: Written by
fr: Rédacteur

source: Applicable for WAPT
fr: Applicable pour WAPT

source: Version of the Document
fr: Version du document

source: Cryptographic processes are used in the following activities:
fr: Les processus cryptographiques sont utilisés dans les activités suivantes :

source: signature and verification of the **files contained in a package**;
fr: signature et vérification des **fichiers d'un paquet** ;

source: signature and verification of the **attributes of a package**;
fr: signature et vérification des **attributs d'un paquet** ;

source: signature and verification of **instantaneous actions** on the WAPT Clients;
fr: signature et vérification des **actions immédiates** sur les client WAPT ;

source: signature of inventories and **status of WAPT clients**;
fr: signature des inventaires et **statut des clients WAPT** ;

source: authentication of the WAPT client Websocket connections on the server;
fr: authentification de la connexion Websockets du client WAPT sur le serveur ;

source: HTTPS communication between the WAPT clients and the WAPT Server;
fr: communication https entre les clients WAPT et le serveur WAPT ;

source: HTTPS communication between the WAPT console and the WAPT Server;
fr: communication https entre la console WAPT et le serveur WAPT ;

source: HTTPS communication between the WAPT clients and the WAPT repositories;
fr: communication https entre les clients WAPT et les dépôts WAPT ;

source: Folders and files referenced in this document
fr: Répertoires et fichiers référencés dans ce document

source: :file:`<WAPT>`: WAPT installation folder. By default :file:`%Program Files (x86)%\WAPT`;
fr: :file:`<WAPT>` : répertoire d'installation de WAPT. Par défaut :file:`%Program Files (x86)%\WAPT` ;

source: :file:`<WAPT>\wapt-get.ini`: WAPT client configuration file (:program:`wapt-get` and :program:`waptservice`);
fr: :file:`<WAPT>\wapt-get.ini` : fichier de configuration du client WAPT (:program:`wapt-get` et :program:`waptservice`) ;

source: :file:`<WAPT>\ssl`: default directory for signed actions and trusted certificates;
fr: :file:`<WAPT>\ssl` : répertoire par défaut pour les certificats de confiance des paquets et actions ;

source: :file:`<WAPT>\ssl\server`: default directory for storing HTTPS server certificates (pinning);
fr: :file:`<WAPT>\ssl\server` : répertoire par défaut pour stocker les certificats https du serveur (pinning) ;

source: :file:`<WAPT>\private`: default certificate directory for signing the inventory and the Websocket connections;
fr: :file:`<WAPT>\private` : répertoire par défaut pour les certificats permettant de signer l'inventaire et les connexions Websocket ;

source: :file:`%LOCALAPPDATA%\waptconsole\waptconsole.ini`: configuration file for the console and package development actions for the :program:`wapt-get` tool;
fr: :file:`%LOCALAPPDATA%\waptconsole\waptconsole.ini` : fichier de configuration de la console et des actions de développement de l'outil :program:`wapt-get` ;

source: :file:`%appdata%\waptconsole\ssl`: default trusted certificate directory for importing packages from an external repository (i.e. *package templates*);
fr: :file:`%appdata%\waptconsole\ssl` : répertoire par défaut pour les certificats de confiance pour l'import de paquets depuis un dépot externe (c.à.d. les modèles de paquets) ;

source: Actors
fr: Acteurs

source: **Organization**
fr: **Organisation**

source: it is the realm of responsibility within which WAPT is used;
fr: il s'agit du périmètre de responsabilité dans lequel est exploitée la solution WAPT ;

source: **Certificate Authority**
fr: **Autorité de Certification**

source: it is the entity that keeps the keys that have been used to sign certificates for the :term:`Package Developers` and the HTTPS servers;
fr: elle détient les clés qui ont signé les certificats des :term:`Déployeurs de Paquets`, et des serveurs HTTPS ;

source: **Administrators**
fr: **Administrateurs**

source: they have a personal RSA key and a certificate that has been signed by the :term:`Certificate Authority` of the :term:`Organization`; they also have a login and a password for accessing the WAPT console;
fr: ils sont en possession d'une clé RSA personnelle et d'un certificat signé par l':term:`Autorité de Certification` de l':term:`Organisation` ; ils ont aussi un identifiant et un mot de passe pour accéder à la console WAPT ;

source: **WAPT clients**
fr: **Postes clients WAPT**

source: realm of Windows PCs that the :term:`Organization` has allowed the :term:`Administrators` to manage with WAPT. The Windows clients are joined to the :term:`Organization`'s Active Directory domain;
fr: PC sous Windows à administrer pour lesquels les :term:`Administrateurs` ont reçu l'accréditation de la part de l':term:`Organisation`. Les Postes client sont joints au domaine Active Directory de l':term:`Organisation`.

source: **Internal WAPT repositories**
fr: **Dépôts WAPT internes**

source: it is one or several Linux/ Nginx servers that deliver signed WAPT packages to WAPT clients using the HTTPS protocol;
fr: il s'agit d'un ou de plusieurs serveur Linux / Nginx qui diffusent aux Postes clients WAPT en HTTPS des paquets WAPT signés ;

source: **WAPT Server**
fr: **Serveur WAPT**

source: it is the Linux / Nginx/ PostgreSQL /WAPT server that the :term:`Organization` uses to keep the inventory of WAPT equipped devices.
fr: il s'agit d'un serveur Linux / Nginx / PostgreSQL / WAPT de l':term:`Organisation` qui gère l'inventaire et le status des Postes clients WAPT ;

source: By default, the WAPT Server also plays the role of an internal WAPT Repository. The WAPT Server has a machine account in the :term:`Organization`'s Active Directory.
fr: Par défaut, le serveur WAPT joue également le rôle de dépôt WAPT interne. Le serveur WAPT a un compte ordinateur dans l'Active Directory de l':term:`Organisation`.

source: **external WAPT repositories**
fr: **Dépôts WAPT externes**

source: it is a public WAPT repository that the :term:`Package Developers` may use to import packages designed by other :term:`Organizations`, under the condition that they check the adequacy of the WAPT package in regards the internal policies on security and safety;
fr: il s'agit de dépôts WAPT publics que les :term:`Déployeurs de Paquets` peuvent utiliser pour importer des paquets conçus par d'autres :term:`Organisations`, sous condition d'en vérifier l'adéquation aux normes internes de sûreté et de sécurité ;

source: **Active Directory Server**
fr: **Serveur Active Directory**

source: server that manages the :term:`Organization`'s domain;
fr: serveur gérant le domaine de l':term:`Organisation` ;

source: Summary of crypto modules present in WAPT
fr: Synthèse des modules crypto mis en oeuvre par la solution WAPT

source: On the client side of WAPT (WAPT 1.5.0.12):
fr: Coté client WAPT (WAPT 1.5.0.12) :

source: **Python 2.7.13** standard *ssl* module linked on :program:`OpenSSL 1.0.2j 26 Sep 2016`: used for the HTTPS connections between the WAPT clients and the WAPT server;
fr: module *ssl* standard de **Python 2.7.13** linké sur :program:`OpenSSL 1.0.2j 26 Sep 2016` pour les connexions https entre les clients WAPT et serveur WAPT ;

source: **cryptography==1.9** linked on :program:`openssl 1.1.0f`: used for all RSA crypto operations such as key generations, X509 certificate generations and signature verifications;
fr: **cryptography==1.9** linké sur :program:`openssl 1.1.0f` pour toutes les opérations crypto RSA, génération de clés, de certificat X509, de signature et vérification ;

source: **kerberos-sspi==0.2** and **requests-kerberos==0.11.0**: used for authenticating the WAPT client on its first registering on the WAPT Server;
fr: **kerberos-sspi==0.2** et **requests-kerberos==0.11.0** pour l'authentification du client WAPT lors de son enregistrement initial sur le serveur ;

source: **pyOpenSSL==17.0.0**: used to recover the WAPT Server certificate chain;
fr: **pyOpenSSL==17.0.0** : pour récupérer la chaîne de certificats du serveur WAPT ;

source: **certifi==2017.4.17**: used as base for the Root Authorities certificates;
fr: **certifi==2017.4.17** : base de certificats d'autorité racine ;

source: **Openssl 1.0.2l** dll: used in waptcommon.pas written with the FPC Indy library and the TIdSSLIOHandlerSocketOpenSSL class;
fr: **dll Openssl 1.0.2l** pour la partie waptcommon.pas écrite avec la bibliothèque FPC Indy et la classe TIdSSLIOHandlerSocketOpenSSL ;

source: On the server side of WAPT:
fr: Coté serveur WAPT :

source: **nginx/1.10.2**: configured for TLS1.2, cipher 'EECDH+AESGCM:EDH+AESGCM:AES256+EECDH:AES256+EDH';
fr: **nginx/1.10.2**: configurée pour TLS1.2, chiffre 'EECDH+AESGCM:EDH+AESGCM:AES256+EECDH:AES256+EDH';

source: **python 2.7.5** standard *ssl* module linked on :program:`OpenSSL 1.0.1e-fips 11 Feb 2013`;
fr: module *ssl* standard de **python 2.7.5** linké sur :program:`OpenSSL 1.0.1e-fips 11 Feb 2013` ;

source: **cryptography==1.9** linked on :program:`OpenSSL 1.0.1e-fips 11 Feb 2013`: used for all RSA crypto operations such as key generations, X509 certificate generations and signature verifications;
fr: **cryptography==1.9** linké sur :program:`OpenSSL 1.0.1e-fips 11 Feb 2013` pour toutes les opérations crypto RSA, X509, signature et vérification ;

source: Key and certificate management for the Administrator
fr: Gestion des clés et des certificat de l'Administrateur

source: Context
fr: Contexte

source: Packages and actions done by an :term:`Administrator` are signed so that only Trusted Administrators are authorized to manage the devices.
fr: Les paquets et actions de l'Administrateur sont signés pour n'autoriser que les :term:`Administrateurs` de confiance à intervenir sur les postes.

source: The WAPT :term:`Administrator` holds:
fr: L':term:`Administrateur` de la solution WAPT a en sa possession :

source: a private 2048 bit *RSA* key that has been encrypted by the aes-256-cbc algorithm;
fr: une clé privée *RSA* de 2048 bits chiffrée par l'algorithme aes-256-cbc ;

source: a *X509* certificate signed by an :term:`Certificate Authority` trusted by the :term:`Organization`;
fr: un certificat *X509* signé par une :term:`Autorité de Certification` approuvée par l':term:`Organisation` ;

source: The process for creating the keys and signing, distributing and revocating the certificates are of the responsibility of the :term:`Organization` using WAPT; that process is beyond the functional perimeter of WAPT.
fr: Le processus d'émission de ces clés, la signature du certificat, la distribution et la révocation sont à la charge de l':term:`Organisation` utilisant WAPT et sortent donc du périmètre fonctionnel de WAPT.

source: However, to make the testing of WAPT easy, WAPT offers a function to generate a RSA key and its corresponding X509 certificate:
fr: Cependant, pour facilement tester la solution, WAPT propose une fonction pour générer une clé RSA et un certificat X509 :

source: the generated RSA key is 2048bit long, encrypted with aes-256-cbc, encoded in PEM format and saved with a *.pem* extension;
fr: la clé RSA générée est de 2048 bits, chiffrée par l'algorithme aes-256-cbc et encodée en format PEM avec l'extension *.pem* ;

source: the certificate is either self-signed, or signed by a Trusted Authority from whom we have received a key and a PEM formated certificate;
fr: le certificat est soit autosigné, soit signé par une autorité dont on a à disposition la clé et le certificat en format PEM ;

source: if the certificate is self-signed, then its *KeyUsage* attribute contains the *keyCertSign* flag;
fr: si le certificat est autosigné, son attribut *KeyUsage* comporte le flag *keyCertSign* ;

source: if the :term:`Administrator` is authorized by the :term:`Organization` to sign packages that contain python code (the presence of a :file:`setup.py` file is detected in the package), the *extendedKeyUsage* attribute of the certificate contains the **CodeSigning** flag;
fr: si l':term:`Administrateur` est habilité par l':term:`Organisation` à signer des paquets contenant du code python (présence du fichier :file:`setup.py`), l'attribut du certificat *extendedKeyUsage* comporte le flag **CodeSigning** ;

source: the *X509* certificate is encoded and handed over to the :term:`Administrator` in PEM format with a *.crt* extension;
fr: le certificat *X509* est encodé et remis à l':term:`Administrateur` en format PEM avec l'extension *.crt* ;

source: Validity of the Administrator's certificate
fr: Validité du certificat de l'Administrateur

source: For WAPT version up to 1.5.0.12, WAPT agent does not verify the revocation state of the :term:`Administrator`'s certificate during the process of verifying the package, the attributes or the actions of the :term:`Administrator`.
fr: Jusqu'à la version 1.5.0.12 incluse, Le client WAPT ne gère pas la vérification de la révocation du certificat de l':term:`Administrateur` lors du processus de vérifcation des paquets, attributs et actions de l':term:`Administrateur`.

source: It only checks the dates of validity (*notValidBefore*/ *notValidAfter* attributes). The certificate is valid if (**Now** >= *notValidBefore* and **Now** <= *notValidAfter*).
fr: Il ne vérifie que les dates de validité (attributs *notValidBefore* / *notValidAfter*). Le certificat est valide si (**Now** >= *notValidBefore* et **Now** <= *notValidAfter*).

source: Authorizing the Administrator's certificate to sign a package
fr: Autoriser le certificat de l'Administrateur à signer un paquet

source: The certificate used by the WAPT console to sign packages and actions is defined with the *personal_certificate_path* parameter in the section ``[global]`` of the file :file:`%LOCALAPPDATA%\waptconsole\waptconsole.ini`.
fr: Le certificat utilisé par la console WAPT pour signer les paquets et actions est défini avec le paramètre *personal_certificate_path* de la section ``[global]`` du fichier :file:`%LOCALAPPDATA%\waptconsole\waptconsole.ini`.

source: WAPT asks the :term:`Administrator` for his password and then searches a private key (encoded in PEM format) that matches a certificate amongst the :file:`.pem` files in the directory containing the certificates.
fr: WAPT demande à l':term:`Administrateur` son mot de passe pour permettre de rechercher la clé privée (encodée au format PEM) correspondant au certificat parmi les fichiers :file:`.pem` du répertoire contenant les certificats.

source: When signing a package, WAPT will refuse the certificate if the package contains a :file:`setup.py` file and the certificate is not a *CodeSigning* type.
fr: Lors de la signature de paquet, WAPT refusera le certificat si le paquet contient un fichier :file:`setup.py` et que le certificat n'est pas de type *CodeSigning*.

source: Managing the **WAPT agent's** key and certificate
fr: Gérer les clés et certificats du **Client WAPT**

source: The WAPT client (:program:`waptservice`) uses RSA keys and X509 certificates to interact with the WAPT Server.
fr: Le client WAPT (:program:`waptservice`) utilise des clés RSA et un certificat X509 pour interagir avec le serveur WAPT.

source: The WAPT client certificate is used in the following situations:
fr: Le certificat du client WAPT est utilisé dans les situations suivantes :

source: when updating the WAPT client status on the server (:command:`update_server_status`) **signing informations**;
fr: lors de la mise à jour du statut du poste sur le serveur. (:command:`update_server_status`) : **signature des informations**

source: when the WAPT agent establishes a Websocket with the server (:program:`waptservice`) **signing the WAPT client UUID**;
fr: lors de la connexion Websocket du poste vers le serveur (:program:`waptservice`) : **signature de l'UUID du poste**

source: First emission and later update of the WAPT agent's certificate
fr: Émission initiale et mise à jour du certificat du client WAPT

source: on finishing the installation process of the WAPT agent on the device, the WAPT agent automatically registers itself on the WAPT Server by sending a Kerberos authenticated HTTPS request that uses the TGT of the machine account.
fr: à l'issu du processus d'installation de l'agent WAPT sur le Poste client, l'agent WAPT s'enregistre automatiquement auprès du serveur WAPT en émettant une requête https authentifiée par Kerberos qui utilise le TGT du compte machine ;

source: The WAPT agent uses Windows kerberos APIs implemented with :program:`kerberos-sspi` and :program:`requests-kerberos` python modules.
fr: L'agent WAPT utilise les API kerberos de Windows en s'appuyant sur les modules python :program:`kerberos-sspi` et :program:`requests-kerberos` ;

source: this process works if and only if the device is joined to the Windows domain for which the WAPT Server is configured.
fr: Cette procédure fonctionne si et seulement si le Poste client est joint au domaine Windows pour lequel le serveur WAPT est configuré.

source: if the key and the certificates have not yet been generated, or if they do not match the current :term:`FQDN` of the device, the WAPT agent generates a self-signed RSA key and X509 certificate with the following parameters:
fr: si la clé et les certificats n'ont pas encore été générés, ou s'ils ne correspondent pas au :term:`FQDN` actuel de la machine, l'agent WAPT génère une clé RSA et un certificat X509 autosigné avec les paramètres suivants :

source: the key is 2048 bit RSA encoded in PEM format and stored in the file :file:`<WAPT>\private\<device FQDN>.pem`;
fr: la clé est de type RSA 2048 bits encodée en PEM et stockée dans le fichier :file:`<WAPT>\private\<fqdn du poste>.pem` ;

source: the generated certificate has the following attributes:
fr: le certificat généré a les attributs suivants :

source: *Subject.ORGANIZATIONAL_UNIT_NAME* = name of the :term:`Organization` registered in the WAPT client's Windows registry;
fr: *Subject.ORGANIZATIONAL_UNIT_NAME* = nom de l':term:`Organisation` de la machine tel qu'enregistré dans la base de registre ;

source: *validity* = 10 years;
fr: *validity* = 10 ans ;

source: *serialnumber* = random;
fr: *serialnumber* = aléatoire ;

source: the certificate is saved in the :file:`<WAPT>\private\<device FQDN>.crt`;
fr: le certificat est sauvegardé dans le fichier :file:`<WAPT>\private\<device FQDN>.crt` ;

source: Only machine accounts and :term:`Local Administrators` have access to the :file:`<WAPT>\private` directory because specific ACLs have been applied upon first installation of the WAPT agent on the device.
fr: Seuls le compte machine et les :term:`Administrateurs Locaux` ont accès au répertoire :file:`<WAPT>\private` car des ACL spécifiques sont appliquées à l'installation de l'agent WAPT sur le poste.

source: the inventory and the WAPT agent status updates are sent to the WAPT Server over POST HTTPS requests;
fr: l'inventaire ou les mises à jour de status du client sont envoyés au serveur WAPT par requête https POST ;

source: the POST HTTPS requests are authenticated by adding two specific headers:
fr: on authentifie la requête https POST en ajoutant deux headers http spécifiques :

source: JSON encoded :abbr:`BLOB (Binary Large Object)` of inventory or status informations;
fr: encodage en JSON des informations d'inventaire ou de status ;

source: signature of the JSON file with the private key of the WAPT Client: *sha256* hashing and *PKCS#1 v1.5* padding;
fr: signature du json avec la clé privée du client WAPT : hachage *sha256* et padding *PKCS#1 v1.5* ;

source: *base64* encoding of the signature;
fr: encodage de la signature en *base64* ;

source: *X-Signer*: *Subject.COMMON_NAME* or UUID of the WAPT Client.
fr: *X-Signer*: *Subject.COMMON_NAME* ou UUID du client WAPT.

source: after having initially authenticated the WAPT client with Kerberos, the WAPT Server receives the certificate sent by the Client and stores it in the table *hosts* of its inventory in PEM format (column *host_certificate*).
fr: après avoir initialement authentifié le client WAPT avec Kerberos, le serveur reçoit le certificat envoyé par le client et il le stocke dans son inventaire, dans la table *hosts* (champ *host_certificate* en format PEM).

source: If the device is renamed, the key/ certificate pair is regenerated.
fr: Si le poste client WAPT est renommé, la paire de clés et le certificat sont recréés.

source: When the WAPT agent will update its status with the WAPT Server, the POST request will be refused because the remote device is registered in the database with another certificate.
fr: Lors de la tentative de mise à jour de status du client vers le serveur, la requête POST sera refusée, car la machine est enregistrée dans la base de données avec un autre certificat.

source: The device will then retry to :command:`register` with the WAPT Server using Kerberos; then the new certificate will be saved in the database.
fr: La machine tentera alors de se ré-enregistrer (:command:`register`) avec authentification kerberos ; ainsi le nouveau certificat sera enregistré dans la base de données.

source: Deploying certificates of Authorities of Certification to verify packages and validate actions on Clients
fr: Déployer les certificats d'autorité pour vérifier les paquets et les actions sur les clients

source: PEM formated certificates are stored in files with *.crt* or *.pem* extensions in the directory defined with the *public_certs_dir* parameter in the file :file:`<WAPT>\wapt-get.ini`. They are reputed to be **trusted certificates**.
fr: Les certificats au format PEM stockés dans des fichiers avec l'extension .crt ou .pem et présents dans le répertoire défini par le paramètre *public_certs_dir* du fichier :file:`<WAPT>\wapt-get.ini` sont réputés **de confiance**.

source: The *public_certs_dir* parameter is initialized by default to be :file:`<WAPT>\ssl`.
fr: Ce paramètre *public_certs_dir* est initialisé par défaut à :file:`<WAPT>\ssl`.

source: Authority certificates are deployed when the WAPT agents are first deployed.
fr: Le déploiement de ces certificats d'autorité est effectué lors de l'installation initiale de l'agent WAPT par l'installeur.

source: From the console, the :term:`Administrator` compiles a personalized installer to be deployed by :term:`GPO` or other means on target devices.
fr: Depuis la console, l':term:`Administrateur` compile un installeur personnalisé en vue de son déploiement par :term:`GPO` sur les Postes clients.

source: The WAPT console includes in its personalized installer the certificates present in the :file:`<WAPT>\ssl` directory of the PC on which the installer is being compiled.
fr: La console WAPT incorpore dans cet installeur les certificats présents dans le répertoire :file:`<WAPT>\ssl` du poste depuis lequel l'installeur est compilé.

source: The :term:`Administrator` must insure to save in :file:`<WAPT>\ssl` only the certificates of Authorities that are strictly necessary before launching the compilation of the installer.
fr: L':term:`Administrateur` doit s'assurer d'enregistrer dans :file:`<WAPT>\ssl` uniquement les certificats d'autorité nécessaires avant de lancer la compilation de l'agent.

source: New or updated certificates of :term:`Certificate Authority` for the verification of packages and the validation of actions may also be deployed a posteriori with an Active Directory GPO or a WAPT package.
fr: Le déploiement ou la mise à jour de certificats de l':term:`Autorité de Certification` pour la vérification des paquets et actions peuvent être également assurés à postériori par une GPO Active Directory ou par un paquet WAPT.
