Repository: dGs-/WAPT-Documentation
Catalog: source/locale/*/LC_MESSAGES/wapt-security-principles/crypto.po
Languages: fr

source: Deploying certificates of Authorities of Certification for the HTTPS communication between the WAPT clients and the WAPT Server
fr: Déployer les certificats d'autorité pour la communication HTTPS entre les clients WAPT et le serveur WAPT

source: The WAPT service (:program:`waptservice`) and the command line tool :program:`wapt-get` exchange with the WAPT Server to send its inventory (:command:`register`) and the package deployment status (:command:`update-status`).
fr: Le service WAPT ainsi que l'outil en ligne de commande :program:`wapt-get` communiquent avec le serveur WAPT pour envoyer l'inventaire (:command:`register`) et le statut de déploiement des paquets (:command:`update-status`).

source: These two types of connections verify the HTTPS certificate of the WAPT Server.
fr: Ces deux types de connexions vérifient le certificat https du serveur.

source: *verify_cert* parameter in section ``[global]`` in :file:`<WAPT>\wapt-get.ini`:
fr: Paramètre *verify_cert* de la section ``[global]`` du fichier :file:`<WAPT>\wapt-get.ini` :

source: this method will only work well if the HTTPS server is configured to send its certificate and the intermediary certificates upon initialization of the TLS connexion.
fr: Vérifie le certificat du serveur https en utilisant le bundle fourni par le module :program:`certifi`. Ne fonctionnera bien que si le serveur https est configuré pour renvoyer son certificat et les certificats intermédiaires à l'initialisation de communication TLS ;

source: *verify_cert* = <path to .pem>
fr: *verify_cert* = <chemin vers fichier .pem>

source: check the HTTPS certificate using the indicated bundle of certificates. All the certificates of the intermediary Certificate Authorities must be bundled in a *.pem* formated file;
fr: Vérifie le certificat du serveur https en utilisant le bundle de certificats indiqué. Tous les certificats de CA intermédiaires et root doivent être rassemblés dans un fichier au format *.pem* ;

source: do not verify the HTTPS certificate of the server;
fr: Ne pas vérifier le certificat du serveur https ;

source: Conventionally, the approved bundle of certificates from the :term:`Certificate Authority` is stored in the :file:`<WAPT>\ssl\server` directory.
fr: Conventionnellement, on stocke le bundle de l':term:`Autorité de Certification` approuvées dans le répertoire :file:`<WAPT>\ssl\server`.

source: The WAPT console includes a function to facilitate the initial recovery of the server certificate chain. The function stores it in *.pem* format in :file:`<WAPT>\ssl\server\<server FQDN>`.
fr: La console WAPT comporte une fonction pour faciliter la récupération initiale de la chaîne de certificats du serveur et pour la stocker au format .pem dans le fichier :file:`<WAPT>\ssl\server\<FQDN serveur>.pem`.

source: The :term:`Administrator` is responsible for insuring that the recovered certificate chain is **authentic**.
fr: Il est de la responsabilité de l':term:`Administrateur` de s'assurer que la chaîne ainsi récupérée est authentique.

source: During the compilation of the WAPT agent installer, the certificates or the bundle of certificates is incorporated into the installer.
fr: Lors de la compilation de l'installeur de l'agent WAPT, les certificats ou le bundle de certificats sont intégrés dans l'installeur.

source: When the installer is deployed on the WAPT clients, the bundle is copied in :file:`<WAPT>\ssl\server` and the *verify_cert* parameter in section``[global]`` in :file:`<WAPT>\wapt-get.ini` is filled out to indicate the path to the bundle.
fr: Lors du déploiement de l'installeur sur les clients WAPT, le bundle est copié dans :file:`<WAPT>\ssl\server` et le paramètre *verify_cert* de la section ``[global]`` du fichier :file:`<WAPT>\wapt-get.ini` est renseigné pour désigner le bundle.

source: HTTPS communication between the WAPT clients and the WAPT repositories
fr: Communications HTTPS entre les clients WAPT et les dépôts WAPT

source: Deploying certificates of Authorities of Certification
fr: Déployer des certificats d'autorité

source: The HTTPS exchanges between the WAPT agent and the main repository and between the WAPT agent and the WAPT Server use the same methods.
fr: Les connexions HTTPS de l'agent WAPT vers le dépôt principal utilisent les mêmes méthodes que les communications entre l'agent WAPT et le serveur WAPT.

source: The WAPT agent uses the same bundle of certificates to communicate in HTTPS with the main repository, with the WAPT Server, and with the secondary repositories.
fr: L'agent WAPT utilise le même bundle de certificats pour communiquer en HTTPS avec le dépôt principal, avec le serveur WAPT, et avec les dépôts secondaires.

source: The WAPT client
fr: Client WAPT

source: The HTTPS connection is implemented with :program:`requests`, :program:`urllib3` et :program:`ssl` python modules.
fr: La connexion https est mise en œuvre par les modules python :program:`requests`, :program:`urllib3` et :program:`ssl`.

source: The certificate emitted by the repository HTTPS server is verified with the :program:`urllib3.contrib.pysopenssl.PyOpenSSLContext` and :program:`urllib3.util.ssl_wrap_socket` python modules.
fr: Le certificat transmis par le serveur HTTPS du dépôt est vérifié par le module :program:`urllib3.contrib.pysopenssl.PyOpenSSLContext` et :program:`urllib3.util.ssl_wrap_socket`.

source: Websocket communications between the WAPT clients and the WAPT Server
fr: Communications Websockets entre les clients WAPT et le serveur WAPT

source: To allow immediate actions on the WAPT clients, the WAPT service deployed on the clients establishes and maintains a permanent Websocket with the WAPT server.
fr: Pour permettre des actions immédiates sur les clients WAPT, le service WAPT déployé sur les clients tente d'établir et de maintenir une connexion Websocket vers le serveur WAPT.

source: This connection is TLS encrypted and uses on the client side the same bundle of certificates as the HTTPS connexion from the WAPT client to the WAPT Server.
fr: Cette connexion s'effectue sur un connexion chiffrée avec le protocole TLS et utilise côté client le même bundle de certificat que la connexion HTTPS Client vers Serveur WAPT.

source: Communications between the WAPT console and the WAPT Server
fr: Communications entre la console WAPT et le serveur WAPT

source: *verify_cert* parameter in section ``[global]`` in file :file:`%LOCALAPPDATA%\waptconsole\waptconsole.ini`:
fr: Paramètre *verify_cert* de la section ``[global]`` du fichier :file:`%LOCALAPPDATA%\waptconsole\waptconsole.ini` :

source: The WAPT console includes a function that facilitates the initial recovery of the server certificate chain and that stores it in *.pem* format in the :file:`<WAPT>\ssl\server\<server FQDN>`.
fr: La console WAPT comporte une fonction pour faciliter la récupération initiale de la chaîne de certificats du serveur et la stocker au format *.pem* dans le fichier :file:`<WAPT>\ssl\server\<FQDN serveur>`.

source: It is also possible to recover the server certificate chain and fill out the *verify_cert* parameter with the command line :code:`wapt-get enable-check-certificate`.
fr: Il est également possible de récupérer la chaîne de certificats du serveur et de renseigner le paramètre *verify_cert* avec la commande :command:`wapt-get enable-check-certificate`.

source: Deploying the certificates of Authorities of Certification to verify packages imported in the main repository
fr: Déployer des certificats d'autorité pour vérifier les paquets importés dans le dépôt local

source: In the WAPT console, tab :guilabel:`Private Repository`, a button :guilabel:`Import from Internet` allows to download a package from an external repository whose address is provided with the *repo-url* parameter in the section ``[wapt_templates]`` of :file:`%LOCALAPPDATA%\waptconsole\waptconsole.ini`.
fr: Dans la console WAPT / onglet :guilabel:`Dépôt privé`, un bouton :guilabel:`Importer depuis internet` permet de télécharger un paquet depuis un dépôt externe dont l'URL est fournie par le paramètre *repo_url* de la section ``[wapt_templates]`` du fichier :file:`%LOCALAPPDATA%\waptconsole\waptconsole.ini`.

source: A checkbox :guilabel:`Verify Package Signature` insures that the imported package has been signed with a trusted certificate.
fr: Une case à cocher :guilabel:`Vérifier la signature de paquet` permet de s'assurer que le paquet est signé avec un certificat provenant d'une Autorité de confiance.

source: Certificates from Trusted Authorities
fr: Certificats d'Autorités de confiance

source: The certificates from Trusted Authorities present in the directory specified with the *public_certs_dir* parameter in section ``[wapt_templates]`` in file :file:`%LOCALAPPDATA%\waptconsole\waptconsole.ini` are considered to be trusted.
fr: Les certificats d'autorité présents dans le répertoire désigné par le paramètre *public_certs_dir* de la section ``[wapt_templates]`` du fichier :file:`%LOCALAPPDATA%\waptconsole\waptconsole.ini` sont réputés de confiance.

source: If the parameter is not explicitly mentioned, it is initialized at :file:`%appdata%\waptconsole\ssl`.
fr: Si le paramètre n'est pas mentionné explicitement, il est initialisé à :file:`%appdata%\waptconsole\ssl`.

source: This directory is not automatically populated by WAPT. It is the responsibility of the :term:`Administrator` to copy/ paste into it the :file:`PEM` files of other trusted :term:`Administrators` or the certificates from trusted Certificate Authorities.
fr: Ce répertoire n'est pas automatiquement rempli par WAPT. Il est de la responsabilité de l':term:`Administrateur` de copier/coller les fichiers PEM d'autres :term:`Administrateurs` de confiance ou les certificats des Autorités de Certification de confiance.

source: The Certificates from Trusted Authorities are encoded in *.pem* format and stored in files with *.pem* or *.crt* extensions. It is possible to store several certificates in each :file:`.crt` or :file:`.pem` file.
fr: Les certificats d'autorité sont encodés en format PEM et stockés dans des fichiers avec l'extension *.pem* ou *.crt*. On peut stocker plusieurs certificats dans chaque fichier :file:`.crt` ou :file:`.pem`.

source: It is not necessary to have the complete chain of certificates, WAPT will accept the signature of a package as long as:
fr: Il n'est pas nécessaire d'avoir la chaîne complète de certificats, WAPT acceptera le signataire d'un paquet à partir du moment que :

source: the certificate of the package is also included in the *public_certs_dir* directory. The matching is done using the fingerprint of the certificate;
fr: le certificat du paquet est également présent dans le répertoire *public_certs_dir*. Le test d'égalité est fait avec l'empreinte du certificat ;

source: the certificate of the Authority that has signed the certificate of the package is included in the *public_certs_dir* directory. The matching is done using the *issuer_subject_hash* attribute of the certificate. The signature of the certificate is done using the :program:`x509.verification.CertificateVerificationContext` class;
fr: le certificat de l'Autorité ayant signé le certificat du paquet est présent dans le répertoire *public_certs_dir*. La recherche est faite avec l'attribut *issuer_subject_hash* du certificat. La signature du certificat est effectuée par la classe :program:`x509.verification.CertificateVerificationContext` ;

source: Process for signing a package
fr: Processus de signature d'un paquet

source: The process for signing a package is launched with the following actions:
fr: Le processus de signature du paquet est lancé lors des actions suivantes :

source: action :code:`wapt-get.exe build-upload <directory>`;
fr: action :code:`wapt-get.exe build-upload <répertoire>` ;

source: action :code:`wapt-get.exe sign-package <path-to-package-file.wapt>`;
fr: action :code:`wapt-get.exe sign-package <chemin-fichier-paquet.wapt>` ;

source: shell command :code:`wapt-signpackage.py <WAPT-package-list>`;
fr: commande shell :code:`wapt-signpackage.py <liste de fichiers paquets WAPT>` ;

source: saving a *host* package in the WAPT console;
fr: sauvegarde d'un paquet *host* dans la console WAPT ;

source: saving a *group* package in the WAPT console;
fr: sauvegarde d'un paquet *group* dans la console WAPT ;

source: importing a package from an external repository;
fr: import direct d'un paquet depuis un dépôt externe ;

source: creating a package with the MSI setup wizard;
fr: wizard de création de paquets à partir de MSI et de setup ;

source: Initial parameters
fr: Paramètres initiaux

source: ZIP file of the package;
fr: fichier ZIP du paquet ;

source: *.pem* formated RSA private key of the certificate holder (encrypted with OpenSSL's *aes-256-cbc* algorithm if the key has been created in the WAPT console);
fr: clé privée RSA du signataire encodée en format *.pem* et chiffrée (par l'algorithme *aes-256-cbc* de openssl si la clé a été créée dans la console WAPT) ;

source: *X509* certificate of the certificate holder matching the private key;
fr: certificat *X509* du signataire correspondant à la clé privée ;

source: if the package to be signed contains a :file:`setup.py` file, then the *X509* certificate must have the *advanced Key Usage* extension *codeSigning (1.3.6.1.5.5.7.3.3)*;
fr: si le paquet à signer contient un fichier :file:`setup.py`, le certificat *X509* doit avoir l'extension *advanced Key Usage* : *codeSigning (1.3.6.1.5.5.7.3.3)* ;

source: Signature of the attributes in the control file
fr: Signature des attributs du fichier control

source: The :file:`control` file defines the metadata of a package and in particular its name, its version, its dependencies and its conflicts. It is the identity card of the WAPT package.
fr: Le fichier :file:`control` d'un paquet décrit les métadonnées du paquet, en particulier son nom, sa version, ses dépendances et ses conflits. C'est la fiche d'identité du paquet.

source: These metadata are primarily used by the WAPT agent to determine whether a package must be upgraded, and what packages must be first installed or removed.
fr: Ces métadonnées sont primitivement utilisées par l'agent WAPT pour déterminer si un paquet doit être mis à jour, et quels autres paquets doivent être installés ou désinstallés préalablement.

source: The package attributes are therefore signed to insure the integrity and the authenticity of the WAPT package.
fr: Ces informations sont donc signées pour garantir aux Postes client leur intégrité et leur authenticité.

source: Process steps:
fr: Etapes du processus :

source: the attributes *signed_attributes*, *signer*, *signature_date*, *signer_fingerprint* are added to the structure of the :file:`control` file:
fr: les attributs *signed_attributes*, *signer*, *signature_date*, *signer_certificate* sont ajoutés à la structure du fichier :file:`control` :

source: *signed_attributes*: comma separated list of the names of the attributes;
fr: *signed_attributes* : liste des noms d'attributs avec séparateur virgule (*,*) ;

source: *signer*: CommonName of the certificate holder;
fr: *signer* : commonName de l'objet du certificat du signataire ;

source: *signature_date*: current date and time (UTC) in '%Y-%m-%dT%H:%M:%S format;
fr: *signature_date* : date et heure en cours (UTC) sous la forme '%Y-%m-%dT%H:%M:%S' ;

source: *signer_fingerprint*: hexadecimal encoded ``sha256`` fingerprint of the fingerprint obtained with the :program:`fingerprint` function included in the :program:`cryptography.x509.Certificate` class;
fr: *signer_fingerprint* : empreinte ``sha256`` du certificat encodée en hexadécimal obtenue par la fonction :program:`fingerprint` de la classe :program:`cryptography.x509.Certificate` ;

source: the attributes of the control structure are JSON encoded;
fr: les attributs de la structure control sont encodés en json ;

source: the resulting JSON :abbr:`BLOB (Binary Large Object)` is signed with *sha256* hashing and *PKCS#1 v1.5* padding;
fr: le JSON :abbr:`BLOB (Binary Large Object)` résultant est signé avec un hachage *sha256* et un remplissage *PKCS#1 v1.5* ;

source: the signature is base64 encoded and stored as a *signature* attribute in the :file:`control` file;
fr: la signature est encodée en base64 et stockée dans le JSON dans l'attribut *signature* du fichier :file:`control` ;

source: Signing the files of the package
fr: Signature des fichiers du paquet

source: the :file:`control` file attributes are signed and serialized in JSON format. The result is stored in the :file:`<WAPT>\control` file of the WAPT package;
fr: les attributs du fichier control sont signés et sérialisés en JSON. Le résultat est stocké dans le fichier :file:`<WAPT>\control` du ZIP du paquet ;

source: the PEM serialized X509 certificate of the certificate holder is stored in the :file:`<WAPT>\certificate.crt` file of the WAPT package;
fr: le certificat X509 du signataire depuis le fichier est stocké dans le fichier :file:`<WAPT>\certificate.crt` du paquet WAPT ;

source: the *sha256* fingerprints of the all files contained in the WAPT package are hexadecimal encoded and stored as a JSON list [(filename,hash),] in the :file:`<WAPT>\manifest.sha256` file in the WAPT package;
fr: les empreintes *sha256* de tous les fichiers contenus dans le paquet WAPT sont codées en hexadécimal et stockées sous forme de liste JSON [(nom de fichier, hachage),] dans le fichier :file:`<WAPT>\manifest.sha256` dans le paquet WAPT ;

source: the content of the file :file:`<WAPT>\manifest.sha256` is signed with the private key of the :term:`Administrator` (2048 bit RAS key), *sha256* hashed and *PKCS#1 v1.5* padded:
fr: le contenu du fichier :file:`<WAPT>\manifest.sha256` est signé avec la clé privée de l':term:`Administrateur` (clé RAS 2048 bits), avec un hachage *sha256* et un remplissage *PKCS#1 v1.5* :

source: the signature process relies on the signing function of the :program:`cryptography.rsa.RSAPrivateKey.signer` class;
fr: la procédure de signature fait appel à la fonction sign de la classe :program:`cryptography.rsa.RSAPrivateKey.signer` ;

source: :program:`cryptography.rsa.RSAPrivateKey.signer` relies on the OpenSSL functions of :program:`EVP_DigestSignInit`;
fr: :program:`cryptography.rsa.RSAPrivateKey.signer` repose sur les fonctions OpenSSL de :program:`EVP_DigestSignInit` ;

source: the signature is base64 serialized and stored in the file :file:`<WAPT>\signature.sha256` of the WAPT package;
fr: la signature est encodée en base64 et stockée dans le fichier :file:`<WAPT>\signature.sha256` du paquet WAPT ;

source: Verifying the signature of a package attributes
fr: Vérifier la signature des attributs d'un paquet

source: The verification takes place:
fr: Elle a lieu :

source: when the index file of available packages on the WAPT client is updated from the :file:`Packages` index file on the repository;
fr: lors de la mise à jour de l'index des paquets disponibles à partir de l'index :file:`Packages` du dépôt ;

source: when a package signature is verified (installation, download) when not in *development* mode, i.e. if the installation takes place from a ZIP file and not from a development directory;
fr: lorsqu'une signature de paquet est vérifiée (installation, téléchargement) lorsqu'elle n'est pas en mode *développement*, c'est-à-dire si l'installation se fait à partir d'un fichier ZIP et non d'un répertoire de développement ;

source: The verification consists of:
fr: Elle consiste à :

source: reading the control attributes from the WAPT package's :file:`control` file;
fr: lire les attributs du fichier control depuis le fichier :file:`<WAPT>\control` du ZIP du paquet ;

source: recovering the X509 certificate from the certificate holder from the WAPT package's :file:`certificate.crt` file;
fr: récupérer le certificat X509 du signataire depuis le fichier :file:`<WAPT>\certificate.crt` du ZIP du paquet ;

source: decoding the base64 formated signature attribute;
fr: décoder l'attribut signature du control depuis le format base64 ;

source: constructing a JSON structure with the attributes to be signed (such as defined in the :program:`PackageEntry` class);
fr: construire une structure JSON avec les attributs devant être signés (tels que définis dans la classe :program:`PackageEntry`) ;

source: verifying if the public key of the holder's certificate can verify the hash of the JSON structured list of attributes and the signature of the :file:`control` file, using *sha256* hashing and *PKCS#1 v1.5* padding;
fr: vérifier si la clé publique du certificat du titulaire peut vérifier le hachage de la liste structurée des attributs JSON et la signature du fichier :file:`control`, en utilisant le hachage *sha256* et le remplissage *PKCS#1 v1.5* ;

source: verifying whether the certificate is trusted (either it is present in the list of trusted certificates, or signed by a Trusted :term:`Certificate Authority`);
fr: vérifier si le certificat est de confiance (soit présent en tant que tel dans les certificats de confiance, soit signé par une :term:`Autorité de Certification` de confiance) ;

source: In case we must verify the attributes without having the WAPT package on hand, we recover the list of certificates of potential certificate holders from the :file:`Packages` index file on the WAPT repository. The certificates are named :file:`ssl/<hexadecimal formated certificate fingerprint>.crt`.
fr: Dans le cas où nous devons vérifier les attributs sans avoir le paquet WAPT à disposition, nous récupérons la liste des certificats des détenteurs potentiels de certificats à partir du fichier d'index :file:`Packages` sur le dépôt WAPT. Les certificats sont nommés :file:`ssl/<hexadecimal formated certificate fingerprint>.crt`.

source: An attribute in the WAPT package's :file:`control` file specifies the fingerprint of the :file:`control` file's certificate holder.
fr: Un attribut de la structure :file:`control` du paquet indique l'empreinte du certificat du signataire du fichier :file:`control`.

source: Verifying the signature of a WAPT package
fr: Vérifier la signature d'un paquet

source: when installing a package on a WAPT Client;
fr: lors de l'installation d'un paquet sur un Poste client ;

source: when editing an existing package;
fr: lors de l'édition d'un paquet existant ;

source: when importing a package from an external repository (if the checkbox is checked in the WAPT console);
fr: lors de l'import d'un paquet depuis un dépôt externe (si option cochée dans la console) ;

source: verifying that the certificate has been signed by a Trusted Authority whose certificate is present in the file :file:`ssl` on the WAPT client;
fr: vérifier que le certificat a été signé par une autorité de confiance dont le certificat est présent dans le fichier :file:`ssl` du client WAPT ;

source: verifying the signature of the file :file:`manifest.sha256` with the public key;
fr: vérifier la signature du fichier :file:`<WAPT>\manifest.sha256` avec la clé publique ;

source: Signing immediate actions
fr: Signature d'une action immédiate

source: From the WAPT console, the :term:`Administrators` may launch actions directly on the WAPT clients connected with the WAPT Server using Websockets.
fr: Depuis la console, l':term:`Administrateur` peut déclencher des actions directes sur le client WAPT, s'il est connecté au serveur par le mode Websockets.
